var AREA_DATA = [
  {
    "name": "中国",
    "code": "1",
    "children": [
      {
        "name": "北京",
        "code": "11",
        "children": [
          {
            "name": "东城",
            "code": "1"
          },
          {
            "name": "房山",
            "code": "11"
          },
          {
            "name": "通州",
            "code": "12"
          },
          {
            "name": "顺义",
            "code": "13"
          },
          {
            "name": "西城",
            "code": "2"
          },
          {
            "name": "昌平",
            "code": "21"
          },
          {
            "name": "大兴",
            "code": "24"
          },
          {
            "name": "平谷",
            "code": "26"
          },
          {
            "name": "怀柔",
            "code": "27"
          },
          {
            "name": "密云",
            "code": "28"
          },
          {
            "name": "延庆",
            "code": "29"
          },
          {
            "name": "朝阳",
            "code": "5"
          },
          {
            "name": "丰台",
            "code": "6"
          },
          {
            "name": "石景山",
            "code": "7"
          },
          {
            "name": "海淀",
            "code": "8"
          },
          {
            "name": "门头沟",
            "code": "9"
          }
        ]
      },
      {
        "name": "天津",
        "code": "12",
        "children": [
          {
            "name": "和平",
            "code": "1"
          },
          {
            "name": "东丽",
            "code": "10"
          },
          {
            "name": "西青",
            "code": "11"
          },
          {
            "name": "津南",
            "code": "12"
          },
          {
            "name": "北辰",
            "code": "13"
          },
          {
            "name": "河东",
            "code": "2"
          },
          {
            "name": "宁河",
            "code": "21"
          },
          {
            "name": "武清",
            "code": "22"
          },
          {
            "name": "静海",
            "code": "23"
          },
          {
            "name": "宝坻",
            "code": "24"
          },
          {
            "name": "蓟县",
            "code": "25"
          },
          {
            "name": "河西",
            "code": "3"
          },
          {
            "name": "南开",
            "code": "4"
          },
          {
            "name": "河北",
            "code": "5"
          },
          {
            "name": "红桥",
            "code": "6"
          },
          {
            "name": "滨海新区",
            "code": "26"
          }
        ]
      },
      {
        "name": "河北",
        "code": "13",
        "children": [
          {
            "name": "石家庄",
            "code": "1",
            "children": [
              {
                "name": "长安区",
                "code": "130102"
              },
              {
                "name": "桥东区",
                "code": "130103"
              },
              {
                "name": "桥西区",
                "code": "130104"
              },
              {
                "name": "新华区",
                "code": "130105"
              },
              {
                "name": "井陉矿区",
                "code": "130107"
              },
              {
                "name": "裕华区",
                "code": "130108"
              },
              {
                "name": "井陉县",
                "code": "130121"
              },
              {
                "name": "正定县",
                "code": "130123"
              },
              {
                "name": "栾城县",
                "code": "130124"
              },
              {
                "name": "行唐县",
                "code": "130125"
              },
              {
                "name": "灵寿县",
                "code": "130126"
              },
              {
                "name": "高邑县",
                "code": "130127"
              },
              {
                "name": "深泽县",
                "code": "130128"
              },
              {
                "name": "赞皇县",
                "code": "130129"
              },
              {
                "name": "无极县",
                "code": "130130"
              },
              {
                "name": "平山县",
                "code": "130131"
              },
              {
                "name": "元氏县",
                "code": "130132"
              },
              {
                "name": "赵县",
                "code": "130133"
              },
              {
                "name": "辛集市",
                "code": "130181"
              },
              {
                "name": "藁城市",
                "code": "130182"
              },
              {
                "name": "晋州市",
                "code": "130183"
              },
              {
                "name": "新乐市",
                "code": "130184"
              },
              {
                "name": "鹿泉市",
                "code": "130185"
              }
            ]
          },
          {
            "name": "廊坊",
            "code": "10",
            "children": [
              {
                "name": "安次区",
                "code": "131002"
              },
              {
                "name": "广阳区",
                "code": "131003"
              },
              {
                "name": "固安县",
                "code": "131022"
              },
              {
                "name": "永清县",
                "code": "131023"
              },
              {
                "name": "香河县",
                "code": "131024"
              },
              {
                "name": "大城县",
                "code": "131025"
              },
              {
                "name": "文安县",
                "code": "131026"
              },
              {
                "name": "大厂回族自治县",
                "code": "131028"
              },
              {
                "name": "霸州市",
                "code": "131081"
              },
              {
                "name": "三河市",
                "code": "131082"
              }
            ]
          },
          {
            "name": "衡水",
            "code": "11",
            "children": [
              {
                "name": "桃城区",
                "code": "131102"
              },
              {
                "name": "枣强县",
                "code": "131121"
              },
              {
                "name": "武邑县",
                "code": "131122"
              },
              {
                "name": "武强县",
                "code": "131123"
              },
              {
                "name": "饶阳县",
                "code": "131124"
              },
              {
                "name": "安平县",
                "code": "131125"
              },
              {
                "name": "故城县",
                "code": "131126"
              },
              {
                "name": "景　县",
                "code": "131127"
              },
              {
                "name": "阜城县",
                "code": "131128"
              },
              {
                "name": "冀州市",
                "code": "131181"
              },
              {
                "name": "深州市",
                "code": "131182"
              }
            ]
          },
          {
            "name": "唐山",
            "code": "2",
            "children": [
              {
                "name": "路南区",
                "code": "130202"
              },
              {
                "name": "路北区",
                "code": "130203"
              },
              {
                "name": "古冶区",
                "code": "130204"
              },
              {
                "name": "开平区",
                "code": "130205"
              },
              {
                "name": "丰南区",
                "code": "130207"
              },
              {
                "name": "丰润区",
                "code": "130208"
              },
              {
                "name": "滦　县",
                "code": "130223"
              },
              {
                "name": "滦南县",
                "code": "130224"
              },
              {
                "name": "乐亭县",
                "code": "130225"
              },
              {
                "name": "迁西县",
                "code": "130227"
              },
              {
                "name": "玉田县",
                "code": "130229"
              },
              {
                "name": "唐海县",
                "code": "130230"
              },
              {
                "name": "遵化市",
                "code": "130281"
              },
              {
                "name": "迁安市",
                "code": "130283"
              }
            ]
          },
          {
            "name": "秦皇岛",
            "code": "3",
            "children": [
              {
                "name": "海港区",
                "code": "130302"
              },
              {
                "name": "山海关区",
                "code": "130303"
              },
              {
                "name": "北戴河区",
                "code": "130304"
              },
              {
                "name": "青龙满族自治县",
                "code": "130321"
              },
              {
                "name": "昌黎县",
                "code": "130322"
              },
              {
                "name": "抚宁县",
                "code": "130323"
              },
              {
                "name": "卢龙县",
                "code": "130324"
              }
            ]
          },
          {
            "name": "邯郸",
            "code": "4",
            "children": [
              {
                "name": "邯山区",
                "code": "130402"
              },
              {
                "name": "丛台区",
                "code": "130403"
              },
              {
                "name": "复兴区",
                "code": "130404"
              },
              {
                "name": "峰峰矿区",
                "code": "130406"
              },
              {
                "name": "邯郸县",
                "code": "130421"
              },
              {
                "name": "临漳县",
                "code": "130423"
              },
              {
                "name": "成安县",
                "code": "130424"
              },
              {
                "name": "大名县",
                "code": "130425"
              },
              {
                "name": "涉　县",
                "code": "130426"
              },
              {
                "name": "磁　县",
                "code": "130427"
              },
              {
                "name": "肥乡县",
                "code": "130428"
              },
              {
                "name": "永年县",
                "code": "130429"
              },
              {
                "name": "邱　县",
                "code": "130430"
              },
              {
                "name": "鸡泽县",
                "code": "130431"
              },
              {
                "name": "广平县",
                "code": "130432"
              },
              {
                "name": "馆陶县",
                "code": "130433"
              },
              {
                "name": "魏　县",
                "code": "130434"
              },
              {
                "name": "曲周县",
                "code": "130435"
              },
              {
                "name": "武安市",
                "code": "130481"
              }
            ]
          },
          {
            "name": "邢台",
            "code": "5",
            "children": [
              {
                "name": "桥东区",
                "code": "130502"
              },
              {
                "name": "桥西区",
                "code": "130503"
              },
              {
                "name": "邢台县",
                "code": "130521"
              },
              {
                "name": "临城县",
                "code": "130522"
              },
              {
                "name": "内丘县",
                "code": "130523"
              },
              {
                "name": "柏乡县",
                "code": "130524"
              },
              {
                "name": "隆尧县",
                "code": "130525"
              },
              {
                "name": "任　县",
                "code": "130526"
              },
              {
                "name": "南和县",
                "code": "130527"
              },
              {
                "name": "宁晋县",
                "code": "130528"
              },
              {
                "name": "巨鹿县",
                "code": "130529"
              },
              {
                "name": "新河县",
                "code": "130530"
              },
              {
                "name": "广宗县",
                "code": "130531"
              },
              {
                "name": "平乡县",
                "code": "130532"
              },
              {
                "name": "威　县",
                "code": "130533"
              },
              {
                "name": "清河县",
                "code": "130534"
              },
              {
                "name": "临西县",
                "code": "130535"
              },
              {
                "name": "南宫市",
                "code": "130581"
              },
              {
                "name": "沙河市",
                "code": "130582"
              }
            ]
          },
          {
            "name": "保定",
            "code": "6",
            "children": [
              {
                "name": "新市区",
                "code": "130602"
              },
              {
                "name": "北市区",
                "code": "130603"
              },
              {
                "name": "南市区",
                "code": "130604"
              },
              {
                "name": "满城县",
                "code": "130621"
              },
              {
                "name": "清苑县",
                "code": "130622"
              },
              {
                "name": "涞水县",
                "code": "130623"
              },
              {
                "name": "阜平县",
                "code": "130624"
              },
              {
                "name": "徐水县",
                "code": "130625"
              },
              {
                "name": "定兴县",
                "code": "130626"
              },
              {
                "name": "唐　县",
                "code": "130627"
              },
              {
                "name": "高阳县",
                "code": "130628"
              },
              {
                "name": "容城县",
                "code": "130629"
              },
              {
                "name": "涞源县",
                "code": "130630"
              },
              {
                "name": "望都县",
                "code": "130631"
              },
              {
                "name": "安新县",
                "code": "130632"
              },
              {
                "name": "易　县",
                "code": "130633"
              },
              {
                "name": "曲阳县",
                "code": "130634"
              },
              {
                "name": "蠡　县",
                "code": "130635"
              },
              {
                "name": "顺平县",
                "code": "130636"
              },
              {
                "name": "博野县",
                "code": "130637"
              },
              {
                "name": "雄　县",
                "code": "130638"
              },
              {
                "name": "涿州市",
                "code": "130681"
              },
              {
                "name": "定州市",
                "code": "130682"
              },
              {
                "name": "安国市",
                "code": "130683"
              },
              {
                "name": "高碑店市",
                "code": "130684"
              }
            ]
          },
          {
            "name": "张家口",
            "code": "7",
            "children": [
              {
                "name": "桥东区",
                "code": "130702"
              },
              {
                "name": "桥西区",
                "code": "130703"
              },
              {
                "name": "宣化区",
                "code": "130705"
              },
              {
                "name": "下花园区",
                "code": "130706"
              },
              {
                "name": "宣化县",
                "code": "130721"
              },
              {
                "name": "张北县",
                "code": "130722"
              },
              {
                "name": "康保县",
                "code": "130723"
              },
              {
                "name": "沽源县",
                "code": "130724"
              },
              {
                "name": "尚义县",
                "code": "130725"
              },
              {
                "name": "蔚　县",
                "code": "130726"
              },
              {
                "name": "阳原县",
                "code": "130727"
              },
              {
                "name": "怀安县",
                "code": "130728"
              },
              {
                "name": "万全县",
                "code": "130729"
              },
              {
                "name": "怀来县",
                "code": "130730"
              },
              {
                "name": "涿鹿县",
                "code": "130731"
              },
              {
                "name": "赤城县",
                "code": "130732"
              },
              {
                "name": "崇礼县",
                "code": "130733"
              }
            ]
          },
          {
            "name": "承德",
            "code": "8",
            "children": [
              {
                "name": "双桥区",
                "code": "130802"
              },
              {
                "name": "双滦区",
                "code": "130803"
              },
              {
                "name": "鹰手营子矿区",
                "code": "130804"
              },
              {
                "name": "承德县",
                "code": "130821"
              },
              {
                "name": "兴隆县",
                "code": "130822"
              },
              {
                "name": "平泉县",
                "code": "130823"
              },
              {
                "name": "滦平县",
                "code": "130824"
              },
              {
                "name": "隆化县",
                "code": "130825"
              },
              {
                "name": "丰宁满族自治县",
                "code": "130826"
              },
              {
                "name": "宽城满族自治县",
                "code": "130827"
              },
              {
                "name": "围场满族蒙古族自治县",
                "code": "130828"
              }
            ]
          },
          {
            "name": "沧州",
            "code": "9",
            "children": [
              {
                "name": "新华区",
                "code": "130902"
              },
              {
                "name": "运河区",
                "code": "130903"
              },
              {
                "name": "沧　县",
                "code": "130921"
              },
              {
                "name": "青　县",
                "code": "130922"
              },
              {
                "name": "东光县",
                "code": "130923"
              },
              {
                "name": "海兴县",
                "code": "130924"
              },
              {
                "name": "盐山县",
                "code": "130925"
              },
              {
                "name": "肃宁县",
                "code": "130926"
              },
              {
                "name": "南皮县",
                "code": "130927"
              },
              {
                "name": "吴桥县",
                "code": "130928"
              },
              {
                "name": "献　县",
                "code": "130929"
              },
              {
                "name": "孟村回族自治县",
                "code": "130930"
              },
              {
                "name": "泊头市",
                "code": "130981"
              },
              {
                "name": "任丘市",
                "code": "130982"
              },
              {
                "name": "黄骅市",
                "code": "130983"
              },
              {
                "name": "河间市",
                "code": "130984"
              }
            ]
          }
        ]
      },
      {
        "name": "山西",
        "code": "14",
        "children": [
          {
            "name": "太原",
            "code": "1",
            "children": [
              {
                "name": "小店区",
                "code": "140105"
              },
              {
                "name": "迎泽区",
                "code": "140106"
              },
              {
                "name": "杏花岭区",
                "code": "140107"
              },
              {
                "name": "尖草坪区",
                "code": "140108"
              },
              {
                "name": "万柏林区",
                "code": "140109"
              },
              {
                "name": "晋源区",
                "code": "140110"
              },
              {
                "name": "清徐县",
                "code": "140121"
              },
              {
                "name": "阳曲县",
                "code": "140122"
              },
              {
                "name": "娄烦县",
                "code": "140123"
              },
              {
                "name": "古交市",
                "code": "140181"
              }
            ]
          },
          {
            "name": "临汾",
            "code": "10",
            "children": [
              {
                "name": "尧都区",
                "code": "141002"
              },
              {
                "name": "曲沃县",
                "code": "141021"
              },
              {
                "name": "翼城县",
                "code": "141022"
              },
              {
                "name": "襄汾县",
                "code": "141023"
              },
              {
                "name": "洪洞县",
                "code": "141024"
              },
              {
                "name": "古　县",
                "code": "141025"
              },
              {
                "name": "安泽县",
                "code": "141026"
              },
              {
                "name": "浮山县",
                "code": "141027"
              },
              {
                "name": "吉　县",
                "code": "141028"
              },
              {
                "name": "乡宁县",
                "code": "141029"
              },
              {
                "name": "大宁县",
                "code": "141030"
              },
              {
                "name": "隰　县",
                "code": "141031"
              },
              {
                "name": "永和县",
                "code": "141032"
              },
              {
                "name": "蒲　县",
                "code": "141033"
              },
              {
                "name": "汾西县",
                "code": "141034"
              },
              {
                "name": "侯马市",
                "code": "141081"
              },
              {
                "name": "霍州市",
                "code": "141082"
              }
            ]
          },
          {
            "name": "吕梁",
            "code": "11",
            "children": [
              {
                "name": "离石区",
                "code": "141102"
              },
              {
                "name": "文水县",
                "code": "141121"
              },
              {
                "name": "交城县",
                "code": "141122"
              },
              {
                "name": "兴　县",
                "code": "141123"
              },
              {
                "name": "临　县",
                "code": "141124"
              },
              {
                "name": "柳林县",
                "code": "141125"
              },
              {
                "name": "石楼县",
                "code": "141126"
              },
              {
                "name": "岚　县",
                "code": "141127"
              },
              {
                "name": "方山县",
                "code": "141128"
              },
              {
                "name": "中阳县",
                "code": "141129"
              },
              {
                "name": "交口县",
                "code": "141130"
              },
              {
                "name": "孝义市",
                "code": "141181"
              },
              {
                "name": "汾阳市",
                "code": "141182"
              }
            ]
          },
          {
            "name": "大同",
            "code": "2",
            "children": [
              {
                "name": "城　区",
                "code": "140202"
              },
              {
                "name": "矿　区",
                "code": "140203"
              },
              {
                "name": "南郊区",
                "code": "140211"
              },
              {
                "name": "新荣区",
                "code": "140212"
              },
              {
                "name": "阳高县",
                "code": "140221"
              },
              {
                "name": "天镇县",
                "code": "140222"
              },
              {
                "name": "广灵县",
                "code": "140223"
              },
              {
                "name": "灵丘县",
                "code": "140224"
              },
              {
                "name": "浑源县",
                "code": "140225"
              },
              {
                "name": "左云县",
                "code": "140226"
              },
              {
                "name": "大同县",
                "code": "140227"
              }
            ]
          },
          {
            "name": "阳泉",
            "code": "3",
            "children": [
              {
                "name": "城　区",
                "code": "140302"
              },
              {
                "name": "矿　区",
                "code": "140303"
              },
              {
                "name": "郊　区",
                "code": "140311"
              },
              {
                "name": "平定县",
                "code": "140321"
              },
              {
                "name": "盂　县",
                "code": "140322"
              }
            ]
          },
          {
            "name": "长治",
            "code": "4",
            "children": [
              {
                "name": "城　区",
                "code": "140402"
              },
              {
                "name": "郊　区",
                "code": "140411"
              },
              {
                "name": "长治县",
                "code": "140421"
              },
              {
                "name": "襄垣县",
                "code": "140423"
              },
              {
                "name": "屯留县",
                "code": "140424"
              },
              {
                "name": "平顺县",
                "code": "140425"
              },
              {
                "name": "黎城县",
                "code": "140426"
              },
              {
                "name": "壶关县",
                "code": "140427"
              },
              {
                "name": "长子县",
                "code": "140428"
              },
              {
                "name": "武乡县",
                "code": "140429"
              },
              {
                "name": "沁　县",
                "code": "140430"
              },
              {
                "name": "沁源县",
                "code": "140431"
              },
              {
                "name": "潞城市",
                "code": "140481"
              }
            ]
          },
          {
            "name": "晋城",
            "code": "5",
            "children": [
              {
                "name": "城　区",
                "code": "140502"
              },
              {
                "name": "沁水县",
                "code": "140521"
              },
              {
                "name": "阳城县",
                "code": "140522"
              },
              {
                "name": "陵川县",
                "code": "140524"
              },
              {
                "name": "泽州县",
                "code": "140525"
              },
              {
                "name": "高平市",
                "code": "140581"
              }
            ]
          },
          {
            "name": "朔州",
            "code": "6",
            "children": [
              {
                "name": "朔城区",
                "code": "140602"
              },
              {
                "name": "平鲁区",
                "code": "140603"
              },
              {
                "name": "山阴县",
                "code": "140621"
              },
              {
                "name": "应　县",
                "code": "140622"
              },
              {
                "name": "右玉县",
                "code": "140623"
              },
              {
                "name": "怀仁县",
                "code": "140624"
              }
            ]
          },
          {
            "name": "晋中",
            "code": "7",
            "children": [
              {
                "name": "榆次区",
                "code": "140702"
              },
              {
                "name": "榆社县",
                "code": "140721"
              },
              {
                "name": "左权县",
                "code": "140722"
              },
              {
                "name": "和顺县",
                "code": "140723"
              },
              {
                "name": "昔阳县",
                "code": "140724"
              },
              {
                "name": "寿阳县",
                "code": "140725"
              },
              {
                "name": "太谷县",
                "code": "140726"
              },
              {
                "name": "祁　县",
                "code": "140727"
              },
              {
                "name": "平遥县",
                "code": "140728"
              },
              {
                "name": "灵石县",
                "code": "140729"
              },
              {
                "name": "介休市",
                "code": "140781"
              }
            ]
          },
          {
            "name": "运城",
            "code": "8",
            "children": [
              {
                "name": "盐湖区",
                "code": "140802"
              },
              {
                "name": "临猗县",
                "code": "140821"
              },
              {
                "name": "万荣县",
                "code": "140822"
              },
              {
                "name": "闻喜县",
                "code": "140823"
              },
              {
                "name": "稷山县",
                "code": "140824"
              },
              {
                "name": "新绛县",
                "code": "140825"
              },
              {
                "name": "绛　县",
                "code": "140826"
              },
              {
                "name": "垣曲县",
                "code": "140827"
              },
              {
                "name": "夏　县",
                "code": "140828"
              },
              {
                "name": "平陆县",
                "code": "140829"
              },
              {
                "name": "芮城县",
                "code": "140830"
              },
              {
                "name": "永济市",
                "code": "140881"
              },
              {
                "name": "河津市",
                "code": "140882"
              }
            ]
          },
          {
            "name": "忻州",
            "code": "9",
            "children": [
              {
                "name": "忻府区",
                "code": "140902"
              },
              {
                "name": "定襄县",
                "code": "140921"
              },
              {
                "name": "五台县",
                "code": "140922"
              },
              {
                "name": "代　县",
                "code": "140923"
              },
              {
                "name": "繁峙县",
                "code": "140924"
              },
              {
                "name": "宁武县",
                "code": "140925"
              },
              {
                "name": "静乐县",
                "code": "140926"
              },
              {
                "name": "神池县",
                "code": "140927"
              },
              {
                "name": "五寨县",
                "code": "140928"
              },
              {
                "name": "岢岚县",
                "code": "140929"
              },
              {
                "name": "河曲县",
                "code": "140930"
              },
              {
                "name": "保德县",
                "code": "140931"
              },
              {
                "name": "偏关县",
                "code": "140932"
              },
              {
                "name": "原平市",
                "code": "140981"
              }
            ]
          }
        ]
      },
      {
        "name": "内蒙古",
        "code": "15",
        "children": [
          {
            "name": "呼和浩特",
            "code": "1",
            "children": [
              {
                "name": "新城区",
                "code": "150102"
              },
              {
                "name": "回民区",
                "code": "150103"
              },
              {
                "name": "玉泉区",
                "code": "150104"
              },
              {
                "name": "赛罕区",
                "code": "150105"
              },
              {
                "name": "土默特左旗",
                "code": "150121"
              },
              {
                "name": "托克托县",
                "code": "150122"
              },
              {
                "name": "和林格尔县",
                "code": "150123"
              },
              {
                "name": "清水河县",
                "code": "150124"
              },
              {
                "name": "武川县",
                "code": "150125"
              }
            ]
          },
          {
            "name": "包头",
            "code": "2",
            "children": [
              {
                "name": "东河区",
                "code": "150202"
              },
              {
                "name": "昆都仑区",
                "code": "150203"
              },
              {
                "name": "青山区",
                "code": "150204"
              },
              {
                "name": "石拐区",
                "code": "150205"
              },
              {
                "name": "白云鄂博矿区",
                "code": "150206"
              },
              {
                "name": "九原区",
                "code": "150207"
              },
              {
                "name": "土默特右旗",
                "code": "150221"
              },
              {
                "name": "固阳县",
                "code": "150222"
              },
              {
                "name": "达尔罕茂明安联合旗",
                "code": "150223"
              }
            ]
          },
          {
            "name": "兴安",
            "code": "22",
            "children": [
              {
                "name": "乌兰浩特市",
                "code": "152201"
              },
              {
                "name": "阿尔山市",
                "code": "152202"
              },
              {
                "name": "科尔沁右翼前旗",
                "code": "152221"
              },
              {
                "name": "科尔沁右翼中旗",
                "code": "152222"
              },
              {
                "name": "扎赉特旗",
                "code": "152223"
              },
              {
                "name": "突泉县",
                "code": "152224"
              }
            ]
          },
          {
            "name": "锡林郭勒",
            "code": "25",
            "children": [
              {
                "name": "二连浩特市",
                "code": "152501"
              },
              {
                "name": "锡林浩特市",
                "code": "152502"
              },
              {
                "name": "阿巴嘎旗",
                "code": "152522"
              },
              {
                "name": "苏尼特左旗",
                "code": "152523"
              },
              {
                "name": "苏尼特右旗",
                "code": "152524"
              },
              {
                "name": "东乌珠穆沁旗",
                "code": "152525"
              },
              {
                "name": "西乌珠穆沁旗",
                "code": "152526"
              },
              {
                "name": "太仆寺旗",
                "code": "152527"
              },
              {
                "name": "镶黄旗",
                "code": "152528"
              },
              {
                "name": "正镶白旗",
                "code": "152529"
              },
              {
                "name": "正蓝旗",
                "code": "152530"
              },
              {
                "name": "多伦县",
                "code": "152531"
              }
            ]
          },
          {
            "name": "阿拉善",
            "code": "29",
            "children": [
              {
                "name": "阿拉善左旗",
                "code": "152921"
              },
              {
                "name": "阿拉善右旗",
                "code": "152922"
              },
              {
                "name": "额济纳旗",
                "code": "152923"
              }
            ]
          },
          {
            "name": "乌海",
            "code": "3",
            "children": [
              {
                "name": "海勃湾区",
                "code": "150302"
              },
              {
                "name": "海南区",
                "code": "150303"
              },
              {
                "name": "乌达区",
                "code": "150304"
              }
            ]
          },
          {
            "name": "赤峰",
            "code": "4",
            "children": [
              {
                "name": "红山区",
                "code": "150402"
              },
              {
                "name": "元宝山区",
                "code": "150403"
              },
              {
                "name": "松山区",
                "code": "150404"
              },
              {
                "name": "阿鲁科尔沁旗",
                "code": "150421"
              },
              {
                "name": "巴林左旗",
                "code": "150422"
              },
              {
                "name": "巴林右旗",
                "code": "150423"
              },
              {
                "name": "林西县",
                "code": "150424"
              },
              {
                "name": "克什克腾旗",
                "code": "150425"
              },
              {
                "name": "翁牛特旗",
                "code": "150426"
              },
              {
                "name": "喀喇沁旗",
                "code": "150428"
              },
              {
                "name": "宁城县",
                "code": "150429"
              },
              {
                "name": "敖汉旗",
                "code": "150430"
              }
            ]
          },
          {
            "name": "通辽",
            "code": "5",
            "children": [
              {
                "name": "科尔沁区",
                "code": "150502"
              },
              {
                "name": "科尔沁左翼中旗",
                "code": "150521"
              },
              {
                "name": "科尔沁左翼后旗",
                "code": "150522"
              },
              {
                "name": "开鲁县",
                "code": "150523"
              },
              {
                "name": "库伦旗",
                "code": "150524"
              },
              {
                "name": "奈曼旗",
                "code": "150525"
              },
              {
                "name": "扎鲁特旗",
                "code": "150526"
              },
              {
                "name": "霍林郭勒市",
                "code": "150581"
              }
            ]
          },
          {
            "name": "鄂尔多斯",
            "code": "6",
            "children": [
              {
                "name": "东胜区",
                "code": "150602"
              },
              {
                "name": "达拉特旗",
                "code": "150621"
              },
              {
                "name": "准格尔旗",
                "code": "150622"
              },
              {
                "name": "鄂托克前旗",
                "code": "150623"
              },
              {
                "name": "鄂托克旗",
                "code": "150624"
              },
              {
                "name": "杭锦旗",
                "code": "150625"
              },
              {
                "name": "乌审旗",
                "code": "150626"
              },
              {
                "name": "伊金霍洛旗",
                "code": "150627"
              }
            ]
          },
          {
            "name": "呼伦贝尔",
            "code": "7",
            "children": [
              {
                "name": "海拉尔区",
                "code": "150702"
              },
              {
                "name": "阿荣旗",
                "code": "150721"
              },
              {
                "name": "莫力达瓦达斡尔族自治旗",
                "code": "150722"
              },
              {
                "name": "鄂伦春自治旗",
                "code": "150723"
              },
              {
                "name": "鄂温克族自治旗",
                "code": "150724"
              },
              {
                "name": "陈巴尔虎旗",
                "code": "150725"
              },
              {
                "name": "新巴尔虎左旗",
                "code": "150726"
              },
              {
                "name": "新巴尔虎右旗",
                "code": "150727"
              },
              {
                "name": "满洲里市",
                "code": "150781"
              },
              {
                "name": "牙克石市",
                "code": "150782"
              },
              {
                "name": "扎兰屯市",
                "code": "150783"
              },
              {
                "name": "额尔古纳市",
                "code": "150784"
              },
              {
                "name": "根河市",
                "code": "150785"
              }
            ]
          },
          {
            "name": "巴彦淖尔",
            "code": "8",
            "children": [
              {
                "name": "临河区",
                "code": "150802"
              },
              {
                "name": "五原县",
                "code": "150821"
              },
              {
                "name": "磴口县",
                "code": "150822"
              },
              {
                "name": "乌拉特前旗",
                "code": "150823"
              },
              {
                "name": "乌拉特中旗",
                "code": "150824"
              },
              {
                "name": "乌拉特后旗",
                "code": "150825"
              },
              {
                "name": "杭锦后旗",
                "code": "150826"
              }
            ]
          },
          {
            "name": "乌兰察布",
            "code": "9",
            "children": [
              {
                "name": "集宁区",
                "code": "150902"
              },
              {
                "name": "卓资县",
                "code": "150921"
              },
              {
                "name": "化德县",
                "code": "150922"
              },
              {
                "name": "商都县",
                "code": "150923"
              },
              {
                "name": "兴和县",
                "code": "150924"
              },
              {
                "name": "凉城县",
                "code": "150925"
              },
              {
                "name": "察哈尔右翼前旗",
                "code": "150926"
              },
              {
                "name": "察哈尔右翼中旗",
                "code": "150927"
              },
              {
                "name": "察哈尔右翼后旗",
                "code": "150928"
              },
              {
                "name": "四子王旗",
                "code": "150929"
              },
              {
                "name": "丰镇市",
                "code": "150981"
              }
            ]
          }
        ]
      },
      {
        "name": "辽宁",
        "code": "21",
        "children": [
          {
            "name": "沈阳",
            "code": "1",
            "children": [
              {
                "name": "和平区",
                "code": "210102"
              },
              {
                "name": "沈河区",
                "code": "210103"
              },
              {
                "name": "大东区",
                "code": "210104"
              },
              {
                "name": "皇姑区",
                "code": "210105"
              },
              {
                "name": "铁西区",
                "code": "210106"
              },
              {
                "name": "苏家屯区",
                "code": "210111"
              },
              {
                "name": "东陵区",
                "code": "210112"
              },
              {
                "name": "沈北新区",
                "code": "210113"
              },
              {
                "name": "于洪区",
                "code": "210114"
              },
              {
                "name": "辽中县",
                "code": "210122"
              },
              {
                "name": "康平县",
                "code": "210123"
              },
              {
                "name": "法库县",
                "code": "210124"
              },
              {
                "name": "新民市",
                "code": "210181"
              }
            ]
          },
          {
            "name": "辽阳",
            "code": "10",
            "children": [
              {
                "name": "白塔区",
                "code": "211002"
              },
              {
                "name": "文圣区",
                "code": "211003"
              },
              {
                "name": "宏伟区",
                "code": "211004"
              },
              {
                "name": "弓长岭区",
                "code": "211005"
              },
              {
                "name": "太子河区",
                "code": "211011"
              },
              {
                "name": "辽阳县",
                "code": "211021"
              },
              {
                "name": "灯塔市",
                "code": "211081"
              }
            ]
          },
          {
            "name": "盘锦",
            "code": "11",
            "children": [
              {
                "name": "双台子区",
                "code": "211102"
              },
              {
                "name": "兴隆台区",
                "code": "211103"
              },
              {
                "name": "大洼县",
                "code": "211121"
              },
              {
                "name": "盘山县",
                "code": "211122"
              }
            ]
          },
          {
            "name": "铁岭",
            "code": "12",
            "children": [
              {
                "name": "银州区",
                "code": "211202"
              },
              {
                "name": "清河区",
                "code": "211204"
              },
              {
                "name": "铁岭县",
                "code": "211221"
              },
              {
                "name": "西丰县",
                "code": "211223"
              },
              {
                "name": "昌图县",
                "code": "211224"
              },
              {
                "name": "调兵山市",
                "code": "211281"
              },
              {
                "name": "开原市",
                "code": "211282"
              }
            ]
          },
          {
            "name": "朝阳",
            "code": "13",
            "children": [
              {
                "name": "双塔区",
                "code": "211302"
              },
              {
                "name": "龙城区",
                "code": "211303"
              },
              {
                "name": "朝阳县",
                "code": "211321"
              },
              {
                "name": "建平县",
                "code": "211322"
              },
              {
                "name": "喀喇沁左翼蒙古族自治县",
                "code": "211324"
              },
              {
                "name": "北票市",
                "code": "211381"
              },
              {
                "name": "凌源市",
                "code": "211382"
              }
            ]
          },
          {
            "name": "葫芦岛",
            "code": "14",
            "children": [
              {
                "name": "连山区",
                "code": "211402"
              },
              {
                "name": "龙港区",
                "code": "211403"
              },
              {
                "name": "南票区",
                "code": "211404"
              },
              {
                "name": "绥中县",
                "code": "211421"
              },
              {
                "name": "建昌县",
                "code": "211422"
              },
              {
                "name": "兴城市",
                "code": "211481"
              }
            ]
          },
          {
            "name": "大连",
            "code": "2",
            "children": [
              {
                "name": "中山区",
                "code": "210202"
              },
              {
                "name": "西岗区",
                "code": "210203"
              },
              {
                "name": "沙河口区",
                "code": "210204"
              },
              {
                "name": "甘井子区",
                "code": "210211"
              },
              {
                "name": "旅顺口区",
                "code": "210212"
              },
              {
                "name": "金州区",
                "code": "210213"
              },
              {
                "name": "长海县",
                "code": "210224"
              },
              {
                "name": "瓦房店市",
                "code": "210281"
              },
              {
                "name": "普兰店市",
                "code": "210282"
              },
              {
                "name": "庄河市",
                "code": "210283"
              }
            ]
          },
          {
            "name": "鞍山",
            "code": "3",
            "children": [
              {
                "name": "铁东区",
                "code": "210302"
              },
              {
                "name": "铁西区",
                "code": "210303"
              },
              {
                "name": "立山区",
                "code": "210304"
              },
              {
                "name": "千山区",
                "code": "210311"
              },
              {
                "name": "台安县",
                "code": "210321"
              },
              {
                "name": "岫岩满族自治县",
                "code": "210323"
              },
              {
                "name": "海城市",
                "code": "210381"
              }
            ]
          },
          {
            "name": "抚顺",
            "code": "4",
            "children": [
              {
                "name": "新抚区",
                "code": "210402"
              },
              {
                "name": "东洲区",
                "code": "210403"
              },
              {
                "name": "望花区",
                "code": "210404"
              },
              {
                "name": "顺城区",
                "code": "210411"
              },
              {
                "name": "抚顺县",
                "code": "210421"
              },
              {
                "name": "新宾满族自治县",
                "code": "210422"
              },
              {
                "name": "清原满族自治县",
                "code": "210423"
              }
            ]
          },
          {
            "name": "本溪",
            "code": "5",
            "children": [
              {
                "name": "平山区",
                "code": "210502"
              },
              {
                "name": "溪湖区",
                "code": "210503"
              },
              {
                "name": "明山区",
                "code": "210504"
              },
              {
                "name": "南芬区",
                "code": "210505"
              },
              {
                "name": "本溪满族自治县",
                "code": "210521"
              },
              {
                "name": "桓仁满族自治县",
                "code": "210522"
              }
            ]
          },
          {
            "name": "丹东",
            "code": "6",
            "children": [
              {
                "name": "元宝区",
                "code": "210602"
              },
              {
                "name": "振兴区",
                "code": "210603"
              },
              {
                "name": "振安区",
                "code": "210604"
              },
              {
                "name": "宽甸满族自治县",
                "code": "210624"
              },
              {
                "name": "东港市",
                "code": "210681"
              },
              {
                "name": "凤城市",
                "code": "210682"
              }
            ]
          },
          {
            "name": "锦州",
            "code": "7",
            "children": [
              {
                "name": "古塔区",
                "code": "210702"
              },
              {
                "name": "凌河区",
                "code": "210703"
              },
              {
                "name": "太和区",
                "code": "210711"
              },
              {
                "name": "黑山县",
                "code": "210726"
              },
              {
                "name": "义　县",
                "code": "210727"
              },
              {
                "name": "凌海市",
                "code": "210781"
              },
              {
                "name": "北镇市",
                "code": "210782"
              }
            ]
          },
          {
            "name": "营口",
            "code": "8",
            "children": [
              {
                "name": "站前区",
                "code": "210802"
              },
              {
                "name": "西市区",
                "code": "210803"
              },
              {
                "name": "鲅鱼圈区",
                "code": "210804"
              },
              {
                "name": "老边区",
                "code": "210811"
              },
              {
                "name": "盖州市",
                "code": "210881"
              },
              {
                "name": "大石桥市",
                "code": "210882"
              }
            ]
          },
          {
            "name": "阜新",
            "code": "9",
            "children": [
              {
                "name": "海州区",
                "code": "210902"
              },
              {
                "name": "新邱区",
                "code": "210903"
              },
              {
                "name": "太平区",
                "code": "210904"
              },
              {
                "name": "清河门区",
                "code": "210905"
              },
              {
                "name": "细河区",
                "code": "210911"
              },
              {
                "name": "阜新蒙古族自治县",
                "code": "210921"
              },
              {
                "name": "彰武县",
                "code": "210922"
              }
            ]
          }
        ]
      },
      {
        "name": "吉林",
        "code": "22",
        "children": [
          {
            "name": "长春",
            "code": "1",
            "children": [
              {
                "name": "南关区",
                "code": "220102"
              },
              {
                "name": "宽城区",
                "code": "220103"
              },
              {
                "name": "朝阳区",
                "code": "220104"
              },
              {
                "name": "二道区",
                "code": "220105"
              },
              {
                "name": "绿园区",
                "code": "220106"
              },
              {
                "name": "双阳区",
                "code": "220112"
              },
              {
                "name": "农安县",
                "code": "220122"
              },
              {
                "name": "九台市",
                "code": "220181"
              },
              {
                "name": "榆树市",
                "code": "220182"
              },
              {
                "name": "德惠市",
                "code": "220183"
              }
            ]
          },
          {
            "name": "吉林",
            "code": "2",
            "children": [
              {
                "name": "昌邑区",
                "code": "220202"
              },
              {
                "name": "龙潭区",
                "code": "220203"
              },
              {
                "name": "船营区",
                "code": "220204"
              },
              {
                "name": "丰满区",
                "code": "220211"
              },
              {
                "name": "永吉县",
                "code": "220221"
              },
              {
                "name": "蛟河市",
                "code": "220281"
              },
              {
                "name": "桦甸市",
                "code": "220282"
              },
              {
                "name": "舒兰市",
                "code": "220283"
              },
              {
                "name": "磐石市",
                "code": "220284"
              }
            ]
          },
          {
            "name": "延边",
            "code": "24",
            "children": [
              {
                "name": "延吉市",
                "code": "222401"
              },
              {
                "name": "图们市",
                "code": "222402"
              },
              {
                "name": "敦化市",
                "code": "222403"
              },
              {
                "name": "珲春市",
                "code": "222404"
              },
              {
                "name": "龙井市",
                "code": "222405"
              },
              {
                "name": "和龙市",
                "code": "222406"
              },
              {
                "name": "汪清县",
                "code": "222424"
              },
              {
                "name": "安图县",
                "code": "222426"
              }
            ]
          },
          {
            "name": "四平",
            "code": "3",
            "children": [
              {
                "name": "铁西区",
                "code": "220302"
              },
              {
                "name": "铁东区",
                "code": "220303"
              },
              {
                "name": "梨树县",
                "code": "220322"
              },
              {
                "name": "伊通满族自治县",
                "code": "220323"
              },
              {
                "name": "公主岭市",
                "code": "220381"
              },
              {
                "name": "双辽市",
                "code": "220382"
              }
            ]
          },
          {
            "name": "辽源",
            "code": "4",
            "children": [
              {
                "name": "龙山区",
                "code": "220402"
              },
              {
                "name": "西安区",
                "code": "220403"
              },
              {
                "name": "东丰县",
                "code": "220421"
              },
              {
                "name": "东辽县",
                "code": "220422"
              }
            ]
          },
          {
            "name": "通化",
            "code": "5",
            "children": [
              {
                "name": "东昌区",
                "code": "220502"
              },
              {
                "name": "二道江区",
                "code": "220503"
              },
              {
                "name": "通化县",
                "code": "220521"
              },
              {
                "name": "辉南县",
                "code": "220523"
              },
              {
                "name": "柳河县",
                "code": "220524"
              },
              {
                "name": "梅河口市",
                "code": "220581"
              },
              {
                "name": "集安市",
                "code": "220582"
              }
            ]
          },
          {
            "name": "白山",
            "code": "6",
            "children": [
              {
                "name": "八道江区",
                "code": "220602"
              },
              {
                "name": "江源区",
                "code": "220605"
              },
              {
                "name": "抚松县",
                "code": "220621"
              },
              {
                "name": "靖宇县",
                "code": "220622"
              },
              {
                "name": "长白朝鲜族自治县",
                "code": "220623"
              },
              {
                "name": "临江市",
                "code": "220681"
              }
            ]
          },
          {
            "name": "松原",
            "code": "7",
            "children": [
              {
                "name": "宁江区",
                "code": "220702"
              },
              {
                "name": "前郭尔罗斯蒙古族自治县",
                "code": "220721"
              },
              {
                "name": "长岭县",
                "code": "220722"
              },
              {
                "name": "乾安县",
                "code": "220723"
              },
              {
                "name": "扶余县",
                "code": "220724"
              }
            ]
          },
          {
            "name": "白城",
            "code": "8",
            "children": [
              {
                "name": "洮北区",
                "code": "220802"
              },
              {
                "name": "镇赉县",
                "code": "220821"
              },
              {
                "name": "通榆县",
                "code": "220822"
              },
              {
                "name": "洮南市",
                "code": "220881"
              },
              {
                "name": "大安市",
                "code": "220882"
              }
            ]
          }
        ]
      },
      {
        "name": "黑龙江",
        "code": "23",
        "children": [
          {
            "name": "哈尔滨",
            "code": "1",
            "children": [
              {
                "name": "道里区",
                "code": "230102"
              },
              {
                "name": "南岗区",
                "code": "230103"
              },
              {
                "name": "道外区",
                "code": "230104"
              },
              {
                "name": "平房区",
                "code": "230108"
              },
              {
                "name": "松北区",
                "code": "230109"
              },
              {
                "name": "香坊区",
                "code": "230110"
              },
              {
                "name": "呼兰区",
                "code": "230111"
              },
              {
                "name": "阿城区",
                "code": "230112"
              },
              {
                "name": "依兰县",
                "code": "230123"
              },
              {
                "name": "方正县",
                "code": "230124"
              },
              {
                "name": "宾　县",
                "code": "230125"
              },
              {
                "name": "巴彦县",
                "code": "230126"
              },
              {
                "name": "木兰县",
                "code": "230127"
              },
              {
                "name": "通河县",
                "code": "230128"
              },
              {
                "name": "延寿县",
                "code": "230129"
              },
              {
                "name": "双城市",
                "code": "230182"
              },
              {
                "name": "尚志市",
                "code": "230183"
              },
              {
                "name": "五常市",
                "code": "230184"
              }
            ]
          },
          {
            "name": "牡丹江",
            "code": "10",
            "children": [
              {
                "name": "东安区",
                "code": "231002"
              },
              {
                "name": "阳明区",
                "code": "231003"
              },
              {
                "name": "爱民区",
                "code": "231004"
              },
              {
                "name": "西安区",
                "code": "231005"
              },
              {
                "name": "东宁县",
                "code": "231024"
              },
              {
                "name": "林口县",
                "code": "231025"
              },
              {
                "name": "绥芬河市",
                "code": "231081"
              },
              {
                "name": "海林市",
                "code": "231083"
              },
              {
                "name": "宁安市",
                "code": "231084"
              },
              {
                "name": "穆棱市",
                "code": "231085"
              }
            ]
          },
          {
            "name": "黑河",
            "code": "11",
            "children": [
              {
                "name": "爱辉区",
                "code": "231102"
              },
              {
                "name": "嫩江县",
                "code": "231121"
              },
              {
                "name": "逊克县",
                "code": "231123"
              },
              {
                "name": "孙吴县",
                "code": "231124"
              },
              {
                "name": "北安市",
                "code": "231181"
              },
              {
                "name": "五大连池市",
                "code": "231182"
              }
            ]
          },
          {
            "name": "绥化",
            "code": "12",
            "children": [
              {
                "name": "北林区",
                "code": "231202"
              },
              {
                "name": "望奎县",
                "code": "231221"
              },
              {
                "name": "兰西县",
                "code": "231222"
              },
              {
                "name": "青冈县",
                "code": "231223"
              },
              {
                "name": "庆安县",
                "code": "231224"
              },
              {
                "name": "明水县",
                "code": "231225"
              },
              {
                "name": "绥棱县",
                "code": "231226"
              },
              {
                "name": "安达市",
                "code": "231281"
              },
              {
                "name": "肇东市",
                "code": "231282"
              },
              {
                "name": "海伦市",
                "code": "231283"
              }
            ]
          },
          {
            "name": "齐齐哈尔",
            "code": "2",
            "children": [
              {
                "name": "龙沙区",
                "code": "230202"
              },
              {
                "name": "建华区",
                "code": "230203"
              },
              {
                "name": "铁锋区",
                "code": "230204"
              },
              {
                "name": "昂昂溪区",
                "code": "230205"
              },
              {
                "name": "富拉尔基区",
                "code": "230206"
              },
              {
                "name": "碾子山区",
                "code": "230207"
              },
              {
                "name": "梅里斯达斡尔族区",
                "code": "230208"
              },
              {
                "name": "龙江县",
                "code": "230221"
              },
              {
                "name": "依安县",
                "code": "230223"
              },
              {
                "name": "泰来县",
                "code": "230224"
              },
              {
                "name": "甘南县",
                "code": "230225"
              },
              {
                "name": "富裕县",
                "code": "230227"
              },
              {
                "name": "克山县",
                "code": "230229"
              },
              {
                "name": "克东县",
                "code": "230230"
              },
              {
                "name": "拜泉县",
                "code": "230231"
              },
              {
                "name": "讷河市",
                "code": "230281"
              }
            ]
          },
          {
            "name": "大兴安岭",
            "code": "27",
            "children": [
              {
                "name": "呼玛县",
                "code": "232721"
              },
              {
                "name": "塔河县",
                "code": "232722"
              },
              {
                "name": "漠河县",
                "code": "232723"
              }
            ]
          },
          {
            "name": "鸡西",
            "code": "3",
            "children": [
              {
                "name": "鸡冠区",
                "code": "230302"
              },
              {
                "name": "恒山区",
                "code": "230303"
              },
              {
                "name": "滴道区",
                "code": "230304"
              },
              {
                "name": "梨树区",
                "code": "230305"
              },
              {
                "name": "城子河区",
                "code": "230306"
              },
              {
                "name": "麻山区",
                "code": "230307"
              },
              {
                "name": "鸡东县",
                "code": "230321"
              },
              {
                "name": "虎林市",
                "code": "230381"
              },
              {
                "name": "密山市",
                "code": "230382"
              }
            ]
          },
          {
            "name": "鹤岗",
            "code": "4",
            "children": [
              {
                "name": "向阳区",
                "code": "230402"
              },
              {
                "name": "工农区",
                "code": "230403"
              },
              {
                "name": "南山区",
                "code": "230404"
              },
              {
                "name": "兴安区",
                "code": "230405"
              },
              {
                "name": "东山区",
                "code": "230406"
              },
              {
                "name": "兴山区",
                "code": "230407"
              },
              {
                "name": "萝北县",
                "code": "230421"
              },
              {
                "name": "绥滨县",
                "code": "230422"
              }
            ]
          },
          {
            "name": "双鸭山",
            "code": "5",
            "children": [
              {
                "name": "尖山区",
                "code": "230502"
              },
              {
                "name": "岭东区",
                "code": "230503"
              },
              {
                "name": "四方台区",
                "code": "230505"
              },
              {
                "name": "宝山区",
                "code": "230506"
              },
              {
                "name": "集贤县",
                "code": "230521"
              },
              {
                "name": "友谊县",
                "code": "230522"
              },
              {
                "name": "宝清县",
                "code": "230523"
              },
              {
                "name": "饶河县",
                "code": "230524"
              }
            ]
          },
          {
            "name": "大庆",
            "code": "6",
            "children": [
              {
                "name": "萨尔图区",
                "code": "230602"
              },
              {
                "name": "龙凤区",
                "code": "230603"
              },
              {
                "name": "让胡路区",
                "code": "230604"
              },
              {
                "name": "红岗区",
                "code": "230605"
              },
              {
                "name": "大同区",
                "code": "230606"
              },
              {
                "name": "肇州县",
                "code": "230621"
              },
              {
                "name": "肇源县",
                "code": "230622"
              },
              {
                "name": "林甸县",
                "code": "230623"
              },
              {
                "name": "杜尔伯特蒙古族自治县",
                "code": "230624"
              }
            ]
          },
          {
            "name": "伊春",
            "code": "7",
            "children": [
              {
                "name": "伊春区",
                "code": "230702"
              },
              {
                "name": "南岔区",
                "code": "230703"
              },
              {
                "name": "友好区",
                "code": "230704"
              },
              {
                "name": "西林区",
                "code": "230705"
              },
              {
                "name": "翠峦区",
                "code": "230706"
              },
              {
                "name": "新青区",
                "code": "230707"
              },
              {
                "name": "美溪区",
                "code": "230708"
              },
              {
                "name": "金山屯区",
                "code": "230709"
              },
              {
                "name": "五营区",
                "code": "230710"
              },
              {
                "name": "乌马河区",
                "code": "230711"
              },
              {
                "name": "汤旺河区",
                "code": "230712"
              },
              {
                "name": "带岭区",
                "code": "230713"
              },
              {
                "name": "乌伊岭区",
                "code": "230714"
              },
              {
                "name": "红星区",
                "code": "230715"
              },
              {
                "name": "上甘岭区",
                "code": "230716"
              },
              {
                "name": "嘉荫县",
                "code": "230722"
              },
              {
                "name": "铁力市",
                "code": "230781"
              }
            ]
          },
          {
            "name": "佳木斯",
            "code": "8",
            "children": [
              {
                "name": "向阳区",
                "code": "230803"
              },
              {
                "name": "前进区",
                "code": "230804"
              },
              {
                "name": "东风区",
                "code": "230805"
              },
              {
                "name": "郊　区",
                "code": "230811"
              },
              {
                "name": "桦南县",
                "code": "230822"
              },
              {
                "name": "桦川县",
                "code": "230826"
              },
              {
                "name": "汤原县",
                "code": "230828"
              },
              {
                "name": "抚远县",
                "code": "230833"
              },
              {
                "name": "同江市",
                "code": "230881"
              },
              {
                "name": "富锦市",
                "code": "230882"
              }
            ]
          },
          {
            "name": "七台河",
            "code": "9",
            "children": [
              {
                "name": "新兴区",
                "code": "230902"
              },
              {
                "name": "桃山区",
                "code": "230903"
              },
              {
                "name": "茄子河区",
                "code": "230904"
              },
              {
                "name": "勃利县",
                "code": "230921"
              }
            ]
          }
        ]
      },
      {
        "name": "上海",
        "code": "31",
        "children": [
          {
            "name": "黄浦",
            "code": "1"
          },
          {
            "name": "杨浦",
            "code": "11"
          },
          {
            "name": "闵行",
            "code": "12"
          },
          {
            "name": "宝山",
            "code": "13"
          },
          {
            "name": "嘉定",
            "code": "14"
          },
          {
            "name": "浦东新",
            "code": "15"
          },
          {
            "name": "金山",
            "code": "16"
          },
          {
            "name": "松江",
            "code": "17"
          },
          {
            "name": "奉贤",
            "code": "26"
          },
          {
            "name": "青浦",
            "code": "29"
          },
          {
            "name": "卢湾",
            "code": "3"
          },
          {
            "name": "崇明",
            "code": "30"
          },
          {
            "name": "徐汇",
            "code": "4"
          },
          {
            "name": "长宁",
            "code": "5"
          },
          {
            "name": "静安",
            "code": "6"
          },
          {
            "name": "普陀",
            "code": "7"
          },
          {
            "name": "闸北",
            "code": "8"
          },
          {
            "name": "虹口",
            "code": "9"
          }
        ]
      },
      {
        "name": "江苏",
        "code": "32",
        "children": [
          {
            "name": "南京",
            "code": "1",
            "children": [
              {
                "name": "玄武区",
                "code": "320102"
              },
              {
                "name": "白下区",
                "code": "320103"
              },
              {
                "name": "秦淮区",
                "code": "320104"
              },
              {
                "name": "建邺区",
                "code": "320105"
              },
              {
                "name": "鼓楼区",
                "code": "320106"
              },
              {
                "name": "下关区",
                "code": "320107"
              },
              {
                "name": "浦口区",
                "code": "320111"
              },
              {
                "name": "栖霞区",
                "code": "320113"
              },
              {
                "name": "雨花台区",
                "code": "320114"
              },
              {
                "name": "江宁区",
                "code": "320115"
              },
              {
                "name": "六合区",
                "code": "320116"
              },
              {
                "name": "溧水县",
                "code": "320124"
              },
              {
                "name": "高淳县",
                "code": "320125"
              }
            ]
          },
          {
            "name": "扬州",
            "code": "10",
            "children": [
              {
                "name": "广陵区",
                "code": "321002"
              },
              {
                "name": "邗江区",
                "code": "321003"
              },
              {
                "name": "维扬区",
                "code": "321011"
              },
              {
                "name": "宝应县",
                "code": "321023"
              },
              {
                "name": "仪征市",
                "code": "321081"
              },
              {
                "name": "高邮市",
                "code": "321084"
              },
              {
                "name": "江都市",
                "code": "321088"
              }
            ]
          },
          {
            "name": "镇江",
            "code": "11",
            "children": [
              {
                "name": "京口区",
                "code": "321102"
              },
              {
                "name": "润州区",
                "code": "321111"
              },
              {
                "name": "丹徒区",
                "code": "321112"
              },
              {
                "name": "丹阳市",
                "code": "321181"
              },
              {
                "name": "扬中市",
                "code": "321182"
              },
              {
                "name": "句容市",
                "code": "321183"
              }
            ]
          },
          {
            "name": "泰州",
            "code": "12",
            "children": [
              {
                "name": "海陵区",
                "code": "321202"
              },
              {
                "name": "高港区",
                "code": "321203"
              },
              {
                "name": "兴化市",
                "code": "321281"
              },
              {
                "name": "靖江市",
                "code": "321282"
              },
              {
                "name": "泰兴市",
                "code": "321283"
              },
              {
                "name": "姜堰市",
                "code": "321284"
              }
            ]
          },
          {
            "name": "宿迁",
            "code": "13",
            "children": [
              {
                "name": "宿城区",
                "code": "321302"
              },
              {
                "name": "宿豫区",
                "code": "321311"
              },
              {
                "name": "沭阳县",
                "code": "321322"
              },
              {
                "name": "泗阳县",
                "code": "321323"
              },
              {
                "name": "泗洪县",
                "code": "321324"
              }
            ]
          },
          {
            "name": "无锡",
            "code": "2",
            "children": [
              {
                "name": "崇安区",
                "code": "320202"
              },
              {
                "name": "南长区",
                "code": "320203"
              },
              {
                "name": "北塘区",
                "code": "320204"
              },
              {
                "name": "锡山区",
                "code": "320205"
              },
              {
                "name": "惠山区",
                "code": "320206"
              },
              {
                "name": "滨湖区",
                "code": "320211"
              },
              {
                "name": "江阴市",
                "code": "320281"
              },
              {
                "name": "宜兴市",
                "code": "320282"
              }
            ]
          },
          {
            "name": "徐州",
            "code": "3",
            "children": [
              {
                "name": "鼓楼区",
                "code": "320302"
              },
              {
                "name": "云龙区",
                "code": "320303"
              },
              {
                "name": "九里区",
                "code": "320304"
              },
              {
                "name": "贾汪区",
                "code": "320305"
              },
              {
                "name": "泉山区",
                "code": "320311"
              },
              {
                "name": "丰　县",
                "code": "320321"
              },
              {
                "name": "沛　县",
                "code": "320322"
              },
              {
                "name": "铜山县",
                "code": "320323"
              },
              {
                "name": "睢宁县",
                "code": "320324"
              },
              {
                "name": "新沂市",
                "code": "320381"
              },
              {
                "name": "邳州市",
                "code": "320382"
              }
            ]
          },
          {
            "name": "常州",
            "code": "4",
            "children": [
              {
                "name": "天宁区",
                "code": "320402"
              },
              {
                "name": "钟楼区",
                "code": "320404"
              },
              {
                "name": "戚墅堰区",
                "code": "320405"
              },
              {
                "name": "新北区",
                "code": "320411"
              },
              {
                "name": "武进区",
                "code": "320412"
              },
              {
                "name": "溧阳市",
                "code": "320481"
              },
              {
                "name": "金坛市",
                "code": "320482"
              }
            ]
          },
          {
            "name": "苏州",
            "code": "5",
            "children": [
              {
                "name": "沧浪区",
                "code": "320502"
              },
              {
                "name": "平江区",
                "code": "320503"
              },
              {
                "name": "金阊区",
                "code": "320504"
              },
              {
                "name": "虎丘区",
                "code": "320505"
              },
              {
                "name": "吴中区",
                "code": "320506"
              },
              {
                "name": "相城区",
                "code": "320507"
              },
              {
                "name": "常熟市",
                "code": "320581"
              },
              {
                "name": "张家港市",
                "code": "320582"
              },
              {
                "name": "昆山市",
                "code": "320583"
              },
              {
                "name": "吴江市",
                "code": "320584"
              },
              {
                "name": "太仓市",
                "code": "320585"
              }
            ]
          },
          {
            "name": "南通",
            "code": "6",
            "children": [
              {
                "name": "崇川区",
                "code": "320602"
              },
              {
                "name": "港闸区",
                "code": "320611"
              },
              {
                "name": "海安县",
                "code": "320621"
              },
              {
                "name": "如东县",
                "code": "320623"
              },
              {
                "name": "启东市",
                "code": "320681"
              },
              {
                "name": "如皋市",
                "code": "320682"
              },
              {
                "name": "通州市",
                "code": "320683"
              },
              {
                "name": "海门市",
                "code": "320684"
              }
            ]
          },
          {
            "name": "连云港",
            "code": "7",
            "children": [
              {
                "name": "连云区",
                "code": "320703"
              },
              {
                "name": "新浦区",
                "code": "320705"
              },
              {
                "name": "海州区",
                "code": "320706"
              },
              {
                "name": "赣榆县",
                "code": "320721"
              },
              {
                "name": "东海县",
                "code": "320722"
              },
              {
                "name": "灌云县",
                "code": "320723"
              },
              {
                "name": "灌南县",
                "code": "320724"
              }
            ]
          },
          {
            "name": "淮安",
            "code": "8",
            "children": [
              {
                "name": "清河区",
                "code": "320802"
              },
              {
                "name": "楚州区",
                "code": "320803"
              },
              {
                "name": "淮阴区",
                "code": "320804"
              },
              {
                "name": "清浦区",
                "code": "320811"
              },
              {
                "name": "涟水县",
                "code": "320826"
              },
              {
                "name": "洪泽县",
                "code": "320829"
              },
              {
                "name": "盱眙县",
                "code": "320830"
              },
              {
                "name": "金湖县",
                "code": "320831"
              }
            ]
          },
          {
            "name": "盐城",
            "code": "9",
            "children": [
              {
                "name": "亭湖区",
                "code": "320902"
              },
              {
                "name": "盐都区",
                "code": "320903"
              },
              {
                "name": "响水县",
                "code": "320921"
              },
              {
                "name": "滨海县",
                "code": "320922"
              },
              {
                "name": "阜宁县",
                "code": "320923"
              },
              {
                "name": "射阳县",
                "code": "320924"
              },
              {
                "name": "建湖县",
                "code": "320925"
              },
              {
                "name": "东台市",
                "code": "320981"
              },
              {
                "name": "大丰市",
                "code": "320982"
              }
            ]
          }
        ]
      },
      {
        "name": "浙江",
        "code": "33",
        "children": [
          {
            "name": "杭州",
            "code": "1",
            "children": [
              {
                "name": "上城区",
                "code": "330102"
              },
              {
                "name": "下城区",
                "code": "330103"
              },
              {
                "name": "江干区",
                "code": "330104"
              },
              {
                "name": "拱墅区",
                "code": "330105"
              },
              {
                "name": "西湖区",
                "code": "330106"
              },
              {
                "name": "滨江区",
                "code": "330108"
              },
              {
                "name": "萧山区",
                "code": "330109"
              },
              {
                "name": "余杭区",
                "code": "330110"
              },
              {
                "name": "桐庐县",
                "code": "330122"
              },
              {
                "name": "淳安县",
                "code": "330127"
              },
              {
                "name": "建德市",
                "code": "330182"
              },
              {
                "name": "富阳市",
                "code": "330183"
              },
              {
                "name": "临安市",
                "code": "330185"
              }
            ]
          },
          {
            "name": "台州",
            "code": "10",
            "children": [
              {
                "name": "椒江区",
                "code": "331002"
              },
              {
                "name": "黄岩区",
                "code": "331003"
              },
              {
                "name": "路桥区",
                "code": "331004"
              },
              {
                "name": "玉环县",
                "code": "331021"
              },
              {
                "name": "三门县",
                "code": "331022"
              },
              {
                "name": "天台县",
                "code": "331023"
              },
              {
                "name": "仙居县",
                "code": "331024"
              },
              {
                "name": "温岭市",
                "code": "331081"
              },
              {
                "name": "临海市",
                "code": "331082"
              }
            ]
          },
          {
            "name": "丽水",
            "code": "11",
            "children": [
              {
                "name": "莲都区",
                "code": "331102"
              },
              {
                "name": "青田县",
                "code": "331121"
              },
              {
                "name": "缙云县",
                "code": "331122"
              },
              {
                "name": "遂昌县",
                "code": "331123"
              },
              {
                "name": "松阳县",
                "code": "331124"
              },
              {
                "name": "云和县",
                "code": "331125"
              },
              {
                "name": "庆元县",
                "code": "331126"
              },
              {
                "name": "景宁畲族自治县",
                "code": "331127"
              },
              {
                "name": "龙泉市",
                "code": "331181"
              }
            ]
          },
          {
            "name": "宁波",
            "code": "2",
            "children": [
              {
                "name": "海曙区",
                "code": "330203"
              },
              {
                "name": "江东区",
                "code": "330204"
              },
              {
                "name": "江北区",
                "code": "330205"
              },
              {
                "name": "北仑区",
                "code": "330206"
              },
              {
                "name": "镇海区",
                "code": "330211"
              },
              {
                "name": "鄞州区",
                "code": "330212"
              },
              {
                "name": "象山县",
                "code": "330225"
              },
              {
                "name": "宁海县",
                "code": "330226"
              },
              {
                "name": "余姚市",
                "code": "330281"
              },
              {
                "name": "慈溪市",
                "code": "330282"
              },
              {
                "name": "奉化市",
                "code": "330283"
              }
            ]
          },
          {
            "name": "温州",
            "code": "3",
            "children": [
              {
                "name": "鹿城区",
                "code": "330302"
              },
              {
                "name": "龙湾区",
                "code": "330303"
              },
              {
                "name": "瓯海区",
                "code": "330304"
              },
              {
                "name": "洞头县",
                "code": "330322"
              },
              {
                "name": "永嘉县",
                "code": "330324"
              },
              {
                "name": "平阳县",
                "code": "330326"
              },
              {
                "name": "苍南县",
                "code": "330327"
              },
              {
                "name": "文成县",
                "code": "330328"
              },
              {
                "name": "泰顺县",
                "code": "330329"
              },
              {
                "name": "瑞安市",
                "code": "330381"
              },
              {
                "name": "乐清市",
                "code": "330382"
              }
            ]
          },
          {
            "name": "嘉兴",
            "code": "4",
            "children": [
              {
                "name": "南湖区",
                "code": "330402"
              },
              {
                "name": "秀洲区",
                "code": "330411"
              },
              {
                "name": "嘉善县",
                "code": "330421"
              },
              {
                "name": "海盐县",
                "code": "330424"
              },
              {
                "name": "海宁市",
                "code": "330481"
              },
              {
                "name": "平湖市",
                "code": "330482"
              },
              {
                "name": "桐乡市",
                "code": "330483"
              }
            ]
          },
          {
            "name": "湖州",
            "code": "5",
            "children": [
              {
                "name": "吴兴区",
                "code": "330502"
              },
              {
                "name": "南浔区",
                "code": "330503"
              },
              {
                "name": "德清县",
                "code": "330521"
              },
              {
                "name": "长兴县",
                "code": "330522"
              },
              {
                "name": "安吉县",
                "code": "330523"
              }
            ]
          },
          {
            "name": "绍兴",
            "code": "6",
            "children": [
              {
                "name": "越城区",
                "code": "330602"
              },
              {
                "name": "绍兴县",
                "code": "330621"
              },
              {
                "name": "新昌县",
                "code": "330624"
              },
              {
                "name": "诸暨市",
                "code": "330681"
              },
              {
                "name": "上虞市",
                "code": "330682"
              },
              {
                "name": "嵊州市",
                "code": "330683"
              }
            ]
          },
          {
            "name": "金华",
            "code": "7",
            "children": [
              {
                "name": "婺城区",
                "code": "330702"
              },
              {
                "name": "金东区",
                "code": "330703"
              },
              {
                "name": "武义县",
                "code": "330723"
              },
              {
                "name": "浦江县",
                "code": "330726"
              },
              {
                "name": "磐安县",
                "code": "330727"
              },
              {
                "name": "兰溪市",
                "code": "330781"
              },
              {
                "name": "义乌市",
                "code": "330782"
              },
              {
                "name": "东阳市",
                "code": "330783"
              },
              {
                "name": "永康市",
                "code": "330784"
              }
            ]
          },
          {
            "name": "衢州",
            "code": "8",
            "children": [
              {
                "name": "柯城区",
                "code": "330802"
              },
              {
                "name": "衢江区",
                "code": "330803"
              },
              {
                "name": "常山县",
                "code": "330822"
              },
              {
                "name": "开化县",
                "code": "330824"
              },
              {
                "name": "龙游县",
                "code": "330825"
              },
              {
                "name": "江山市",
                "code": "330881"
              }
            ]
          },
          {
            "name": "舟山",
            "code": "9",
            "children": [
              {
                "name": "定海区",
                "code": "330902"
              },
              {
                "name": "普陀区",
                "code": "330903"
              },
              {
                "name": "岱山县",
                "code": "330921"
              },
              {
                "name": "嵊泗县",
                "code": "330922"
              }
            ]
          }
        ]
      },
      {
        "name": "安徽",
        "code": "34",
        "children": [
          {
            "name": "合肥",
            "code": "1",
            "children": [
              {
                "name": "瑶海区",
                "code": "340102"
              },
              {
                "name": "庐阳区",
                "code": "340103"
              },
              {
                "name": "蜀山区",
                "code": "340104"
              },
              {
                "name": "包河区",
                "code": "340111"
              },
              {
                "name": "长丰县",
                "code": "340121"
              },
              {
                "name": "肥东县",
                "code": "340122"
              },
              {
                "name": "肥西县",
                "code": "340123"
              }
            ]
          },
          {
            "name": "黄山",
            "code": "10",
            "children": [
              {
                "name": "屯溪区",
                "code": "341002"
              },
              {
                "name": "黄山区",
                "code": "341003"
              },
              {
                "name": "徽州区",
                "code": "341004"
              },
              {
                "name": "歙　县",
                "code": "341021"
              },
              {
                "name": "休宁县",
                "code": "341022"
              },
              {
                "name": "黟　县",
                "code": "341023"
              },
              {
                "name": "祁门县",
                "code": "341024"
              }
            ]
          },
          {
            "name": "滁州",
            "code": "11",
            "children": [
              {
                "name": "琅琊区",
                "code": "341102"
              },
              {
                "name": "南谯区",
                "code": "341103"
              },
              {
                "name": "来安县",
                "code": "341122"
              },
              {
                "name": "全椒县",
                "code": "341124"
              },
              {
                "name": "定远县",
                "code": "341125"
              },
              {
                "name": "凤阳县",
                "code": "341126"
              },
              {
                "name": "天长市",
                "code": "341181"
              },
              {
                "name": "明光市",
                "code": "341182"
              }
            ]
          },
          {
            "name": "阜阳",
            "code": "12",
            "children": [
              {
                "name": "颍州区",
                "code": "341202"
              },
              {
                "name": "颍东区",
                "code": "341203"
              },
              {
                "name": "颍泉区",
                "code": "341204"
              },
              {
                "name": "临泉县",
                "code": "341221"
              },
              {
                "name": "太和县",
                "code": "341222"
              },
              {
                "name": "阜南县",
                "code": "341225"
              },
              {
                "name": "颍上县",
                "code": "341226"
              },
              {
                "name": "界首市",
                "code": "341282"
              }
            ]
          },
          {
            "name": "宿州",
            "code": "13",
            "children": [
              {
                "name": "埇桥区",
                "code": "341302"
              },
              {
                "name": "砀山县",
                "code": "341321"
              },
              {
                "name": "萧　县",
                "code": "341322"
              },
              {
                "name": "灵璧县",
                "code": "341323"
              },
              {
                "name": "泗　县",
                "code": "341324"
              }
            ]
          },
          {
            "name": "巢湖",
            "code": "14",
            "children": [
              {
                "name": "居巢区",
                "code": "341402"
              },
              {
                "name": "庐江县",
                "code": "341421"
              },
              {
                "name": "无为县",
                "code": "341422"
              },
              {
                "name": "含山县",
                "code": "341423"
              },
              {
                "name": "和　县",
                "code": "341424"
              }
            ]
          },
          {
            "name": "六安",
            "code": "15",
            "children": [
              {
                "name": "金安区",
                "code": "341502"
              },
              {
                "name": "裕安区",
                "code": "341503"
              },
              {
                "name": "寿　县",
                "code": "341521"
              },
              {
                "name": "霍邱县",
                "code": "341522"
              },
              {
                "name": "舒城县",
                "code": "341523"
              },
              {
                "name": "金寨县",
                "code": "341524"
              },
              {
                "name": "霍山县",
                "code": "341525"
              }
            ]
          },
          {
            "name": "亳州",
            "code": "16",
            "children": [
              {
                "name": "谯城区",
                "code": "341602"
              },
              {
                "name": "涡阳县",
                "code": "341621"
              },
              {
                "name": "蒙城县",
                "code": "341622"
              },
              {
                "name": "利辛县",
                "code": "341623"
              }
            ]
          },
          {
            "name": "池州",
            "code": "17",
            "children": [
              {
                "name": "贵池区",
                "code": "341702"
              },
              {
                "name": "东至县",
                "code": "341721"
              },
              {
                "name": "石台县",
                "code": "341722"
              },
              {
                "name": "青阳县",
                "code": "341723"
              }
            ]
          },
          {
            "name": "宣城",
            "code": "18",
            "children": [
              {
                "name": "宣州区",
                "code": "341802"
              },
              {
                "name": "郎溪县",
                "code": "341821"
              },
              {
                "name": "广德县",
                "code": "341822"
              },
              {
                "name": "泾　县",
                "code": "341823"
              },
              {
                "name": "绩溪县",
                "code": "341824"
              },
              {
                "name": "旌德县",
                "code": "341825"
              },
              {
                "name": "宁国市",
                "code": "341881"
              }
            ]
          },
          {
            "name": "芜湖",
            "code": "2",
            "children": [
              {
                "name": "镜湖区",
                "code": "340202"
              },
              {
                "name": "弋江区",
                "code": "340203"
              },
              {
                "name": "鸠江区",
                "code": "340207"
              },
              {
                "name": "三山区",
                "code": "340208"
              },
              {
                "name": "芜湖县",
                "code": "340221"
              },
              {
                "name": "繁昌县",
                "code": "340222"
              },
              {
                "name": "南陵县",
                "code": "340223"
              }
            ]
          },
          {
            "name": "蚌埠",
            "code": "3",
            "children": [
              {
                "name": "龙子湖区",
                "code": "340302"
              },
              {
                "name": "蚌山区",
                "code": "340303"
              },
              {
                "name": "禹会区",
                "code": "340304"
              },
              {
                "name": "淮上区",
                "code": "340311"
              },
              {
                "name": "怀远县",
                "code": "340321"
              },
              {
                "name": "五河县",
                "code": "340322"
              },
              {
                "name": "固镇县",
                "code": "340323"
              }
            ]
          },
          {
            "name": "淮南",
            "code": "4",
            "children": [
              {
                "name": "大通区",
                "code": "340402"
              },
              {
                "name": "田家庵区",
                "code": "340403"
              },
              {
                "name": "谢家集区",
                "code": "340404"
              },
              {
                "name": "八公山区",
                "code": "340405"
              },
              {
                "name": "潘集区",
                "code": "340406"
              },
              {
                "name": "凤台县",
                "code": "340421"
              }
            ]
          },
          {
            "name": "马鞍山",
            "code": "5",
            "children": [
              {
                "name": "金家庄区",
                "code": "340502"
              },
              {
                "name": "花山区",
                "code": "340503"
              },
              {
                "name": "雨山区",
                "code": "340504"
              },
              {
                "name": "当涂县",
                "code": "340521"
              }
            ]
          },
          {
            "name": "淮北",
            "code": "6",
            "children": [
              {
                "name": "杜集区",
                "code": "340602"
              },
              {
                "name": "相山区",
                "code": "340603"
              },
              {
                "name": "烈山区",
                "code": "340604"
              },
              {
                "name": "濉溪县",
                "code": "340621"
              }
            ]
          },
          {
            "name": "铜陵",
            "code": "7",
            "children": [
              {
                "name": "铜官山区",
                "code": "340702"
              },
              {
                "name": "狮子山区",
                "code": "340703"
              },
              {
                "name": "郊　区",
                "code": "340711"
              },
              {
                "name": "铜陵县",
                "code": "340721"
              }
            ]
          },
          {
            "name": "安庆",
            "code": "8",
            "children": [
              {
                "name": "迎江区",
                "code": "340802"
              },
              {
                "name": "大观区",
                "code": "340803"
              },
              {
                "name": "宜秀区",
                "code": "340811"
              },
              {
                "name": "怀宁县",
                "code": "340822"
              },
              {
                "name": "枞阳县",
                "code": "340823"
              },
              {
                "name": "潜山县",
                "code": "340824"
              },
              {
                "name": "太湖县",
                "code": "340825"
              },
              {
                "name": "宿松县",
                "code": "340826"
              },
              {
                "name": "望江县",
                "code": "340827"
              },
              {
                "name": "岳西县",
                "code": "340828"
              },
              {
                "name": "桐城市",
                "code": "340881"
              }
            ]
          }
        ]
      },
      {
        "name": "福建",
        "code": "35",
        "children": [
          {
            "name": "福州",
            "code": "1",
            "children": [
              {
                "name": "鼓楼区",
                "code": "350102"
              },
              {
                "name": "台江区",
                "code": "350103"
              },
              {
                "name": "仓山区",
                "code": "350104"
              },
              {
                "name": "马尾区",
                "code": "350105"
              },
              {
                "name": "晋安区",
                "code": "350111"
              },
              {
                "name": "闽侯县",
                "code": "350121"
              },
              {
                "name": "连江县",
                "code": "350122"
              },
              {
                "name": "罗源县",
                "code": "350123"
              },
              {
                "name": "闽清县",
                "code": "350124"
              },
              {
                "name": "永泰县",
                "code": "350125"
              },
              {
                "name": "平潭县",
                "code": "350128"
              },
              {
                "name": "福清市",
                "code": "350181"
              },
              {
                "name": "长乐市",
                "code": "350182"
              }
            ]
          },
          {
            "name": "厦门",
            "code": "2",
            "children": [
              {
                "name": "思明区",
                "code": "350203"
              },
              {
                "name": "海沧区",
                "code": "350205"
              },
              {
                "name": "湖里区",
                "code": "350206"
              },
              {
                "name": "集美区",
                "code": "350211"
              },
              {
                "name": "同安区",
                "code": "350212"
              },
              {
                "name": "翔安区",
                "code": "350213"
              }
            ]
          },
          {
            "name": "莆田",
            "code": "3",
            "children": [
              {
                "name": "城厢区",
                "code": "350302"
              },
              {
                "name": "涵江区",
                "code": "350303"
              },
              {
                "name": "荔城区",
                "code": "350304"
              },
              {
                "name": "秀屿区",
                "code": "350305"
              },
              {
                "name": "仙游县",
                "code": "350322"
              }
            ]
          },
          {
            "name": "三明",
            "code": "4",
            "children": [
              {
                "name": "梅列区",
                "code": "350402"
              },
              {
                "name": "三元区",
                "code": "350403"
              },
              {
                "name": "明溪县",
                "code": "350421"
              },
              {
                "name": "清流县",
                "code": "350423"
              },
              {
                "name": "宁化县",
                "code": "350424"
              },
              {
                "name": "大田县",
                "code": "350425"
              },
              {
                "name": "尤溪县",
                "code": "350426"
              },
              {
                "name": "沙　县",
                "code": "350427"
              },
              {
                "name": "将乐县",
                "code": "350428"
              },
              {
                "name": "泰宁县",
                "code": "350429"
              },
              {
                "name": "建宁县",
                "code": "350430"
              },
              {
                "name": "永安市",
                "code": "350481"
              }
            ]
          },
          {
            "name": "泉州",
            "code": "5",
            "children": [
              {
                "name": "鲤城区",
                "code": "350502"
              },
              {
                "name": "丰泽区",
                "code": "350503"
              },
              {
                "name": "洛江区",
                "code": "350504"
              },
              {
                "name": "泉港区",
                "code": "350505"
              },
              {
                "name": "惠安县",
                "code": "350521"
              },
              {
                "name": "安溪县",
                "code": "350524"
              },
              {
                "name": "永春县",
                "code": "350525"
              },
              {
                "name": "德化县",
                "code": "350526"
              },
              {
                "name": "金门县",
                "code": "350527"
              },
              {
                "name": "石狮市",
                "code": "350581"
              },
              {
                "name": "晋江市",
                "code": "350582"
              },
              {
                "name": "南安市",
                "code": "350583"
              }
            ]
          },
          {
            "name": "漳州",
            "code": "6",
            "children": [
              {
                "name": "芗城区",
                "code": "350602"
              },
              {
                "name": "龙文区",
                "code": "350603"
              },
              {
                "name": "云霄县",
                "code": "350622"
              },
              {
                "name": "漳浦县",
                "code": "350623"
              },
              {
                "name": "诏安县",
                "code": "350624"
              },
              {
                "name": "长泰县",
                "code": "350625"
              },
              {
                "name": "东山县",
                "code": "350626"
              },
              {
                "name": "南靖县",
                "code": "350627"
              },
              {
                "name": "平和县",
                "code": "350628"
              },
              {
                "name": "华安县",
                "code": "350629"
              },
              {
                "name": "龙海市",
                "code": "350681"
              }
            ]
          },
          {
            "name": "南平",
            "code": "7",
            "children": [
              {
                "name": "延平区",
                "code": "350702"
              },
              {
                "name": "顺昌县",
                "code": "350721"
              },
              {
                "name": "浦城县",
                "code": "350722"
              },
              {
                "name": "光泽县",
                "code": "350723"
              },
              {
                "name": "松溪县",
                "code": "350724"
              },
              {
                "name": "政和县",
                "code": "350725"
              },
              {
                "name": "邵武市",
                "code": "350781"
              },
              {
                "name": "武夷山市",
                "code": "350782"
              },
              {
                "name": "建瓯市",
                "code": "350783"
              },
              {
                "name": "建阳市",
                "code": "350784"
              }
            ]
          },
          {
            "name": "龙岩",
            "code": "8",
            "children": [
              {
                "name": "新罗区",
                "code": "350802"
              },
              {
                "name": "长汀县",
                "code": "350821"
              },
              {
                "name": "永定县",
                "code": "350822"
              },
              {
                "name": "上杭县",
                "code": "350823"
              },
              {
                "name": "武平县",
                "code": "350824"
              },
              {
                "name": "连城县",
                "code": "350825"
              },
              {
                "name": "漳平市",
                "code": "350881"
              }
            ]
          },
          {
            "name": "宁德",
            "code": "9",
            "children": [
              {
                "name": "蕉城区",
                "code": "350902"
              },
              {
                "name": "霞浦县",
                "code": "350921"
              },
              {
                "name": "古田县",
                "code": "350922"
              },
              {
                "name": "屏南县",
                "code": "350923"
              },
              {
                "name": "寿宁县",
                "code": "350924"
              },
              {
                "name": "周宁县",
                "code": "350925"
              },
              {
                "name": "柘荣县",
                "code": "350926"
              },
              {
                "name": "福安市",
                "code": "350981"
              },
              {
                "name": "福鼎市",
                "code": "350982"
              }
            ]
          }
        ]
      },
      {
        "name": "江西",
        "code": "36",
        "children": [
          {
            "name": "南昌",
            "code": "1",
            "children": [
              {
                "name": "东湖区",
                "code": "360102"
              },
              {
                "name": "西湖区",
                "code": "360103"
              },
              {
                "name": "青云谱区",
                "code": "360104"
              },
              {
                "name": "湾里区",
                "code": "360105"
              },
              {
                "name": "青山湖区",
                "code": "360111"
              },
              {
                "name": "南昌县",
                "code": "360121"
              },
              {
                "name": "新建县",
                "code": "360122"
              },
              {
                "name": "安义县",
                "code": "360123"
              },
              {
                "name": "进贤县",
                "code": "360124"
              }
            ]
          },
          {
            "name": "抚州",
            "code": "10",
            "children": [
              {
                "name": "临川区",
                "code": "361002"
              },
              {
                "name": "南城县",
                "code": "361021"
              },
              {
                "name": "黎川县",
                "code": "361022"
              },
              {
                "name": "南丰县",
                "code": "361023"
              },
              {
                "name": "崇仁县",
                "code": "361024"
              },
              {
                "name": "乐安县",
                "code": "361025"
              },
              {
                "name": "宜黄县",
                "code": "361026"
              },
              {
                "name": "金溪县",
                "code": "361027"
              },
              {
                "name": "资溪县",
                "code": "361028"
              },
              {
                "name": "东乡县",
                "code": "361029"
              },
              {
                "name": "广昌县",
                "code": "361030"
              }
            ]
          },
          {
            "name": "上饶",
            "code": "11",
            "children": [
              {
                "name": "信州区",
                "code": "361102"
              },
              {
                "name": "上饶县",
                "code": "361121"
              },
              {
                "name": "广丰县",
                "code": "361122"
              },
              {
                "name": "玉山县",
                "code": "361123"
              },
              {
                "name": "铅山县",
                "code": "361124"
              },
              {
                "name": "横峰县",
                "code": "361125"
              },
              {
                "name": "弋阳县",
                "code": "361126"
              },
              {
                "name": "余干县",
                "code": "361127"
              },
              {
                "name": "鄱阳县",
                "code": "361128"
              },
              {
                "name": "万年县",
                "code": "361129"
              },
              {
                "name": "婺源县",
                "code": "361130"
              },
              {
                "name": "德兴市",
                "code": "361181"
              }
            ]
          },
          {
            "name": "景德镇",
            "code": "2",
            "children": [
              {
                "name": "昌江区",
                "code": "360202"
              },
              {
                "name": "珠山区",
                "code": "360203"
              },
              {
                "name": "浮梁县",
                "code": "360222"
              },
              {
                "name": "乐平市",
                "code": "360281"
              }
            ]
          },
          {
            "name": "萍乡",
            "code": "3",
            "children": [
              {
                "name": "安源区",
                "code": "360302"
              },
              {
                "name": "芦溪县",
                "code": "360323"
              }
            ]
          },
          {
            "name": "九江",
            "code": "4",
            "children": [
              {
                "name": "湘东区",
                "code": "360313"
              },
              {
                "name": "庐山区",
                "code": "360402"
              },
              {
                "name": "浔阳区",
                "code": "360403"
              },
              {
                "name": "九江县",
                "code": "360421"
              },
              {
                "name": "武宁县",
                "code": "360423"
              },
              {
                "name": "修水县",
                "code": "360424"
              },
              {
                "name": "永修县",
                "code": "360425"
              },
              {
                "name": "德安县",
                "code": "360426"
              },
              {
                "name": "星子县",
                "code": "360427"
              },
              {
                "name": "都昌县",
                "code": "360428"
              },
              {
                "name": "湖口县",
                "code": "360429"
              },
              {
                "name": "彭泽县",
                "code": "360430"
              },
              {
                "name": "瑞昌市",
                "code": "360481"
              }
            ]
          },
          {
            "name": "新余",
            "code": "5",
            "children": [
              {
                "name": "莲花县",
                "code": "360321"
              },
              {
                "name": "渝水区",
                "code": "360502"
              },
              {
                "name": "分宜县",
                "code": "360521"
              }
            ]
          },
          {
            "name": "鹰潭",
            "code": "6",
            "children": [
              {
                "name": "上栗县",
                "code": "360322"
              },
              {
                "name": "月湖区",
                "code": "360602"
              },
              {
                "name": "余江县",
                "code": "360622"
              },
              {
                "name": "贵溪市",
                "code": "360681"
              }
            ]
          },
          {
            "name": "赣州",
            "code": "7",
            "children": [
              {
                "name": "章贡区",
                "code": "360702"
              },
              {
                "name": "赣　县",
                "code": "360721"
              },
              {
                "name": "信丰县",
                "code": "360722"
              },
              {
                "name": "大余县",
                "code": "360723"
              },
              {
                "name": "上犹县",
                "code": "360724"
              },
              {
                "name": "崇义县",
                "code": "360725"
              },
              {
                "name": "安远县",
                "code": "360726"
              },
              {
                "name": "龙南县",
                "code": "360727"
              },
              {
                "name": "定南县",
                "code": "360728"
              },
              {
                "name": "全南县",
                "code": "360729"
              },
              {
                "name": "宁都县",
                "code": "360730"
              },
              {
                "name": "于都县",
                "code": "360731"
              },
              {
                "name": "兴国县",
                "code": "360732"
              },
              {
                "name": "会昌县",
                "code": "360733"
              },
              {
                "name": "寻乌县",
                "code": "360734"
              },
              {
                "name": "石城县",
                "code": "360735"
              },
              {
                "name": "瑞金市",
                "code": "360781"
              },
              {
                "name": "南康市",
                "code": "360782"
              }
            ]
          },
          {
            "name": "吉安",
            "code": "8",
            "children": [
              {
                "name": "吉州区",
                "code": "360802"
              },
              {
                "name": "青原区",
                "code": "360803"
              },
              {
                "name": "吉安县",
                "code": "360821"
              },
              {
                "name": "吉水县",
                "code": "360822"
              },
              {
                "name": "峡江县",
                "code": "360823"
              },
              {
                "name": "新干县",
                "code": "360824"
              },
              {
                "name": "永丰县",
                "code": "360825"
              },
              {
                "name": "泰和县",
                "code": "360826"
              },
              {
                "name": "遂川县",
                "code": "360827"
              },
              {
                "name": "万安县",
                "code": "360828"
              },
              {
                "name": "安福县",
                "code": "360829"
              },
              {
                "name": "永新县",
                "code": "360830"
              },
              {
                "name": "井冈山市",
                "code": "360881"
              }
            ]
          },
          {
            "name": "宜春",
            "code": "9",
            "children": [
              {
                "name": "袁州区",
                "code": "360902"
              },
              {
                "name": "奉新县",
                "code": "360921"
              },
              {
                "name": "万载县",
                "code": "360922"
              },
              {
                "name": "上高县",
                "code": "360923"
              },
              {
                "name": "宜丰县",
                "code": "360924"
              },
              {
                "name": "靖安县",
                "code": "360925"
              },
              {
                "name": "铜鼓县",
                "code": "360926"
              },
              {
                "name": "丰城市",
                "code": "360981"
              },
              {
                "name": "樟树市",
                "code": "360982"
              },
              {
                "name": "高安市",
                "code": "360983"
              }
            ]
          }
        ]
      },
      {
        "name": "山东",
        "code": "37",
        "children": [
          {
            "name": "济南",
            "code": "1",
            "children": [
              {
                "name": "历下区",
                "code": "370102"
              },
              {
                "name": "市中区",
                "code": "370103"
              },
              {
                "name": "槐荫区",
                "code": "370104"
              },
              {
                "name": "天桥区",
                "code": "370105"
              },
              {
                "name": "历城区",
                "code": "370112"
              },
              {
                "name": "长清区",
                "code": "370113"
              },
              {
                "name": "平阴县",
                "code": "370124"
              },
              {
                "name": "济阳县",
                "code": "370125"
              },
              {
                "name": "商河县",
                "code": "370126"
              },
              {
                "name": "章丘市",
                "code": "370181"
              }
            ]
          },
          {
            "name": "威海",
            "code": "10",
            "children": [
              {
                "name": "环翠区",
                "code": "371002"
              },
              {
                "name": "文登市",
                "code": "371081"
              },
              {
                "name": "荣成市",
                "code": "371082"
              },
              {
                "name": "乳山市",
                "code": "371083"
              }
            ]
          },
          {
            "name": "日照",
            "code": "11",
            "children": [
              {
                "name": "东港区",
                "code": "371102"
              },
              {
                "name": "岚山区",
                "code": "371103"
              },
              {
                "name": "五莲县",
                "code": "371121"
              },
              {
                "name": "莒　县",
                "code": "371122"
              }
            ]
          },
          {
            "name": "莱芜",
            "code": "12",
            "children": [
              {
                "name": "莱城区",
                "code": "371202"
              },
              {
                "name": "钢城区",
                "code": "371203"
              }
            ]
          },
          {
            "name": "临沂",
            "code": "13",
            "children": [
              {
                "name": "兰山区",
                "code": "371302"
              },
              {
                "name": "罗庄区",
                "code": "371311"
              },
              {
                "name": "河东区",
                "code": "371312"
              },
              {
                "name": "沂南县",
                "code": "371321"
              },
              {
                "name": "郯城县",
                "code": "371322"
              },
              {
                "name": "沂水县",
                "code": "371323"
              },
              {
                "name": "苍山县",
                "code": "371324"
              },
              {
                "name": "费　县",
                "code": "371325"
              },
              {
                "name": "平邑县",
                "code": "371326"
              },
              {
                "name": "莒南县",
                "code": "371327"
              },
              {
                "name": "蒙阴县",
                "code": "371328"
              },
              {
                "name": "临沭县",
                "code": "371329"
              }
            ]
          },
          {
            "name": "德州",
            "code": "14",
            "children": [
              {
                "name": "德城区",
                "code": "371402"
              },
              {
                "name": "陵　县",
                "code": "371421"
              },
              {
                "name": "宁津县",
                "code": "371422"
              },
              {
                "name": "庆云县",
                "code": "371423"
              },
              {
                "name": "临邑县",
                "code": "371424"
              },
              {
                "name": "齐河县",
                "code": "371425"
              },
              {
                "name": "平原县",
                "code": "371426"
              },
              {
                "name": "夏津县",
                "code": "371427"
              },
              {
                "name": "武城县",
                "code": "371428"
              },
              {
                "name": "乐陵市",
                "code": "371481"
              },
              {
                "name": "禹城市",
                "code": "371482"
              }
            ]
          },
          {
            "name": "聊城",
            "code": "15",
            "children": [
              {
                "name": "东昌府区",
                "code": "371502"
              },
              {
                "name": "阳谷县",
                "code": "371521"
              },
              {
                "name": "莘　县",
                "code": "371522"
              },
              {
                "name": "茌平县",
                "code": "371523"
              },
              {
                "name": "东阿县",
                "code": "371524"
              },
              {
                "name": "冠　县",
                "code": "371525"
              },
              {
                "name": "高唐县",
                "code": "371526"
              },
              {
                "name": "临清市",
                "code": "371581"
              }
            ]
          },
          {
            "name": "滨州",
            "code": "16",
            "children": [
              {
                "name": "滨城区",
                "code": "371602"
              },
              {
                "name": "惠民县",
                "code": "371621"
              },
              {
                "name": "阳信县",
                "code": "371622"
              },
              {
                "name": "无棣县",
                "code": "371623"
              },
              {
                "name": "沾化县",
                "code": "371624"
              },
              {
                "name": "博兴县",
                "code": "371625"
              },
              {
                "name": "邹平县",
                "code": "371626"
              }
            ]
          },
          {
            "name": "菏泽",
            "code": "17",
            "children": [
              {
                "name": "牡丹区",
                "code": "371702"
              },
              {
                "name": "曹　县",
                "code": "371721"
              },
              {
                "name": "单　县",
                "code": "371722"
              },
              {
                "name": "成武县",
                "code": "371723"
              },
              {
                "name": "巨野县",
                "code": "371724"
              },
              {
                "name": "郓城县",
                "code": "371725"
              },
              {
                "name": "鄄城县",
                "code": "371726"
              },
              {
                "name": "定陶县",
                "code": "371727"
              },
              {
                "name": "东明县",
                "code": "371728"
              }
            ]
          },
          {
            "name": "青岛",
            "code": "2",
            "children": [
              {
                "name": "市南区",
                "code": "370202"
              },
              {
                "name": "市北区",
                "code": "370203"
              },
              {
                "name": "四方区",
                "code": "370205"
              },
              {
                "name": "黄岛区",
                "code": "370211"
              },
              {
                "name": "崂山区",
                "code": "370212"
              },
              {
                "name": "李沧区",
                "code": "370213"
              },
              {
                "name": "城阳区",
                "code": "370214"
              },
              {
                "name": "胶州市",
                "code": "370281"
              },
              {
                "name": "即墨市",
                "code": "370282"
              },
              {
                "name": "平度市",
                "code": "370283"
              },
              {
                "name": "胶南市",
                "code": "370284"
              },
              {
                "name": "莱西市",
                "code": "370285"
              }
            ]
          },
          {
            "name": "淄博",
            "code": "3",
            "children": [
              {
                "name": "淄川区",
                "code": "370302"
              },
              {
                "name": "张店区",
                "code": "370303"
              },
              {
                "name": "博山区",
                "code": "370304"
              },
              {
                "name": "临淄区",
                "code": "370305"
              },
              {
                "name": "周村区",
                "code": "370306"
              },
              {
                "name": "桓台县",
                "code": "370321"
              },
              {
                "name": "高青县",
                "code": "370322"
              },
              {
                "name": "沂源县",
                "code": "370323"
              }
            ]
          },
          {
            "name": "枣庄",
            "code": "4",
            "children": [
              {
                "name": "市中区",
                "code": "370402"
              },
              {
                "name": "薛城区",
                "code": "370403"
              },
              {
                "name": "峄城区",
                "code": "370404"
              },
              {
                "name": "台儿庄区",
                "code": "370405"
              },
              {
                "name": "山亭区",
                "code": "370406"
              },
              {
                "name": "滕州市",
                "code": "370481"
              }
            ]
          },
          {
            "name": "东营",
            "code": "5",
            "children": [
              {
                "name": "东营区",
                "code": "370502"
              },
              {
                "name": "河口区",
                "code": "370503"
              },
              {
                "name": "垦利县",
                "code": "370521"
              },
              {
                "name": "利津县",
                "code": "370522"
              },
              {
                "name": "广饶县",
                "code": "370523"
              }
            ]
          },
          {
            "name": "烟台",
            "code": "6",
            "children": [
              {
                "name": "芝罘区",
                "code": "370602"
              },
              {
                "name": "福山区",
                "code": "370611"
              },
              {
                "name": "牟平区",
                "code": "370612"
              },
              {
                "name": "莱山区",
                "code": "370613"
              },
              {
                "name": "长岛县",
                "code": "370634"
              },
              {
                "name": "龙口市",
                "code": "370681"
              },
              {
                "name": "莱阳市",
                "code": "370682"
              },
              {
                "name": "莱州市",
                "code": "370683"
              },
              {
                "name": "蓬莱市",
                "code": "370684"
              },
              {
                "name": "招远市",
                "code": "370685"
              },
              {
                "name": "栖霞市",
                "code": "370686"
              },
              {
                "name": "海阳市",
                "code": "370687"
              }
            ]
          },
          {
            "name": "潍坊",
            "code": "7",
            "children": [
              {
                "name": "潍城区",
                "code": "370702"
              },
              {
                "name": "寒亭区",
                "code": "370703"
              },
              {
                "name": "坊子区",
                "code": "370704"
              },
              {
                "name": "奎文区",
                "code": "370705"
              },
              {
                "name": "临朐县",
                "code": "370724"
              },
              {
                "name": "昌乐县",
                "code": "370725"
              },
              {
                "name": "青州市",
                "code": "370781"
              },
              {
                "name": "诸城市",
                "code": "370782"
              },
              {
                "name": "寿光市",
                "code": "370783"
              },
              {
                "name": "安丘市",
                "code": "370784"
              },
              {
                "name": "高密市",
                "code": "370785"
              },
              {
                "name": "昌邑市",
                "code": "370786"
              }
            ]
          },
          {
            "name": "济宁",
            "code": "8",
            "children": [
              {
                "name": "市中区",
                "code": "370802"
              },
              {
                "name": "任城区",
                "code": "370811"
              },
              {
                "name": "微山县",
                "code": "370826"
              },
              {
                "name": "鱼台县",
                "code": "370827"
              },
              {
                "name": "金乡县",
                "code": "370828"
              },
              {
                "name": "嘉祥县",
                "code": "370829"
              },
              {
                "name": "汶上县",
                "code": "370830"
              },
              {
                "name": "泗水县",
                "code": "370831"
              },
              {
                "name": "梁山县",
                "code": "370832"
              },
              {
                "name": "曲阜市",
                "code": "370881"
              },
              {
                "name": "兖州市",
                "code": "370882"
              },
              {
                "name": "邹城市",
                "code": "370883"
              }
            ]
          },
          {
            "name": "泰安",
            "code": "9",
            "children": [
              {
                "name": "泰山区",
                "code": "370902"
              },
              {
                "name": "岱岳区",
                "code": "370911"
              },
              {
                "name": "宁阳县",
                "code": "370921"
              },
              {
                "name": "东平县",
                "code": "370923"
              },
              {
                "name": "新泰市",
                "code": "370982"
              },
              {
                "name": "肥城市",
                "code": "370983"
              }
            ]
          }
        ]
      },
      {
        "name": "河南",
        "code": "41",
        "children": [
          {
            "name": "郑州",
            "code": "1",
            "children": [
              {
                "name": "中原区",
                "code": "410102"
              },
              {
                "name": "二七区",
                "code": "410103"
              },
              {
                "name": "管城回族区",
                "code": "410104"
              },
              {
                "name": "金水区",
                "code": "410105"
              },
              {
                "name": "上街区",
                "code": "410106"
              },
              {
                "name": "惠济区",
                "code": "410108"
              },
              {
                "name": "中牟县",
                "code": "410122"
              },
              {
                "name": "巩义市",
                "code": "410181"
              },
              {
                "name": "荥阳市",
                "code": "410182"
              },
              {
                "name": "新密市",
                "code": "410183"
              },
              {
                "name": "新郑市",
                "code": "410184"
              },
              {
                "name": "登封市",
                "code": "410185"
              }
            ]
          },
          {
            "name": "许昌",
            "code": "10",
            "children": [
              {
                "name": "魏都区",
                "code": "411002"
              },
              {
                "name": "许昌县",
                "code": "411023"
              },
              {
                "name": "鄢陵县",
                "code": "411024"
              },
              {
                "name": "襄城县",
                "code": "411025"
              },
              {
                "name": "禹州市",
                "code": "411081"
              },
              {
                "name": "长葛市",
                "code": "411082"
              }
            ]
          },
          {
            "name": "漯河",
            "code": "11",
            "children": [
              {
                "name": "源汇区",
                "code": "411102"
              },
              {
                "name": "郾城区",
                "code": "411103"
              },
              {
                "name": "召陵区",
                "code": "411104"
              },
              {
                "name": "舞阳县",
                "code": "411121"
              },
              {
                "name": "临颍县",
                "code": "411122"
              }
            ]
          },
          {
            "name": "三门峡",
            "code": "12",
            "children": [
              {
                "name": "湖滨区",
                "code": "411202"
              },
              {
                "name": "渑池县",
                "code": "411221"
              },
              {
                "name": "陕　县",
                "code": "411222"
              },
              {
                "name": "卢氏县",
                "code": "411224"
              },
              {
                "name": "义马市",
                "code": "411281"
              },
              {
                "name": "灵宝市",
                "code": "411282"
              }
            ]
          },
          {
            "name": "南阳",
            "code": "13",
            "children": [
              {
                "name": "宛城区",
                "code": "411302"
              },
              {
                "name": "卧龙区",
                "code": "411303"
              },
              {
                "name": "南召县",
                "code": "411321"
              },
              {
                "name": "方城县",
                "code": "411322"
              },
              {
                "name": "西峡县",
                "code": "411323"
              },
              {
                "name": "镇平县",
                "code": "411324"
              },
              {
                "name": "内乡县",
                "code": "411325"
              },
              {
                "name": "淅川县",
                "code": "411326"
              },
              {
                "name": "社旗县",
                "code": "411327"
              },
              {
                "name": "唐河县",
                "code": "411328"
              },
              {
                "name": "新野县",
                "code": "411329"
              },
              {
                "name": "桐柏县",
                "code": "411330"
              },
              {
                "name": "邓州市",
                "code": "411381"
              }
            ]
          },
          {
            "name": "商丘",
            "code": "14",
            "children": [
              {
                "name": "梁园区",
                "code": "411402"
              },
              {
                "name": "睢阳区",
                "code": "411403"
              },
              {
                "name": "民权县",
                "code": "411421"
              },
              {
                "name": "睢　县",
                "code": "411422"
              },
              {
                "name": "宁陵县",
                "code": "411423"
              },
              {
                "name": "柘城县",
                "code": "411424"
              },
              {
                "name": "虞城县",
                "code": "411425"
              },
              {
                "name": "夏邑县",
                "code": "411426"
              },
              {
                "name": "永城市",
                "code": "411481"
              }
            ]
          },
          {
            "name": "信阳",
            "code": "15",
            "children": [
              {
                "name": "浉河区",
                "code": "411502"
              },
              {
                "name": "平桥区",
                "code": "411503"
              },
              {
                "name": "罗山县",
                "code": "411521"
              },
              {
                "name": "光山县",
                "code": "411522"
              },
              {
                "name": "新　县",
                "code": "411523"
              },
              {
                "name": "商城县",
                "code": "411524"
              },
              {
                "name": "固始县",
                "code": "411525"
              },
              {
                "name": "潢川县",
                "code": "411526"
              },
              {
                "name": "淮滨县",
                "code": "411527"
              },
              {
                "name": "息　县",
                "code": "411528"
              }
            ]
          },
          {
            "name": "周口",
            "code": "16",
            "children": [
              {
                "name": "川汇区",
                "code": "411602"
              },
              {
                "name": "扶沟县",
                "code": "411621"
              },
              {
                "name": "西华县",
                "code": "411622"
              },
              {
                "name": "商水县",
                "code": "411623"
              },
              {
                "name": "沈丘县",
                "code": "411624"
              },
              {
                "name": "郸城县",
                "code": "411625"
              },
              {
                "name": "淮阳县",
                "code": "411626"
              },
              {
                "name": "太康县",
                "code": "411627"
              },
              {
                "name": "鹿邑县",
                "code": "411628"
              },
              {
                "name": "项城市",
                "code": "411681"
              }
            ]
          },
          {
            "name": "驻马店",
            "code": "17",
            "children": [
              {
                "name": "驿城区",
                "code": "411702"
              },
              {
                "name": "西平县",
                "code": "411721"
              },
              {
                "name": "上蔡县",
                "code": "411722"
              },
              {
                "name": "平舆县",
                "code": "411723"
              },
              {
                "name": "正阳县",
                "code": "411724"
              },
              {
                "name": "确山县",
                "code": "411725"
              },
              {
                "name": "泌阳县",
                "code": "411726"
              },
              {
                "name": "汝南县",
                "code": "411727"
              },
              {
                "name": "遂平县",
                "code": "411728"
              },
              {
                "name": "新蔡县",
                "code": "411729"
              }
            ]
          },
          {
            "name": "济源",
            "code": "18"
          },
          {
            "name": "开封",
            "code": "2",
            "children": [
              {
                "name": "龙亭区",
                "code": "410202"
              },
              {
                "name": "顺河回族区",
                "code": "410203"
              },
              {
                "name": "鼓楼区",
                "code": "410204"
              },
              {
                "name": "禹王台区",
                "code": "410205"
              },
              {
                "name": "金明区",
                "code": "410211"
              },
              {
                "name": "杞　县",
                "code": "410221"
              },
              {
                "name": "通许县",
                "code": "410222"
              },
              {
                "name": "尉氏县",
                "code": "410223"
              },
              {
                "name": "开封县",
                "code": "410224"
              },
              {
                "name": "兰考县",
                "code": "410225"
              }
            ]
          },
          {
            "name": "洛阳",
            "code": "3",
            "children": [
              {
                "name": "老城区",
                "code": "410302"
              },
              {
                "name": "西工区",
                "code": "410303"
              },
              {
                "name": "瀍河回族区",
                "code": "410304"
              },
              {
                "name": "涧西区",
                "code": "410305"
              },
              {
                "name": "吉利区",
                "code": "410306"
              },
              {
                "name": "洛龙区",
                "code": "410311"
              },
              {
                "name": "孟津县",
                "code": "410322"
              },
              {
                "name": "新安县",
                "code": "410323"
              },
              {
                "name": "栾川县",
                "code": "410324"
              },
              {
                "name": "嵩　县",
                "code": "410325"
              },
              {
                "name": "汝阳县",
                "code": "410326"
              },
              {
                "name": "宜阳县",
                "code": "410327"
              },
              {
                "name": "洛宁县",
                "code": "410328"
              },
              {
                "name": "伊川县",
                "code": "410329"
              },
              {
                "name": "偃师市",
                "code": "410381"
              }
            ]
          },
          {
            "name": "平顶山",
            "code": "4",
            "children": [
              {
                "name": "新华区",
                "code": "410402"
              },
              {
                "name": "卫东区",
                "code": "410403"
              },
              {
                "name": "石龙区",
                "code": "410404"
              },
              {
                "name": "湛河区",
                "code": "410411"
              },
              {
                "name": "宝丰县",
                "code": "410421"
              },
              {
                "name": "叶　县",
                "code": "410422"
              },
              {
                "name": "鲁山县",
                "code": "410423"
              },
              {
                "name": "郏　县",
                "code": "410425"
              },
              {
                "name": "舞钢市",
                "code": "410481"
              },
              {
                "name": "汝州市",
                "code": "410482"
              }
            ]
          },
          {
            "name": "安阳",
            "code": "5",
            "children": [
              {
                "name": "文峰区",
                "code": "410502"
              },
              {
                "name": "北关区",
                "code": "410503"
              },
              {
                "name": "殷都区",
                "code": "410505"
              },
              {
                "name": "龙安区",
                "code": "410506"
              },
              {
                "name": "安阳县",
                "code": "410522"
              },
              {
                "name": "汤阴县",
                "code": "410523"
              },
              {
                "name": "滑　县",
                "code": "410526"
              },
              {
                "name": "内黄县",
                "code": "410527"
              },
              {
                "name": "林州市",
                "code": "410581"
              }
            ]
          },
          {
            "name": "鹤壁",
            "code": "6",
            "children": [
              {
                "name": "鹤山区",
                "code": "410602"
              },
              {
                "name": "山城区",
                "code": "410603"
              },
              {
                "name": "淇滨区",
                "code": "410611"
              },
              {
                "name": "浚　县",
                "code": "410621"
              },
              {
                "name": "淇　县",
                "code": "410622"
              }
            ]
          },
          {
            "name": "新乡",
            "code": "7",
            "children": [
              {
                "name": "红旗区",
                "code": "410702"
              },
              {
                "name": "卫滨区",
                "code": "410703"
              },
              {
                "name": "凤泉区",
                "code": "410704"
              },
              {
                "name": "牧野区",
                "code": "410711"
              },
              {
                "name": "新乡县",
                "code": "410721"
              },
              {
                "name": "获嘉县",
                "code": "410724"
              },
              {
                "name": "原阳县",
                "code": "410725"
              },
              {
                "name": "延津县",
                "code": "410726"
              },
              {
                "name": "封丘县",
                "code": "410727"
              },
              {
                "name": "长垣县",
                "code": "410728"
              },
              {
                "name": "卫辉市",
                "code": "410781"
              },
              {
                "name": "辉县市",
                "code": "410782"
              }
            ]
          },
          {
            "name": "焦作",
            "code": "8",
            "children": [
              {
                "name": "解放区",
                "code": "410802"
              },
              {
                "name": "中站区",
                "code": "410803"
              },
              {
                "name": "马村区",
                "code": "410804"
              },
              {
                "name": "山阳区",
                "code": "410811"
              },
              {
                "name": "修武县",
                "code": "410821"
              },
              {
                "name": "博爱县",
                "code": "410822"
              },
              {
                "name": "武陟县",
                "code": "410823"
              },
              {
                "name": "温　县",
                "code": "410825"
              },
              {
                "name": "沁阳市",
                "code": "410882"
              },
              {
                "name": "孟州市",
                "code": "410883"
              }
            ]
          },
          {
            "name": "濮阳",
            "code": "9",
            "children": [
              {
                "name": "华龙区",
                "code": "410902"
              },
              {
                "name": "清丰县",
                "code": "410922"
              },
              {
                "name": "南乐县",
                "code": "410923"
              },
              {
                "name": "范　县",
                "code": "410926"
              },
              {
                "name": "台前县",
                "code": "410927"
              },
              {
                "name": "濮阳县",
                "code": "410928"
              }
            ]
          }
        ]
      },
      {
        "name": "湖北",
        "code": "42",
        "children": [
          {
            "name": "武汉",
            "code": "1",
            "children": [
              {
                "name": "江岸区",
                "code": "420102"
              },
              {
                "name": "江汉区",
                "code": "420103"
              },
              {
                "name": "硚口区",
                "code": "420104"
              },
              {
                "name": "汉阳区",
                "code": "420105"
              },
              {
                "name": "武昌区",
                "code": "420106"
              },
              {
                "name": "青山区",
                "code": "420107"
              },
              {
                "name": "洪山区",
                "code": "420111"
              },
              {
                "name": "东西湖区",
                "code": "420112"
              },
              {
                "name": "汉南区",
                "code": "420113"
              },
              {
                "name": "蔡甸区",
                "code": "420114"
              },
              {
                "name": "江夏区",
                "code": "420115"
              },
              {
                "name": "黄陂区",
                "code": "420116"
              },
              {
                "name": "新洲区",
                "code": "420117"
              }
            ]
          },
          {
            "name": "荆州",
            "code": "10",
            "children": [
              {
                "name": "沙市区",
                "code": "421002"
              },
              {
                "name": "荆州区",
                "code": "421003"
              },
              {
                "name": "公安县",
                "code": "421022"
              },
              {
                "name": "监利县",
                "code": "421023"
              },
              {
                "name": "江陵县",
                "code": "421024"
              },
              {
                "name": "石首市",
                "code": "421081"
              },
              {
                "name": "洪湖市",
                "code": "421083"
              },
              {
                "name": "松滋市",
                "code": "421087"
              }
            ]
          },
          {
            "name": "黄冈",
            "code": "11",
            "children": [
              {
                "name": "黄州区",
                "code": "421102"
              },
              {
                "name": "团风县",
                "code": "421121"
              },
              {
                "name": "红安县",
                "code": "421122"
              },
              {
                "name": "罗田县",
                "code": "421123"
              },
              {
                "name": "英山县",
                "code": "421124"
              },
              {
                "name": "浠水县",
                "code": "421125"
              },
              {
                "name": "蕲春县",
                "code": "421126"
              },
              {
                "name": "黄梅县",
                "code": "421127"
              },
              {
                "name": "麻城市",
                "code": "421181"
              },
              {
                "name": "武穴市",
                "code": "421182"
              }
            ]
          },
          {
            "name": "咸宁",
            "code": "12",
            "children": [
              {
                "name": "咸安区",
                "code": "421202"
              },
              {
                "name": "嘉鱼县",
                "code": "421221"
              },
              {
                "name": "通城县",
                "code": "421222"
              },
              {
                "name": "崇阳县",
                "code": "421223"
              },
              {
                "name": "通山县",
                "code": "421224"
              },
              {
                "name": "赤壁市",
                "code": "421281"
              }
            ]
          },
          {
            "name": "随州",
            "code": "13",
            "children": [
              {
                "name": "曾都区",
                "code": "421302"
              },
              {
                "name": "广水市",
                "code": "421381"
              }
            ]
          },
          {
            "name": "黄石",
            "code": "2",
            "children": [
              {
                "name": "黄石港区",
                "code": "420202"
              },
              {
                "name": "西塞山区",
                "code": "420203"
              },
              {
                "name": "下陆区",
                "code": "420204"
              },
              {
                "name": "铁山区",
                "code": "420205"
              },
              {
                "name": "阳新县",
                "code": "420222"
              },
              {
                "name": "大冶市",
                "code": "420281"
              }
            ]
          },
          {
            "name": "恩施",
            "code": "28",
            "children": [
              {
                "name": "恩施市",
                "code": "422801"
              },
              {
                "name": "利川市",
                "code": "422802"
              },
              {
                "name": "建始县",
                "code": "422822"
              },
              {
                "name": "巴东县",
                "code": "422823"
              },
              {
                "name": "宣恩县",
                "code": "422825"
              },
              {
                "name": "咸丰县",
                "code": "422826"
              },
              {
                "name": "来凤县",
                "code": "422827"
              },
              {
                "name": "鹤峰县",
                "code": "422828"
              }
            ]
          },
          {
            "name": "十堰",
            "code": "3",
            "children": [
              {
                "name": "茅箭区",
                "code": "420302"
              },
              {
                "name": "张湾区",
                "code": "420303"
              },
              {
                "name": "郧　县",
                "code": "420321"
              },
              {
                "name": "郧西县",
                "code": "420322"
              },
              {
                "name": "竹山县",
                "code": "420323"
              },
              {
                "name": "竹溪县",
                "code": "420324"
              },
              {
                "name": "房　县",
                "code": "420325"
              },
              {
                "name": "丹江口市",
                "code": "420381"
              }
            ]
          },
          {
            "name": "宜昌",
            "code": "5",
            "children": [
              {
                "name": "西陵区",
                "code": "420502"
              },
              {
                "name": "伍家岗区",
                "code": "420503"
              },
              {
                "name": "点军区",
                "code": "420504"
              },
              {
                "name": "猇亭区",
                "code": "420505"
              },
              {
                "name": "夷陵区",
                "code": "420506"
              },
              {
                "name": "远安县",
                "code": "420525"
              },
              {
                "name": "兴山县",
                "code": "420526"
              },
              {
                "name": "秭归县",
                "code": "420527"
              },
              {
                "name": "长阳土家族自治县",
                "code": "420528"
              },
              {
                "name": "五峰土家族自治县",
                "code": "420529"
              },
              {
                "name": "宜都市",
                "code": "420581"
              },
              {
                "name": "当阳市",
                "code": "420582"
              },
              {
                "name": "枝江市",
                "code": "420583"
              }
            ]
          },
          {
            "name": "襄樊",
            "code": "6",
            "children": [
              {
                "name": "襄城区",
                "code": "420602"
              },
              {
                "name": "樊城区",
                "code": "420606"
              },
              {
                "name": "襄阳区",
                "code": "420607"
              },
              {
                "name": "南漳县",
                "code": "420624"
              },
              {
                "name": "谷城县",
                "code": "420625"
              },
              {
                "name": "保康县",
                "code": "420626"
              },
              {
                "name": "老河口市",
                "code": "420682"
              },
              {
                "name": "枣阳市",
                "code": "420683"
              },
              {
                "name": "宜城市",
                "code": "420684"
              }
            ]
          },
          {
            "name": "鄂州",
            "code": "7",
            "children": [
              {
                "name": "梁子湖区",
                "code": "420702"
              },
              {
                "name": "华容区",
                "code": "420703"
              },
              {
                "name": "鄂城区",
                "code": "420704"
              }
            ]
          },
          {
            "name": "荆门",
            "code": "8",
            "children": [
              {
                "name": "东宝区",
                "code": "420802"
              },
              {
                "name": "掇刀区",
                "code": "420804"
              },
              {
                "name": "京山县",
                "code": "420821"
              },
              {
                "name": "沙洋县",
                "code": "420822"
              },
              {
                "name": "钟祥市",
                "code": "420881"
              }
            ]
          },
          {
            "name": "孝感",
            "code": "9",
            "children": [
              {
                "name": "孝南区",
                "code": "420902"
              },
              {
                "name": "孝昌县",
                "code": "420921"
              },
              {
                "name": "大悟县",
                "code": "420922"
              },
              {
                "name": "云梦县",
                "code": "420923"
              },
              {
                "name": "应城市",
                "code": "420981"
              },
              {
                "name": "安陆市",
                "code": "420982"
              },
              {
                "name": "汉川市",
                "code": "420984"
              }
            ]
          },
          {
            "name": "仙桃",
            "code": "94"
          },
          {
            "name": "潜江",
            "code": "95"
          },
          {
            "name": "天门",
            "code": "96"
          },
          {
            "name": "神农架",
            "code": "A21"
          }
        ]
      },
      {
        "name": "湖南",
        "code": "43",
        "children": [
          {
            "name": "长沙",
            "code": "1",
            "children": [
              {
                "name": "芙蓉区",
                "code": "430102"
              },
              {
                "name": "天心区",
                "code": "430103"
              },
              {
                "name": "岳麓区",
                "code": "430104"
              },
              {
                "name": "开福区",
                "code": "430105"
              },
              {
                "name": "雨花区",
                "code": "430111"
              },
              {
                "name": "长沙县",
                "code": "430121"
              },
              {
                "name": "望城县",
                "code": "430122"
              },
              {
                "name": "宁乡县",
                "code": "430124"
              },
              {
                "name": "浏阳市",
                "code": "430181"
              }
            ]
          },
          {
            "name": "郴州",
            "code": "10",
            "children": [
              {
                "name": "北湖区",
                "code": "431002"
              },
              {
                "name": "苏仙区",
                "code": "431003"
              },
              {
                "name": "桂阳县",
                "code": "431021"
              },
              {
                "name": "宜章县",
                "code": "431022"
              },
              {
                "name": "永兴县",
                "code": "431023"
              },
              {
                "name": "嘉禾县",
                "code": "431024"
              },
              {
                "name": "临武县",
                "code": "431025"
              },
              {
                "name": "汝城县",
                "code": "431026"
              },
              {
                "name": "桂东县",
                "code": "431027"
              },
              {
                "name": "安仁县",
                "code": "431028"
              },
              {
                "name": "资兴市",
                "code": "431081"
              }
            ]
          },
          {
            "name": "永州",
            "code": "11",
            "children": [
              {
                "name": "零陵区",
                "code": "431102"
              },
              {
                "name": "冷水滩区",
                "code": "431103"
              },
              {
                "name": "祁阳县",
                "code": "431121"
              },
              {
                "name": "东安县",
                "code": "431122"
              },
              {
                "name": "双牌县",
                "code": "431123"
              },
              {
                "name": "道　县",
                "code": "431124"
              },
              {
                "name": "江永县",
                "code": "431125"
              },
              {
                "name": "宁远县",
                "code": "431126"
              },
              {
                "name": "蓝山县",
                "code": "431127"
              },
              {
                "name": "新田县",
                "code": "431128"
              },
              {
                "name": "江华瑶族自治县",
                "code": "431129"
              }
            ]
          },
          {
            "name": "怀化",
            "code": "12",
            "children": [
              {
                "name": "鹤城区",
                "code": "431202"
              },
              {
                "name": "中方县",
                "code": "431221"
              },
              {
                "name": "沅陵县",
                "code": "431222"
              },
              {
                "name": "辰溪县",
                "code": "431223"
              },
              {
                "name": "溆浦县",
                "code": "431224"
              },
              {
                "name": "会同县",
                "code": "431225"
              },
              {
                "name": "麻阳苗族自治县",
                "code": "431226"
              },
              {
                "name": "新晃侗族自治县",
                "code": "431227"
              },
              {
                "name": "芷江侗族自治县",
                "code": "431228"
              },
              {
                "name": "靖州苗族侗族自治县",
                "code": "431229"
              },
              {
                "name": "通道侗族自治县",
                "code": "431230"
              },
              {
                "name": "洪江市",
                "code": "431281"
              }
            ]
          },
          {
            "name": "娄底",
            "code": "13",
            "children": [
              {
                "name": "娄星区",
                "code": "431302"
              },
              {
                "name": "双峰县",
                "code": "431321"
              },
              {
                "name": "新化县",
                "code": "431322"
              },
              {
                "name": "冷水江市",
                "code": "431381"
              },
              {
                "name": "涟源市",
                "code": "431382"
              }
            ]
          },
          {
            "name": "株洲",
            "code": "2",
            "children": [
              {
                "name": "荷塘区",
                "code": "430202"
              },
              {
                "name": "芦淞区",
                "code": "430203"
              },
              {
                "name": "石峰区",
                "code": "430204"
              },
              {
                "name": "天元区",
                "code": "430211"
              },
              {
                "name": "株洲县",
                "code": "430221"
              },
              {
                "name": "攸　县",
                "code": "430223"
              },
              {
                "name": "茶陵县",
                "code": "430224"
              },
              {
                "name": "炎陵县",
                "code": "430225"
              },
              {
                "name": "醴陵市",
                "code": "430281"
              }
            ]
          },
          {
            "name": "湘潭",
            "code": "3",
            "children": [
              {
                "name": "雨湖区",
                "code": "430302"
              },
              {
                "name": "岳塘区",
                "code": "430304"
              },
              {
                "name": "湘潭县",
                "code": "430321"
              },
              {
                "name": "湘乡市",
                "code": "430381"
              },
              {
                "name": "韶山市",
                "code": "430382"
              }
            ]
          },
          {
            "name": "湘西",
            "code": "31",
            "children": [
              {
                "name": "吉首市",
                "code": "433101"
              },
              {
                "name": "泸溪县",
                "code": "433122"
              },
              {
                "name": "凤凰县",
                "code": "433123"
              },
              {
                "name": "花垣县",
                "code": "433124"
              },
              {
                "name": "保靖县",
                "code": "433125"
              },
              {
                "name": "古丈县",
                "code": "433126"
              },
              {
                "name": "永顺县",
                "code": "433127"
              },
              {
                "name": "龙山县",
                "code": "433130"
              }
            ]
          },
          {
            "name": "衡阳",
            "code": "4",
            "children": [
              {
                "name": "珠晖区",
                "code": "430405"
              },
              {
                "name": "雁峰区",
                "code": "430406"
              },
              {
                "name": "石鼓区",
                "code": "430407"
              },
              {
                "name": "蒸湘区",
                "code": "430408"
              },
              {
                "name": "南岳区",
                "code": "430412"
              },
              {
                "name": "衡阳县",
                "code": "430421"
              },
              {
                "name": "衡南县",
                "code": "430422"
              },
              {
                "name": "衡山县",
                "code": "430423"
              },
              {
                "name": "衡东县",
                "code": "430424"
              },
              {
                "name": "祁东县",
                "code": "430426"
              },
              {
                "name": "耒阳市",
                "code": "430481"
              },
              {
                "name": "常宁市",
                "code": "430482"
              }
            ]
          },
          {
            "name": "邵阳",
            "code": "5",
            "children": [
              {
                "name": "双清区",
                "code": "430502"
              },
              {
                "name": "大祥区",
                "code": "430503"
              },
              {
                "name": "北塔区",
                "code": "430511"
              },
              {
                "name": "邵东县",
                "code": "430521"
              },
              {
                "name": "新邵县",
                "code": "430522"
              },
              {
                "name": "邵阳县",
                "code": "430523"
              },
              {
                "name": "隆回县",
                "code": "430524"
              },
              {
                "name": "洞口县",
                "code": "430525"
              },
              {
                "name": "绥宁县",
                "code": "430527"
              },
              {
                "name": "新宁县",
                "code": "430528"
              },
              {
                "name": "城步苗族自治县",
                "code": "430529"
              },
              {
                "name": "武冈市",
                "code": "430581"
              }
            ]
          },
          {
            "name": "岳阳",
            "code": "6",
            "children": [
              {
                "name": "岳阳楼区",
                "code": "430602"
              },
              {
                "name": "云溪区",
                "code": "430603"
              },
              {
                "name": "君山区",
                "code": "430611"
              },
              {
                "name": "岳阳县",
                "code": "430621"
              },
              {
                "name": "华容县",
                "code": "430623"
              },
              {
                "name": "湘阴县",
                "code": "430624"
              },
              {
                "name": "平江县",
                "code": "430626"
              },
              {
                "name": "汨罗市",
                "code": "430681"
              },
              {
                "name": "临湘市",
                "code": "430682"
              }
            ]
          },
          {
            "name": "常德",
            "code": "7",
            "children": [
              {
                "name": "武陵区",
                "code": "430702"
              },
              {
                "name": "鼎城区",
                "code": "430703"
              },
              {
                "name": "安乡县",
                "code": "430721"
              },
              {
                "name": "汉寿县",
                "code": "430722"
              },
              {
                "name": "澧　县",
                "code": "430723"
              },
              {
                "name": "临澧县",
                "code": "430724"
              },
              {
                "name": "桃源县",
                "code": "430725"
              },
              {
                "name": "石门县",
                "code": "430726"
              },
              {
                "name": "津市市",
                "code": "430781"
              }
            ]
          },
          {
            "name": "张家界",
            "code": "8",
            "children": [
              {
                "name": "永定区",
                "code": "430802"
              },
              {
                "name": "武陵源区",
                "code": "430811"
              },
              {
                "name": "慈利县",
                "code": "430821"
              },
              {
                "name": "桑植县",
                "code": "430822"
              }
            ]
          },
          {
            "name": "益阳",
            "code": "9",
            "children": [
              {
                "name": "资阳区",
                "code": "430902"
              },
              {
                "name": "赫山区",
                "code": "430903"
              },
              {
                "name": "南　县",
                "code": "430921"
              },
              {
                "name": "桃江县",
                "code": "430922"
              },
              {
                "name": "安化县",
                "code": "430923"
              },
              {
                "name": "沅江市",
                "code": "430981"
              }
            ]
          }
        ]
      },
      {
        "name": "广东",
        "code": "44",
        "children": [
          {
            "name": "广州",
            "code": "1",
            "children": [
              {
                "name": "荔湾区",
                "code": "440103"
              },
              {
                "name": "越秀区",
                "code": "440104"
              },
              {
                "name": "海珠区",
                "code": "440105"
              },
              {
                "name": "天河区",
                "code": "440106"
              },
              {
                "name": "白云区",
                "code": "440111"
              },
              {
                "name": "黄埔区",
                "code": "440112"
              },
              {
                "name": "番禺区",
                "code": "440113"
              },
              {
                "name": "花都区",
                "code": "440114"
              },
              {
                "name": "南沙区",
                "code": "440115"
              },
              {
                "name": "萝岗区",
                "code": "440116"
              },
              {
                "name": "增城市",
                "code": "440183"
              },
              {
                "name": "从化市",
                "code": "440184"
              }
            ]
          },
          {
            "name": "肇庆",
            "code": "12",
            "children": [
              {
                "name": "端州区",
                "code": "441202"
              },
              {
                "name": "鼎湖区",
                "code": "441203"
              },
              {
                "name": "广宁县",
                "code": "441223"
              },
              {
                "name": "怀集县",
                "code": "441224"
              },
              {
                "name": "封开县",
                "code": "441225"
              },
              {
                "name": "德庆县",
                "code": "441226"
              },
              {
                "name": "高要市",
                "code": "441283"
              },
              {
                "name": "四会市",
                "code": "441284"
              }
            ]
          },
          {
            "name": "惠州",
            "code": "13",
            "children": [
              {
                "name": "惠城区",
                "code": "441302"
              },
              {
                "name": "惠阳区",
                "code": "441303"
              },
              {
                "name": "博罗县",
                "code": "441322"
              },
              {
                "name": "惠东县",
                "code": "441323"
              },
              {
                "name": "龙门县",
                "code": "441324"
              }
            ]
          },
          {
            "name": "梅州",
            "code": "14",
            "children": [
              {
                "name": "梅江区",
                "code": "441402"
              },
              {
                "name": "梅　县",
                "code": "441421"
              },
              {
                "name": "大埔县",
                "code": "441422"
              },
              {
                "name": "丰顺县",
                "code": "441423"
              },
              {
                "name": "五华县",
                "code": "441424"
              },
              {
                "name": "平远县",
                "code": "441426"
              },
              {
                "name": "蕉岭县",
                "code": "441427"
              },
              {
                "name": "兴宁市",
                "code": "441481"
              }
            ]
          },
          {
            "name": "汕尾",
            "code": "15",
            "children": [
              {
                "name": "城　区",
                "code": "441502"
              },
              {
                "name": "海丰县",
                "code": "441521"
              },
              {
                "name": "陆河县",
                "code": "441523"
              },
              {
                "name": "陆丰市",
                "code": "441581"
              }
            ]
          },
          {
            "name": "河源",
            "code": "16",
            "children": [
              {
                "name": "源城区",
                "code": "441602"
              },
              {
                "name": "紫金县",
                "code": "441621"
              },
              {
                "name": "龙川县",
                "code": "441622"
              },
              {
                "name": "连平县",
                "code": "441623"
              },
              {
                "name": "和平县",
                "code": "441624"
              },
              {
                "name": "东源县",
                "code": "441625"
              }
            ]
          },
          {
            "name": "阳江",
            "code": "17",
            "children": [
              {
                "name": "江城区",
                "code": "441702"
              },
              {
                "name": "阳西县",
                "code": "441721"
              },
              {
                "name": "阳东县",
                "code": "441723"
              },
              {
                "name": "阳春市",
                "code": "441781"
              }
            ]
          },
          {
            "name": "清远",
            "code": "18",
            "children": [
              {
                "name": "清城区",
                "code": "441802"
              },
              {
                "name": "佛冈县",
                "code": "441821"
              },
              {
                "name": "阳山县",
                "code": "441823"
              },
              {
                "name": "连山壮族瑶族自治县",
                "code": "441825"
              },
              {
                "name": "连南瑶族自治县",
                "code": "441826"
              },
              {
                "name": "清新县",
                "code": "441827"
              },
              {
                "name": "英德市",
                "code": "441881"
              },
              {
                "name": "连州市",
                "code": "441882"
              }
            ]
          },
          {
            "name": "东莞",
            "code": "19",
            "children": {
              "name": "东莞市",
              "code": "441900"
            }
          },
          {
            "name": "韶关",
            "code": "2",
            "children": [
              {
                "name": "武江区",
                "code": "440203"
              },
              {
                "name": "浈江区",
                "code": "440204"
              },
              {
                "name": "曲江区",
                "code": "440205"
              },
              {
                "name": "始兴县",
                "code": "440222"
              },
              {
                "name": "仁化县",
                "code": "440224"
              },
              {
                "name": "翁源县",
                "code": "440229"
              },
              {
                "name": "乳源瑶族自治县",
                "code": "440232"
              },
              {
                "name": "新丰县",
                "code": "440233"
              },
              {
                "name": "乐昌市",
                "code": "440281"
              },
              {
                "name": "南雄市",
                "code": "440282"
              }
            ]
          },
          {
            "name": "中山",
            "code": "20",
            "children": {
              "name": "中山市",
              "code": "442000"
            }
          },
          {
            "name": "深圳",
            "code": "3",
            "children": [
              {
                "name": "罗湖区",
                "code": "440303"
              },
              {
                "name": "福田区",
                "code": "440304"
              },
              {
                "name": "南山区",
                "code": "440305"
              },
              {
                "name": "宝安区",
                "code": "440306"
              },
              {
                "name": "龙岗区",
                "code": "440307"
              },
              {
                "name": "盐田区",
                "code": "440308"
              }
            ]
          },
          {
            "name": "珠海",
            "code": "4",
            "children": [
              {
                "name": "香洲区",
                "code": "440402"
              },
              {
                "name": "斗门区",
                "code": "440403"
              },
              {
                "name": "金湾区",
                "code": "440404"
              }
            ]
          },
          {
            "name": "汕头",
            "code": "5",
            "children": [
              {
                "name": "龙湖区",
                "code": "440507"
              },
              {
                "name": "金平区",
                "code": "440511"
              },
              {
                "name": "濠江区",
                "code": "440512"
              },
              {
                "name": "潮阳区",
                "code": "440513"
              },
              {
                "name": "潮南区",
                "code": "440514"
              },
              {
                "name": "澄海区",
                "code": "440515"
              },
              {
                "name": "南澳县",
                "code": "440523"
              }
            ]
          },
          {
            "name": "潮州",
            "code": "51",
            "children": [
              {
                "name": "湘桥区",
                "code": "445102"
              },
              {
                "name": "潮安县",
                "code": "445121"
              },
              {
                "name": "饶平县",
                "code": "445122"
              }
            ]
          },
          {
            "name": "揭阳",
            "code": "52",
            "children": [
              {
                "name": "榕城区",
                "code": "445202"
              },
              {
                "name": "揭东县",
                "code": "445221"
              },
              {
                "name": "揭西县",
                "code": "445222"
              },
              {
                "name": "惠来县",
                "code": "445224"
              },
              {
                "name": "普宁市",
                "code": "445281"
              }
            ]
          },
          {
            "name": "云浮",
            "code": "53",
            "children": [
              {
                "name": "云城区",
                "code": "445302"
              },
              {
                "name": "新兴县",
                "code": "445321"
              },
              {
                "name": "郁南县",
                "code": "445322"
              },
              {
                "name": "云安县",
                "code": "445323"
              },
              {
                "name": "罗定市",
                "code": "445381"
              }
            ]
          },
          {
            "name": "佛山",
            "code": "6",
            "children": [
              {
                "name": "禅城区",
                "code": "440604"
              },
              {
                "name": "南海区",
                "code": "440605"
              },
              {
                "name": "顺德区",
                "code": "440606"
              },
              {
                "name": "三水区",
                "code": "440607"
              },
              {
                "name": "高明区",
                "code": "440608"
              }
            ]
          },
          {
            "name": "江门",
            "code": "7",
            "children": [
              {
                "name": "蓬江区",
                "code": "440703"
              },
              {
                "name": "江海区",
                "code": "440704"
              },
              {
                "name": "新会区",
                "code": "440705"
              },
              {
                "name": "台山市",
                "code": "440781"
              },
              {
                "name": "开平市",
                "code": "440783"
              },
              {
                "name": "鹤山市",
                "code": "440784"
              },
              {
                "name": "恩平市",
                "code": "440785"
              }
            ]
          },
          {
            "name": "湛江",
            "code": "8",
            "children": [
              {
                "name": "赤坎区",
                "code": "440802"
              },
              {
                "name": "霞山区",
                "code": "440803"
              },
              {
                "name": "坡头区",
                "code": "440804"
              },
              {
                "name": "麻章区",
                "code": "440811"
              },
              {
                "name": "遂溪县",
                "code": "440823"
              },
              {
                "name": "徐闻县",
                "code": "440825"
              },
              {
                "name": "廉江市",
                "code": "440881"
              },
              {
                "name": "雷州市",
                "code": "440882"
              },
              {
                "name": "吴川市",
                "code": "440883"
              }
            ]
          },
          {
            "name": "茂名",
            "code": "9",
            "children": [
              {
                "name": "茂南区",
                "code": "440902"
              },
              {
                "name": "茂港区",
                "code": "440903"
              },
              {
                "name": "电白县",
                "code": "440923"
              },
              {
                "name": "高州市",
                "code": "440981"
              },
              {
                "name": "化州市",
                "code": "440982"
              },
              {
                "name": "信宜市",
                "code": "440983"
              }
            ]
          }
        ]
      },
      {
        "name": "广西",
        "code": "45",
        "children": [
          {
            "name": "南宁",
            "code": "1",
            "children": [
              {
                "name": "兴宁区",
                "code": "450102"
              },
              {
                "name": "青秀区",
                "code": "450103"
              },
              {
                "name": "江南区",
                "code": "450105"
              },
              {
                "name": "西乡塘区",
                "code": "450107"
              },
              {
                "name": "良庆区",
                "code": "450108"
              },
              {
                "name": "邕宁区",
                "code": "450109"
              },
              {
                "name": "武鸣县",
                "code": "450122"
              },
              {
                "name": "隆安县",
                "code": "450123"
              },
              {
                "name": "马山县",
                "code": "450124"
              },
              {
                "name": "上林县",
                "code": "450125"
              },
              {
                "name": "宾阳县",
                "code": "450126"
              },
              {
                "name": "横　县",
                "code": "450127"
              }
            ]
          },
          {
            "name": "百色",
            "code": "10",
            "children": [
              {
                "name": "右江区",
                "code": "451002"
              },
              {
                "name": "田阳县",
                "code": "451021"
              },
              {
                "name": "田东县",
                "code": "451022"
              },
              {
                "name": "平果县",
                "code": "451023"
              },
              {
                "name": "德保县",
                "code": "451024"
              },
              {
                "name": "靖西县",
                "code": "451025"
              },
              {
                "name": "那坡县",
                "code": "451026"
              },
              {
                "name": "凌云县",
                "code": "451027"
              },
              {
                "name": "乐业县",
                "code": "451028"
              },
              {
                "name": "田林县",
                "code": "451029"
              },
              {
                "name": "西林县",
                "code": "451030"
              },
              {
                "name": "隆林各族自治县",
                "code": "451031"
              }
            ]
          },
          {
            "name": "贺州",
            "code": "11",
            "children": [
              {
                "name": "八步区",
                "code": "451102"
              },
              {
                "name": "昭平县",
                "code": "451121"
              },
              {
                "name": "钟山县",
                "code": "451122"
              },
              {
                "name": "富川瑶族自治县",
                "code": "451123"
              }
            ]
          },
          {
            "name": "河池",
            "code": "12",
            "children": [
              {
                "name": "金城江区",
                "code": "451202"
              },
              {
                "name": "南丹县",
                "code": "451221"
              },
              {
                "name": "天峨县",
                "code": "451222"
              },
              {
                "name": "凤山县",
                "code": "451223"
              },
              {
                "name": "东兰县",
                "code": "451224"
              },
              {
                "name": "罗城仫佬族自治县",
                "code": "451225"
              },
              {
                "name": "环江毛南族自治县",
                "code": "451226"
              },
              {
                "name": "巴马瑶族自治县",
                "code": "451227"
              },
              {
                "name": "都安瑶族自治县",
                "code": "451228"
              },
              {
                "name": "大化瑶族自治县",
                "code": "451229"
              },
              {
                "name": "宜州市",
                "code": "451281"
              }
            ]
          },
          {
            "name": "来宾",
            "code": "13",
            "children": [
              {
                "name": "兴宾区",
                "code": "451302"
              },
              {
                "name": "忻城县",
                "code": "451321"
              },
              {
                "name": "象州县",
                "code": "451322"
              },
              {
                "name": "武宣县",
                "code": "451323"
              },
              {
                "name": "金秀瑶族自治县",
                "code": "451324"
              },
              {
                "name": "合山市",
                "code": "451381"
              }
            ]
          },
          {
            "name": "崇左",
            "code": "14",
            "children": [
              {
                "name": "江洲区",
                "code": "451402"
              },
              {
                "name": "扶绥县",
                "code": "451421"
              },
              {
                "name": "宁明县",
                "code": "451422"
              },
              {
                "name": "龙州县",
                "code": "451423"
              },
              {
                "name": "大新县",
                "code": "451424"
              },
              {
                "name": "天等县",
                "code": "451425"
              },
              {
                "name": "凭祥市",
                "code": "451481"
              }
            ]
          },
          {
            "name": "柳州",
            "code": "2",
            "children": [
              {
                "name": "城中区",
                "code": "450202"
              },
              {
                "name": "鱼峰区",
                "code": "450203"
              },
              {
                "name": "柳南区",
                "code": "450204"
              },
              {
                "name": "柳北区",
                "code": "450205"
              },
              {
                "name": "柳江县",
                "code": "450221"
              },
              {
                "name": "柳城县",
                "code": "450222"
              },
              {
                "name": "鹿寨县",
                "code": "450223"
              },
              {
                "name": "融安县",
                "code": "450224"
              },
              {
                "name": "融水苗族自治县",
                "code": "450225"
              },
              {
                "name": "三江侗族自治县",
                "code": "450226"
              }
            ]
          },
          {
            "name": "桂林",
            "code": "3",
            "children": [
              {
                "name": "秀峰区",
                "code": "450302"
              },
              {
                "name": "叠彩区",
                "code": "450303"
              },
              {
                "name": "象山区",
                "code": "450304"
              },
              {
                "name": "七星区",
                "code": "450305"
              },
              {
                "name": "雁山区",
                "code": "450311"
              },
              {
                "name": "阳朔县",
                "code": "450321"
              },
              {
                "name": "临桂县",
                "code": "450322"
              },
              {
                "name": "灵川县",
                "code": "450323"
              },
              {
                "name": "全州县",
                "code": "450324"
              },
              {
                "name": "兴安县",
                "code": "450325"
              },
              {
                "name": "永福县",
                "code": "450326"
              },
              {
                "name": "灌阳县",
                "code": "450327"
              },
              {
                "name": "龙胜各族自治县",
                "code": "450328"
              },
              {
                "name": "资源县",
                "code": "450329"
              },
              {
                "name": "平乐县",
                "code": "450330"
              },
              {
                "name": "荔蒲县",
                "code": "450331"
              },
              {
                "name": "恭城瑶族自治县",
                "code": "450332"
              }
            ]
          },
          {
            "name": "梧州",
            "code": "4",
            "children": [
              {
                "name": "万秀区",
                "code": "450403"
              },
              {
                "name": "蝶山区",
                "code": "450404"
              },
              {
                "name": "长洲区",
                "code": "450405"
              },
              {
                "name": "苍梧县",
                "code": "450421"
              },
              {
                "name": "藤　县",
                "code": "450422"
              },
              {
                "name": "蒙山县",
                "code": "450423"
              },
              {
                "name": "岑溪市",
                "code": "450481"
              }
            ]
          },
          {
            "name": "北海",
            "code": "5",
            "children": [
              {
                "name": "海城区",
                "code": "450502"
              },
              {
                "name": "银海区",
                "code": "450503"
              },
              {
                "name": "铁山港区",
                "code": "450512"
              },
              {
                "name": "合浦县",
                "code": "450521"
              }
            ]
          },
          {
            "name": "防城港",
            "code": "6",
            "children": [
              {
                "name": "港口区",
                "code": "450602"
              },
              {
                "name": "防城区",
                "code": "450603"
              },
              {
                "name": "上思县",
                "code": "450621"
              },
              {
                "name": "东兴市",
                "code": "450681"
              }
            ]
          },
          {
            "name": "钦州",
            "code": "7",
            "children": [
              {
                "name": "钦南区",
                "code": "450702"
              },
              {
                "name": "钦北区",
                "code": "450703"
              },
              {
                "name": "灵山县",
                "code": "450721"
              },
              {
                "name": "浦北县",
                "code": "450722"
              }
            ]
          },
          {
            "name": "贵港",
            "code": "8",
            "children": [
              {
                "name": "港北区",
                "code": "450802"
              },
              {
                "name": "港南区",
                "code": "450803"
              },
              {
                "name": "覃塘区",
                "code": "450804"
              },
              {
                "name": "平南县",
                "code": "450821"
              },
              {
                "name": "桂平市",
                "code": "450881"
              }
            ]
          },
          {
            "name": "玉林",
            "code": "9",
            "children": [
              {
                "name": "玉州区",
                "code": "450902"
              },
              {
                "name": "容　县",
                "code": "450921"
              },
              {
                "name": "陆川县",
                "code": "450922"
              },
              {
                "name": "博白县",
                "code": "450923"
              },
              {
                "name": "兴业县",
                "code": "450924"
              },
              {
                "name": "北流市",
                "code": "450981"
              }
            ]
          }
        ]
      },
      {
        "name": "海南",
        "code": "46",
        "children": [
          {
            "name": "海口",
            "code": "1",
            "children": [
              {
                "name": "秀英区",
                "code": "460105"
              },
              {
                "name": "龙华区",
                "code": "460106"
              },
              {
                "name": "琼山区",
                "code": "460107"
              },
              {
                "name": "美兰区",
                "code": "460108"
              }
            ]
          },
          {
            "name": "三亚",
            "code": "2"
          },
          {
            "name": "五指山",
            "code": "91"
          },
          {
            "name": "琼海",
            "code": "92"
          },
          {
            "name": "儋州",
            "code": "93"
          },
          {
            "name": "文昌",
            "code": "95"
          },
          {
            "name": "万宁",
            "code": "96"
          },
          {
            "name": "东方",
            "code": "97"
          },
          {
            "name": "定安",
            "code": "A25"
          },
          {
            "name": "屯昌",
            "code": "A26"
          },
          {
            "name": "澄迈",
            "code": "A27"
          },
          {
            "name": "临高",
            "code": "A28"
          },
          {
            "name": "白沙",
            "code": "A30"
          },
          {
            "name": "昌江",
            "code": "A31"
          },
          {
            "name": "乐东",
            "code": "A33"
          },
          {
            "name": "陵水",
            "code": "A34"
          },
          {
            "name": "保亭",
            "code": "A35"
          },
          {
            "name": "琼中",
            "code": "A36"
          },
          {
            "name": "西沙",
            "code": "A37"
          },
          {
            "name": "南沙",
            "code": "A38"
          },
          {
            "name": "中沙",
            "code": "A39"
          }
        ]
      },
      {
        "name": "重庆",
        "code": "50",
        "children": [
          {
            "name": "万州",
            "code": "1"
          },
          {
            "name": "万盛",
            "code": "10"
          },
          {
            "name": "双桥",
            "code": "11"
          },
          {
            "name": "渝北",
            "code": "12"
          },
          {
            "name": "巴南",
            "code": "13"
          },
          {
            "name": "涪陵",
            "code": "2"
          },
          {
            "name": "长寿",
            "code": "21"
          },
          {
            "name": "綦江",
            "code": "22"
          },
          {
            "name": "潼南",
            "code": "23"
          },
          {
            "name": "铜梁",
            "code": "24"
          },
          {
            "name": "大足",
            "code": "25"
          },
          {
            "name": "荣昌",
            "code": "26"
          },
          {
            "name": "璧山",
            "code": "27"
          },
          {
            "name": "梁平",
            "code": "28"
          },
          {
            "name": "城口",
            "code": "29"
          },
          {
            "name": "渝中",
            "code": "3"
          },
          {
            "name": "丰都",
            "code": "30"
          },
          {
            "name": "垫江",
            "code": "31"
          },
          {
            "name": "武隆",
            "code": "32"
          },
          {
            "name": "忠县",
            "code": "33"
          },
          {
            "name": "开县",
            "code": "34"
          },
          {
            "name": "云阳",
            "code": "35"
          },
          {
            "name": "奉节",
            "code": "36"
          },
          {
            "name": "巫山",
            "code": "37"
          },
          {
            "name": "巫溪",
            "code": "38"
          },
          {
            "name": "黔江",
            "code": "39"
          },
          {
            "name": "大渡口",
            "code": "4"
          },
          {
            "name": "石柱",
            "code": "40"
          },
          {
            "name": "秀山",
            "code": "41"
          },
          {
            "name": "酉阳",
            "code": "42"
          },
          {
            "name": "彭水",
            "code": "43"
          },
          {
            "name": "江北",
            "code": "5"
          },
          {
            "name": "沙坪坝",
            "code": "6"
          },
          {
            "name": "九龙坡",
            "code": "7"
          },
          {
            "name": "南岸",
            "code": "8"
          },
          {
            "name": "江津",
            "code": "81"
          },
          {
            "name": "合川",
            "code": "82"
          },
          {
            "name": "永川",
            "code": "83"
          },
          {
            "name": "南川",
            "code": "84"
          },
          {
            "name": "北碚",
            "code": "9"
          },
          {
            "name": "两江新区",
            "code": "85"
          }
        ]
      },
      {
        "name": "四川",
        "code": "51",
        "children": [
          {
            "name": "成都",
            "code": "1",
            "children": [
              {
                "name": "锦江区",
                "code": "510104"
              },
              {
                "name": "青羊区",
                "code": "510105"
              },
              {
                "name": "金牛区",
                "code": "510106"
              },
              {
                "name": "武侯区",
                "code": "510107"
              },
              {
                "name": "成华区",
                "code": "510108"
              },
              {
                "name": "龙泉驿区",
                "code": "510112"
              },
              {
                "name": "青白江区",
                "code": "510113"
              },
              {
                "name": "新都区",
                "code": "510114"
              },
              {
                "name": "温江区",
                "code": "510115"
              },
              {
                "name": "金堂县",
                "code": "510121"
              },
              {
                "name": "双流县",
                "code": "510122"
              },
              {
                "name": "郫　县",
                "code": "510124"
              },
              {
                "name": "大邑县",
                "code": "510129"
              },
              {
                "name": "蒲江县",
                "code": "510131"
              },
              {
                "name": "新津县",
                "code": "510132"
              },
              {
                "name": "都江堰市",
                "code": "510181"
              },
              {
                "name": "彭州市",
                "code": "510182"
              },
              {
                "name": "邛崃市",
                "code": "510183"
              },
              {
                "name": "崇州市",
                "code": "510184"
              }
            ]
          },
          {
            "name": "内江",
            "code": "10",
            "children": [
              {
                "name": "市中区",
                "code": "511002"
              },
              {
                "name": "东兴区",
                "code": "511011"
              },
              {
                "name": "威远县",
                "code": "511024"
              },
              {
                "name": "资中县",
                "code": "511025"
              },
              {
                "name": "隆昌县",
                "code": "511028"
              }
            ]
          },
          {
            "name": "乐山",
            "code": "11",
            "children": [
              {
                "name": "市中区",
                "code": "511102"
              },
              {
                "name": "沙湾区",
                "code": "511111"
              },
              {
                "name": "五通桥区",
                "code": "511112"
              },
              {
                "name": "金口河区",
                "code": "511113"
              },
              {
                "name": "犍为县",
                "code": "511123"
              },
              {
                "name": "井研县",
                "code": "511124"
              },
              {
                "name": "夹江县",
                "code": "511126"
              },
              {
                "name": "沐川县",
                "code": "511129"
              },
              {
                "name": "峨边彝族自治县",
                "code": "511132"
              },
              {
                "name": "马边彝族自治县",
                "code": "511133"
              },
              {
                "name": "峨眉山市",
                "code": "511181"
              }
            ]
          },
          {
            "name": "南充",
            "code": "13",
            "children": [
              {
                "name": "顺庆区",
                "code": "511302"
              },
              {
                "name": "高坪区",
                "code": "511303"
              },
              {
                "name": "嘉陵区",
                "code": "511304"
              },
              {
                "name": "南部县",
                "code": "511321"
              },
              {
                "name": "营山县",
                "code": "511322"
              },
              {
                "name": "蓬安县",
                "code": "511323"
              },
              {
                "name": "仪陇县",
                "code": "511324"
              },
              {
                "name": "西充县",
                "code": "511325"
              },
              {
                "name": "阆中市",
                "code": "511381"
              }
            ]
          },
          {
            "name": "眉山",
            "code": "14",
            "children": [
              {
                "name": "东坡区",
                "code": "511402"
              },
              {
                "name": "仁寿县",
                "code": "511421"
              },
              {
                "name": "彭山县",
                "code": "511422"
              },
              {
                "name": "洪雅县",
                "code": "511423"
              },
              {
                "name": "丹棱县",
                "code": "511424"
              },
              {
                "name": "青神县",
                "code": "511425"
              }
            ]
          },
          {
            "name": "宜宾",
            "code": "15",
            "children": [
              {
                "name": "翠屏区",
                "code": "511502"
              },
              {
                "name": "宜宾县",
                "code": "511521"
              },
              {
                "name": "南溪县",
                "code": "511522"
              },
              {
                "name": "江安县",
                "code": "511523"
              },
              {
                "name": "长宁县",
                "code": "511524"
              },
              {
                "name": "高　县",
                "code": "511525"
              },
              {
                "name": "珙　县",
                "code": "511526"
              },
              {
                "name": "筠连县",
                "code": "511527"
              },
              {
                "name": "兴文县",
                "code": "511528"
              },
              {
                "name": "屏山县",
                "code": "511529"
              }
            ]
          },
          {
            "name": "广安",
            "code": "16",
            "children": [
              {
                "name": "广安区",
                "code": "511602"
              },
              {
                "name": "岳池县",
                "code": "511621"
              },
              {
                "name": "武胜县",
                "code": "511622"
              },
              {
                "name": "邻水县",
                "code": "511623"
              },
              {
                "name": "华蓥市",
                "code": "511681"
              }
            ]
          },
          {
            "name": "达州",
            "code": "17",
            "children": [
              {
                "name": "通川区",
                "code": "511702"
              },
              {
                "name": "达　县",
                "code": "511721"
              },
              {
                "name": "宣汉县",
                "code": "511722"
              },
              {
                "name": "开江县",
                "code": "511723"
              },
              {
                "name": "大竹县",
                "code": "511724"
              },
              {
                "name": "渠　县",
                "code": "511725"
              },
              {
                "name": "万源市",
                "code": "511781"
              }
            ]
          },
          {
            "name": "雅安",
            "code": "18",
            "children": [
              {
                "name": "雨城区",
                "code": "511802"
              },
              {
                "name": "名山县",
                "code": "511821"
              },
              {
                "name": "荥经县",
                "code": "511822"
              },
              {
                "name": "汉源县",
                "code": "511823"
              },
              {
                "name": "石棉县",
                "code": "511824"
              },
              {
                "name": "天全县",
                "code": "511825"
              },
              {
                "name": "芦山县",
                "code": "511826"
              },
              {
                "name": "宝兴县",
                "code": "511827"
              }
            ]
          },
          {
            "name": "巴中",
            "code": "19",
            "children": [
              {
                "name": "巴州区",
                "code": "511902"
              },
              {
                "name": "通江县",
                "code": "511921"
              },
              {
                "name": "南江县",
                "code": "511922"
              },
              {
                "name": "平昌县",
                "code": "511923"
              }
            ]
          },
          {
            "name": "资阳",
            "code": "20",
            "children": [
              {
                "name": "雁江区",
                "code": "512002"
              },
              {
                "name": "安岳县",
                "code": "512021"
              },
              {
                "name": "乐至县",
                "code": "512022"
              },
              {
                "name": "简阳市",
                "code": "512081"
              }
            ]
          },
          {
            "name": "自贡",
            "code": "3",
            "children": [
              {
                "name": "自流井区",
                "code": "510302"
              },
              {
                "name": "贡井区",
                "code": "510303"
              },
              {
                "name": "大安区",
                "code": "510304"
              },
              {
                "name": "沿滩区",
                "code": "510311"
              },
              {
                "name": "荣　县",
                "code": "510321"
              },
              {
                "name": "富顺县",
                "code": "510322"
              }
            ]
          },
          {
            "name": "阿坝",
            "code": "32",
            "children": [
              {
                "name": "汶川县",
                "code": "513221"
              },
              {
                "name": "理　县",
                "code": "513222"
              },
              {
                "name": "茂　县",
                "code": "513223"
              },
              {
                "name": "松潘县",
                "code": "513224"
              },
              {
                "name": "九寨沟县",
                "code": "513225"
              },
              {
                "name": "金川县",
                "code": "513226"
              },
              {
                "name": "小金县",
                "code": "513227"
              },
              {
                "name": "黑水县",
                "code": "513228"
              },
              {
                "name": "马尔康县",
                "code": "513229"
              },
              {
                "name": "壤塘县",
                "code": "513230"
              },
              {
                "name": "阿坝县",
                "code": "513231"
              },
              {
                "name": "若尔盖县",
                "code": "513232"
              },
              {
                "name": "红原县",
                "code": "513233"
              }
            ]
          },
          {
            "name": "甘孜",
            "code": "33",
            "children": [
              {
                "name": "康定县",
                "code": "513321"
              },
              {
                "name": "泸定县",
                "code": "513322"
              },
              {
                "name": "丹巴县",
                "code": "513323"
              },
              {
                "name": "九龙县",
                "code": "513324"
              },
              {
                "name": "雅江县",
                "code": "513325"
              },
              {
                "name": "道孚县",
                "code": "513326"
              },
              {
                "name": "炉霍县",
                "code": "513327"
              },
              {
                "name": "甘孜县",
                "code": "513328"
              },
              {
                "name": "新龙县",
                "code": "513329"
              },
              {
                "name": "德格县",
                "code": "513330"
              },
              {
                "name": "白玉县",
                "code": "513331"
              },
              {
                "name": "石渠县",
                "code": "513332"
              },
              {
                "name": "色达县",
                "code": "513333"
              },
              {
                "name": "理塘县",
                "code": "513334"
              },
              {
                "name": "巴塘县",
                "code": "513335"
              },
              {
                "name": "乡城县",
                "code": "513336"
              },
              {
                "name": "稻城县",
                "code": "513337"
              },
              {
                "name": "得荣县",
                "code": "513338"
              }
            ]
          },
          {
            "name": "凉山",
            "code": "34",
            "children": [
              {
                "name": "西昌市",
                "code": "513401"
              },
              {
                "name": "木里藏族自治县",
                "code": "513422"
              },
              {
                "name": "盐源县",
                "code": "513423"
              },
              {
                "name": "德昌县",
                "code": "513424"
              },
              {
                "name": "会理县",
                "code": "513425"
              },
              {
                "name": "会东县",
                "code": "513426"
              },
              {
                "name": "宁南县",
                "code": "513427"
              },
              {
                "name": "普格县",
                "code": "513428"
              },
              {
                "name": "布拖县",
                "code": "513429"
              },
              {
                "name": "金阳县",
                "code": "513430"
              },
              {
                "name": "昭觉县",
                "code": "513431"
              },
              {
                "name": "喜德县",
                "code": "513432"
              },
              {
                "name": "冕宁县",
                "code": "513433"
              },
              {
                "name": "越西县",
                "code": "513434"
              },
              {
                "name": "甘洛县",
                "code": "513435"
              },
              {
                "name": "美姑县",
                "code": "513436"
              },
              {
                "name": "雷波县",
                "code": "513437"
              }
            ]
          },
          {
            "name": "攀枝花",
            "code": "4",
            "children": [
              {
                "name": "东　区",
                "code": "510402"
              },
              {
                "name": "西　区",
                "code": "510403"
              },
              {
                "name": "仁和区",
                "code": "510411"
              },
              {
                "name": "米易县",
                "code": "510421"
              },
              {
                "name": "盐边县",
                "code": "510422"
              }
            ]
          },
          {
            "name": "泸州",
            "code": "5",
            "children": [
              {
                "name": "江阳区",
                "code": "510502"
              },
              {
                "name": "纳溪区",
                "code": "510503"
              },
              {
                "name": "龙马潭区",
                "code": "510504"
              },
              {
                "name": "泸　县",
                "code": "510521"
              },
              {
                "name": "合江县",
                "code": "510522"
              },
              {
                "name": "叙永县",
                "code": "510524"
              },
              {
                "name": "古蔺县",
                "code": "510525"
              }
            ]
          },
          {
            "name": "德阳",
            "code": "6",
            "children": [
              {
                "name": "旌阳区",
                "code": "510603"
              },
              {
                "name": "中江县",
                "code": "510623"
              },
              {
                "name": "罗江县",
                "code": "510626"
              },
              {
                "name": "广汉市",
                "code": "510681"
              },
              {
                "name": "什邡市",
                "code": "510682"
              },
              {
                "name": "绵竹市",
                "code": "510683"
              }
            ]
          },
          {
            "name": "绵阳",
            "code": "7",
            "children": [
              {
                "name": "涪城区",
                "code": "510703"
              },
              {
                "name": "游仙区",
                "code": "510704"
              },
              {
                "name": "三台县",
                "code": "510722"
              },
              {
                "name": "盐亭县",
                "code": "510723"
              },
              {
                "name": "安　县",
                "code": "510724"
              },
              {
                "name": "梓潼县",
                "code": "510725"
              },
              {
                "name": "北川羌族自治县",
                "code": "510726"
              },
              {
                "name": "平武县",
                "code": "510727"
              },
              {
                "name": "江油市",
                "code": "510781"
              }
            ]
          },
          {
            "name": "广元",
            "code": "8",
            "children": [
              {
                "name": "市中区",
                "code": "510802"
              },
              {
                "name": "元坝区",
                "code": "510811"
              },
              {
                "name": "朝天区",
                "code": "510812"
              },
              {
                "name": "旺苍县",
                "code": "510821"
              },
              {
                "name": "青川县",
                "code": "510822"
              },
              {
                "name": "剑阁县",
                "code": "510823"
              },
              {
                "name": "苍溪县",
                "code": "510824"
              }
            ]
          },
          {
            "name": "遂宁",
            "code": "9",
            "children": [
              {
                "name": "船山区",
                "code": "510903"
              },
              {
                "name": "安居区",
                "code": "510904"
              },
              {
                "name": "蓬溪县",
                "code": "510921"
              },
              {
                "name": "射洪县",
                "code": "510922"
              },
              {
                "name": "大英县",
                "code": "510923"
              }
            ]
          }
        ]
      },
      {
        "name": "贵州",
        "code": "52",
        "children": [
          {
            "name": "贵阳",
            "code": "1",
            "children": [
              {
                "name": "南明区",
                "code": "520102"
              },
              {
                "name": "云岩区",
                "code": "520103"
              },
              {
                "name": "花溪区",
                "code": "520111"
              },
              {
                "name": "乌当区",
                "code": "520112"
              },
              {
                "name": "白云区",
                "code": "520113"
              },
              {
                "name": "小河区",
                "code": "520114"
              },
              {
                "name": "开阳县",
                "code": "520121"
              },
              {
                "name": "息烽县",
                "code": "520122"
              },
              {
                "name": "修文县",
                "code": "520123"
              },
              {
                "name": "清镇市",
                "code": "520181"
              }
            ]
          },
          {
            "name": "六盘水",
            "code": "2",
            "children": [
              {
                "name": "钟山区",
                "code": "520201"
              },
              {
                "name": "六枝特区",
                "code": "520203"
              },
              {
                "name": "水城县",
                "code": "520221"
              },
              {
                "name": "盘　县",
                "code": "520222"
              }
            ]
          },
          {
            "name": "铜仁",
            "code": "22",
            "children": [
              {
                "name": "铜仁市",
                "code": "522201"
              },
              {
                "name": "江口县",
                "code": "522222"
              },
              {
                "name": "玉屏侗族自治县",
                "code": "522223"
              },
              {
                "name": "石阡县",
                "code": "522224"
              },
              {
                "name": "思南县",
                "code": "522225"
              },
              {
                "name": "印江土家族苗族自治县",
                "code": "522226"
              },
              {
                "name": "德江县",
                "code": "522227"
              },
              {
                "name": "沿河土家族自治县",
                "code": "522228"
              },
              {
                "name": "松桃苗族自治县",
                "code": "522229"
              },
              {
                "name": "万山特区",
                "code": "522230"
              }
            ]
          },
          {
            "name": "黔西南",
            "code": "23",
            "children": [
              {
                "name": "兴义市",
                "code": "522301"
              },
              {
                "name": "兴仁县",
                "code": "522322"
              },
              {
                "name": "普安县",
                "code": "522323"
              },
              {
                "name": "晴隆县",
                "code": "522324"
              },
              {
                "name": "贞丰县",
                "code": "522325"
              },
              {
                "name": "望谟县",
                "code": "522326"
              },
              {
                "name": "册亨县",
                "code": "522327"
              },
              {
                "name": "安龙县",
                "code": "522328"
              }
            ]
          },
          {
            "name": "毕节",
            "code": "24",
            "children": [
              {
                "name": "毕节市",
                "code": "522401"
              },
              {
                "name": "大方县",
                "code": "522422"
              },
              {
                "name": "黔西县",
                "code": "522423"
              },
              {
                "name": "金沙县",
                "code": "522424"
              },
              {
                "name": "织金县",
                "code": "522425"
              },
              {
                "name": "纳雍县",
                "code": "522426"
              },
              {
                "name": "威宁彝族回族苗族自治县",
                "code": "522427"
              },
              {
                "name": "赫章县",
                "code": "522428"
              }
            ]
          },
          {
            "name": "黔东南",
            "code": "26",
            "children": [
              {
                "name": "凯里市",
                "code": "522601"
              },
              {
                "name": "黄平县",
                "code": "522622"
              },
              {
                "name": "施秉县",
                "code": "522623"
              },
              {
                "name": "三穗县",
                "code": "522624"
              },
              {
                "name": "镇远县",
                "code": "522625"
              },
              {
                "name": "岑巩县",
                "code": "522626"
              },
              {
                "name": "天柱县",
                "code": "522627"
              },
              {
                "name": "锦屏县",
                "code": "522628"
              },
              {
                "name": "剑河县",
                "code": "522629"
              },
              {
                "name": "台江县",
                "code": "522630"
              },
              {
                "name": "黎平县",
                "code": "522631"
              },
              {
                "name": "榕江县",
                "code": "522632"
              },
              {
                "name": "从江县",
                "code": "522633"
              },
              {
                "name": "雷山县",
                "code": "522634"
              },
              {
                "name": "麻江县",
                "code": "522635"
              },
              {
                "name": "丹寨县",
                "code": "522636"
              }
            ]
          },
          {
            "name": "黔南",
            "code": "27",
            "children": [
              {
                "name": "都匀市",
                "code": "522701"
              },
              {
                "name": "福泉市",
                "code": "522702"
              },
              {
                "name": "荔波县",
                "code": "522722"
              },
              {
                "name": "贵定县",
                "code": "522723"
              },
              {
                "name": "瓮安县",
                "code": "522725"
              },
              {
                "name": "独山县",
                "code": "522726"
              },
              {
                "name": "平塘县",
                "code": "522727"
              },
              {
                "name": "罗甸县",
                "code": "522728"
              },
              {
                "name": "长顺县",
                "code": "522729"
              },
              {
                "name": "龙里县",
                "code": "522730"
              },
              {
                "name": "惠水县",
                "code": "522731"
              },
              {
                "name": "三都水族自治县",
                "code": "522732"
              }
            ]
          },
          {
            "name": "遵义",
            "code": "3",
            "children": [
              {
                "name": "红花岗区",
                "code": "520302"
              },
              {
                "name": "汇川区",
                "code": "520303"
              },
              {
                "name": "遵义县",
                "code": "520321"
              },
              {
                "name": "桐梓县",
                "code": "520322"
              },
              {
                "name": "绥阳县",
                "code": "520323"
              },
              {
                "name": "正安县",
                "code": "520324"
              },
              {
                "name": "道真仡佬族苗族自治县",
                "code": "520325"
              },
              {
                "name": "务川仡佬族苗族自治县",
                "code": "520326"
              },
              {
                "name": "凤冈县",
                "code": "520327"
              },
              {
                "name": "湄潭县",
                "code": "520328"
              },
              {
                "name": "余庆县",
                "code": "520329"
              },
              {
                "name": "习水县",
                "code": "520330"
              },
              {
                "name": "赤水市",
                "code": "520381"
              },
              {
                "name": "仁怀市",
                "code": "520382"
              }
            ]
          },
          {
            "name": "安顺",
            "code": "4",
            "children": [
              {
                "name": "西秀区",
                "code": "520402"
              },
              {
                "name": "平坝县",
                "code": "520421"
              },
              {
                "name": "普定县",
                "code": "520422"
              },
              {
                "name": "镇宁布依族苗族自治县",
                "code": "520423"
              },
              {
                "name": "关岭布依族苗族自治县",
                "code": "520424"
              },
              {
                "name": "紫云苗族布依族自治县",
                "code": "520425"
              }
            ]
          }
        ]
      },
      {
        "name": "云南",
        "code": "53",
        "children": [
          {
            "name": "昆明",
            "code": "1",
            "children": [
              {
                "name": "五华区",
                "code": "530102"
              },
              {
                "name": "盘龙区",
                "code": "530103"
              },
              {
                "name": "官渡区",
                "code": "530111"
              },
              {
                "name": "西山区",
                "code": "530112"
              },
              {
                "name": "东川区",
                "code": "530113"
              },
              {
                "name": "呈贡县",
                "code": "530121"
              },
              {
                "name": "晋宁县",
                "code": "530122"
              },
              {
                "name": "富民县",
                "code": "530124"
              },
              {
                "name": "宜良县",
                "code": "530125"
              },
              {
                "name": "石林彝族自治县",
                "code": "530126"
              },
              {
                "name": "嵩明县",
                "code": "530127"
              },
              {
                "name": "禄劝彝族苗族自治县",
                "code": "530128"
              },
              {
                "name": "寻甸回族彝族自治县",
                "code": "530129"
              },
              {
                "name": "安宁市",
                "code": "530181"
              }
            ]
          },
          {
            "name": "楚雄",
            "code": "23",
            "children": [
              {
                "name": "楚雄市",
                "code": "532301"
              },
              {
                "name": "双柏县",
                "code": "532322"
              },
              {
                "name": "牟定县",
                "code": "532323"
              },
              {
                "name": "南华县",
                "code": "532324"
              },
              {
                "name": "姚安县",
                "code": "532325"
              },
              {
                "name": "大姚县",
                "code": "532326"
              },
              {
                "name": "永仁县",
                "code": "532327"
              },
              {
                "name": "元谋县",
                "code": "532328"
              },
              {
                "name": "武定县",
                "code": "532329"
              },
              {
                "name": "禄丰县",
                "code": "532331"
              }
            ]
          },
          {
            "name": "红河",
            "code": "25",
            "children": [
              {
                "name": "个旧市",
                "code": "532501"
              },
              {
                "name": "开远市",
                "code": "532502"
              },
              {
                "name": "蒙自县",
                "code": "532522"
              },
              {
                "name": "屏边苗族自治县",
                "code": "532523"
              },
              {
                "name": "建水县",
                "code": "532524"
              },
              {
                "name": "石屏县",
                "code": "532525"
              },
              {
                "name": "弥勒县",
                "code": "532526"
              },
              {
                "name": "泸西县",
                "code": "532527"
              },
              {
                "name": "元阳县",
                "code": "532528"
              },
              {
                "name": "红河县",
                "code": "532529"
              },
              {
                "name": "金平苗族瑶族傣族自治县",
                "code": "532530"
              },
              {
                "name": "绿春县",
                "code": "532531"
              },
              {
                "name": "河口瑶族自治县",
                "code": "532532"
              }
            ]
          },
          {
            "name": "文山",
            "code": "26",
            "children": [
              {
                "name": "文山县",
                "code": "532621"
              },
              {
                "name": "砚山县",
                "code": "532622"
              },
              {
                "name": "西畴县",
                "code": "532623"
              },
              {
                "name": "麻栗坡县",
                "code": "532624"
              },
              {
                "name": "马关县",
                "code": "532625"
              },
              {
                "name": "丘北县",
                "code": "532626"
              },
              {
                "name": "广南县",
                "code": "532627"
              },
              {
                "name": "富宁县",
                "code": "532628"
              }
            ]
          },
          {
            "name": "西双版纳",
            "code": "28",
            "children": [
              {
                "name": "景洪市",
                "code": "532801"
              },
              {
                "name": "勐海县",
                "code": "532822"
              },
              {
                "name": "勐腊县",
                "code": "532823"
              }
            ]
          },
          {
            "name": "大理",
            "code": "29",
            "children": [
              {
                "name": "大理市",
                "code": "532901"
              },
              {
                "name": "漾濞彝族自治县",
                "code": "532922"
              },
              {
                "name": "祥云县",
                "code": "532923"
              },
              {
                "name": "宾川县",
                "code": "532924"
              },
              {
                "name": "弥渡县",
                "code": "532925"
              },
              {
                "name": "南涧彝族自治县",
                "code": "532926"
              },
              {
                "name": "巍山彝族回族自治县",
                "code": "532927"
              },
              {
                "name": "永平县",
                "code": "532928"
              },
              {
                "name": "云龙县",
                "code": "532929"
              },
              {
                "name": "洱源县",
                "code": "532930"
              },
              {
                "name": "剑川县",
                "code": "532931"
              },
              {
                "name": "鹤庆县",
                "code": "532932"
              }
            ]
          },
          {
            "name": "曲靖",
            "code": "3",
            "children": [
              {
                "name": "麒麟区",
                "code": "530302"
              },
              {
                "name": "马龙县",
                "code": "530321"
              },
              {
                "name": "陆良县",
                "code": "530322"
              },
              {
                "name": "师宗县",
                "code": "530323"
              },
              {
                "name": "罗平县",
                "code": "530324"
              },
              {
                "name": "富源县",
                "code": "530325"
              },
              {
                "name": "会泽县",
                "code": "530326"
              },
              {
                "name": "沾益县",
                "code": "530328"
              },
              {
                "name": "宣威市",
                "code": "530381"
              }
            ]
          },
          {
            "name": "德宏",
            "code": "31",
            "children": [
              {
                "name": "瑞丽市",
                "code": "533102"
              },
              {
                "name": "潞西市",
                "code": "533103"
              },
              {
                "name": "梁河县",
                "code": "533122"
              },
              {
                "name": "盈江县",
                "code": "533123"
              },
              {
                "name": "陇川县",
                "code": "533124"
              }
            ]
          },
          {
            "name": "怒江",
            "code": "33",
            "children": [
              {
                "name": "泸水县",
                "code": "533321"
              },
              {
                "name": "福贡县",
                "code": "533323"
              },
              {
                "name": "贡山独龙族怒族自治县",
                "code": "533324"
              },
              {
                "name": "兰坪白族普米族自治县",
                "code": "533325"
              }
            ]
          },
          {
            "name": "迪庆",
            "code": "34",
            "children": [
              {
                "name": "香格里拉县",
                "code": "533421"
              },
              {
                "name": "德钦县",
                "code": "533422"
              },
              {
                "name": "维西傈僳族自治县",
                "code": "533423"
              }
            ]
          },
          {
            "name": "玉溪",
            "code": "4",
            "children": [
              {
                "name": "红塔区",
                "code": "530402"
              },
              {
                "name": "江川县",
                "code": "530421"
              },
              {
                "name": "澄江县",
                "code": "530422"
              },
              {
                "name": "通海县",
                "code": "530423"
              },
              {
                "name": "华宁县",
                "code": "530424"
              },
              {
                "name": "易门县",
                "code": "530425"
              },
              {
                "name": "峨山彝族自治县",
                "code": "530426"
              },
              {
                "name": "新平彝族傣族自治县",
                "code": "530427"
              },
              {
                "name": "元江哈尼族彝族傣族自治县",
                "code": "530428"
              }
            ]
          },
          {
            "name": "保山",
            "code": "5",
            "children": [
              {
                "name": "隆阳区",
                "code": "530502"
              },
              {
                "name": "施甸县",
                "code": "530521"
              },
              {
                "name": "腾冲县",
                "code": "530522"
              },
              {
                "name": "龙陵县",
                "code": "530523"
              },
              {
                "name": "昌宁县",
                "code": "530524"
              }
            ]
          },
          {
            "name": "昭通",
            "code": "6",
            "children": [
              {
                "name": "昭阳区",
                "code": "530602"
              },
              {
                "name": "鲁甸县",
                "code": "530621"
              },
              {
                "name": "巧家县",
                "code": "530622"
              },
              {
                "name": "盐津县",
                "code": "530623"
              },
              {
                "name": "大关县",
                "code": "530624"
              },
              {
                "name": "永善县",
                "code": "530625"
              },
              {
                "name": "绥江县",
                "code": "530626"
              },
              {
                "name": "镇雄县",
                "code": "530627"
              },
              {
                "name": "彝良县",
                "code": "530628"
              },
              {
                "name": "威信县",
                "code": "530629"
              },
              {
                "name": "水富县",
                "code": "530630"
              }
            ]
          },
          {
            "name": "丽江",
            "code": "7",
            "children": [
              {
                "name": "古城区",
                "code": "530702"
              },
              {
                "name": "玉龙纳西族自治县",
                "code": "530721"
              },
              {
                "name": "永胜县",
                "code": "530722"
              },
              {
                "name": "华坪县",
                "code": "530723"
              },
              {
                "name": "宁蒗彝族自治县",
                "code": "530724"
              }
            ]
          },
          {
            "name": "普洱",
            "code": "8",
            "children": [
              {
                "name": "思茅区",
                "code": "530802"
              },
              {
                "name": "宁洱哈尼族彝族自治县",
                "code": "530821"
              },
              {
                "name": "墨江哈尼族自治县",
                "code": "530822"
              },
              {
                "name": "景东彝族自治县",
                "code": "530823"
              },
              {
                "name": "景谷傣族彝族自治县",
                "code": "530824"
              },
              {
                "name": "镇沅彝族哈尼族拉祜族自治县",
                "code": "530825"
              },
              {
                "name": "江城哈尼族彝族自治县",
                "code": "530826"
              },
              {
                "name": "孟连傣族拉祜族佤族自治县",
                "code": "530827"
              },
              {
                "name": "澜沧拉祜族自治县",
                "code": "530828"
              },
              {
                "name": "西盟佤族自治县",
                "code": "530829"
              }
            ]
          },
          {
            "name": "临沧",
            "code": "9",
            "children": [
              {
                "name": "临翔区",
                "code": "530902"
              },
              {
                "name": "凤庆县",
                "code": "530921"
              },
              {
                "name": "云　县",
                "code": "530922"
              },
              {
                "name": "永德县",
                "code": "530923"
              },
              {
                "name": "镇康县",
                "code": "530924"
              },
              {
                "name": "双江拉祜族佤族布朗族傣族自治县",
                "code": "530925"
              },
              {
                "name": "耿马傣族佤族自治县",
                "code": "530926"
              },
              {
                "name": "沧源佤族自治县",
                "code": "530927"
              }
            ]
          }
        ]
      },
      {
        "name": "西藏",
        "code": "54",
        "children": [
          {
            "name": "拉萨",
            "code": "1",
            "children": [
              {
                "name": "城关区",
                "code": "540102"
              },
              {
                "name": "林周县",
                "code": "540121"
              },
              {
                "name": "当雄县",
                "code": "540122"
              },
              {
                "name": "尼木县",
                "code": "540123"
              },
              {
                "name": "曲水县",
                "code": "540124"
              },
              {
                "name": "堆龙德庆县",
                "code": "540125"
              },
              {
                "name": "达孜县",
                "code": "540126"
              },
              {
                "name": "墨竹工卡县",
                "code": "540127"
              }
            ]
          },
          {
            "name": "昌都",
            "code": "21",
            "children": [
              {
                "name": "昌都县",
                "code": "542121"
              },
              {
                "name": "江达县",
                "code": "542122"
              },
              {
                "name": "贡觉县",
                "code": "542123"
              },
              {
                "name": "类乌齐县",
                "code": "542124"
              },
              {
                "name": "丁青县",
                "code": "542125"
              },
              {
                "name": "察雅县",
                "code": "542126"
              },
              {
                "name": "八宿县",
                "code": "542127"
              },
              {
                "name": "左贡县",
                "code": "542128"
              },
              {
                "name": "芒康县",
                "code": "542129"
              },
              {
                "name": "洛隆县",
                "code": "542132"
              },
              {
                "name": "边坝县",
                "code": "542133"
              }
            ]
          },
          {
            "name": "山南",
            "code": "22",
            "children": [
              {
                "name": "乃东县",
                "code": "542221"
              },
              {
                "name": "扎囊县",
                "code": "542222"
              },
              {
                "name": "贡嘎县",
                "code": "542223"
              },
              {
                "name": "桑日县",
                "code": "542224"
              },
              {
                "name": "琼结县",
                "code": "542225"
              },
              {
                "name": "曲松县",
                "code": "542226"
              },
              {
                "name": "措美县",
                "code": "542227"
              },
              {
                "name": "洛扎县",
                "code": "542228"
              },
              {
                "name": "加查县",
                "code": "542229"
              },
              {
                "name": "隆子县",
                "code": "542231"
              },
              {
                "name": "错那县",
                "code": "542232"
              },
              {
                "name": "浪卡子县",
                "code": "542233"
              }
            ]
          },
          {
            "name": "日喀则",
            "code": "23",
            "children": [
              {
                "name": "日喀则市",
                "code": "542301"
              },
              {
                "name": "南木林县",
                "code": "542322"
              },
              {
                "name": "江孜县",
                "code": "542323"
              },
              {
                "name": "定日县",
                "code": "542324"
              },
              {
                "name": "萨迦县",
                "code": "542325"
              },
              {
                "name": "拉孜县",
                "code": "542326"
              },
              {
                "name": "昂仁县",
                "code": "542327"
              },
              {
                "name": "谢通门县",
                "code": "542328"
              },
              {
                "name": "白朗县",
                "code": "542329"
              },
              {
                "name": "仁布县",
                "code": "542330"
              },
              {
                "name": "康马县",
                "code": "542331"
              },
              {
                "name": "定结县",
                "code": "542332"
              },
              {
                "name": "仲巴县",
                "code": "542333"
              },
              {
                "name": "亚东县",
                "code": "542334"
              },
              {
                "name": "吉隆县",
                "code": "542335"
              },
              {
                "name": "聂拉木县",
                "code": "542336"
              },
              {
                "name": "萨嘎县",
                "code": "542337"
              },
              {
                "name": "岗巴县",
                "code": "542338"
              }
            ]
          },
          {
            "name": "那曲",
            "code": "24",
            "children": [
              {
                "name": "那曲县",
                "code": "542421"
              },
              {
                "name": "嘉黎县",
                "code": "542422"
              },
              {
                "name": "比如县",
                "code": "542423"
              },
              {
                "name": "聂荣县",
                "code": "542424"
              },
              {
                "name": "安多县",
                "code": "542425"
              },
              {
                "name": "申扎县",
                "code": "542426"
              },
              {
                "name": "索　县",
                "code": "542427"
              },
              {
                "name": "班戈县",
                "code": "542428"
              },
              {
                "name": "巴青县",
                "code": "542429"
              },
              {
                "name": "尼玛县",
                "code": "542430"
              }
            ]
          },
          {
            "name": "阿里",
            "code": "25",
            "children": [
              {
                "name": "普兰县",
                "code": "542521"
              },
              {
                "name": "札达县",
                "code": "542522"
              },
              {
                "name": "噶尔县",
                "code": "542523"
              },
              {
                "name": "日土县",
                "code": "542524"
              },
              {
                "name": "革吉县",
                "code": "542525"
              },
              {
                "name": "改则县",
                "code": "542526"
              },
              {
                "name": "措勤县",
                "code": "542527"
              }
            ]
          },
          {
            "name": "林芝",
            "code": "26",
            "children": [
              {
                "name": "林芝县",
                "code": "542621"
              },
              {
                "name": "工布江达县",
                "code": "542622"
              },
              {
                "name": "米林县",
                "code": "542623"
              },
              {
                "name": "墨脱县",
                "code": "542624"
              },
              {
                "name": "波密县",
                "code": "542625"
              },
              {
                "name": "察隅县",
                "code": "542626"
              },
              {
                "name": "朗　县",
                "code": "542627"
              }
            ]
          }
        ]
      },
      {
        "name": "陕西",
        "code": "61",
        "children": [
          {
            "name": "西安",
            "code": "1",
            "children": [
              {
                "name": "新城区",
                "code": "610102"
              },
              {
                "name": "碑林区",
                "code": "610103"
              },
              {
                "name": "莲湖区",
                "code": "610104"
              },
              {
                "name": "灞桥区",
                "code": "610111"
              },
              {
                "name": "未央区",
                "code": "610112"
              },
              {
                "name": "雁塔区",
                "code": "610113"
              },
              {
                "name": "阎良区",
                "code": "610114"
              },
              {
                "name": "临潼区",
                "code": "610115"
              },
              {
                "name": "长安区",
                "code": "610116"
              },
              {
                "name": "蓝田县",
                "code": "610122"
              },
              {
                "name": "周至县",
                "code": "610124"
              },
              {
                "name": "户　县",
                "code": "610125"
              },
              {
                "name": "高陵县",
                "code": "610126"
              }
            ]
          },
          {
            "name": "商洛",
            "code": "10",
            "children": [
              {
                "name": "商州区",
                "code": "611002"
              },
              {
                "name": "洛南县",
                "code": "611021"
              },
              {
                "name": "丹凤县",
                "code": "611022"
              },
              {
                "name": "商南县",
                "code": "611023"
              },
              {
                "name": "山阳县",
                "code": "611024"
              },
              {
                "name": "镇安县",
                "code": "611025"
              },
              {
                "name": "柞水县",
                "code": "611026"
              }
            ]
          },
          {
            "name": "铜川",
            "code": "2",
            "children": [
              {
                "name": "王益区",
                "code": "610202"
              },
              {
                "name": "印台区",
                "code": "610203"
              },
              {
                "name": "耀州区",
                "code": "610204"
              },
              {
                "name": "宜君县",
                "code": "610222"
              }
            ]
          },
          {
            "name": "宝鸡",
            "code": "3",
            "children": [
              {
                "name": "渭滨区",
                "code": "610302"
              },
              {
                "name": "金台区",
                "code": "610303"
              },
              {
                "name": "陈仓区",
                "code": "610304"
              },
              {
                "name": "凤翔县",
                "code": "610322"
              },
              {
                "name": "岐山县",
                "code": "610323"
              },
              {
                "name": "扶风县",
                "code": "610324"
              },
              {
                "name": "眉　县",
                "code": "610326"
              },
              {
                "name": "陇　县",
                "code": "610327"
              },
              {
                "name": "千阳县",
                "code": "610328"
              },
              {
                "name": "麟游县",
                "code": "610329"
              },
              {
                "name": "凤　县",
                "code": "610330"
              },
              {
                "name": "太白县",
                "code": "610331"
              }
            ]
          },
          {
            "name": "咸阳",
            "code": "4",
            "children": [
              {
                "name": "秦都区",
                "code": "610402"
              },
              {
                "name": "杨凌区",
                "code": "610403"
              },
              {
                "name": "渭城区",
                "code": "610404"
              },
              {
                "name": "三原县",
                "code": "610422"
              },
              {
                "name": "泾阳县",
                "code": "610423"
              },
              {
                "name": "乾　县",
                "code": "610424"
              },
              {
                "name": "礼泉县",
                "code": "610425"
              },
              {
                "name": "永寿县",
                "code": "610426"
              },
              {
                "name": "彬　县",
                "code": "610427"
              },
              {
                "name": "长武县",
                "code": "610428"
              },
              {
                "name": "旬邑县",
                "code": "610429"
              },
              {
                "name": "淳化县",
                "code": "610430"
              },
              {
                "name": "武功县",
                "code": "610431"
              },
              {
                "name": "兴平市",
                "code": "610481"
              }
            ]
          },
          {
            "name": "渭南",
            "code": "5",
            "children": [
              {
                "name": "临渭区",
                "code": "610502"
              },
              {
                "name": "华　县",
                "code": "610521"
              },
              {
                "name": "潼关县",
                "code": "610522"
              },
              {
                "name": "大荔县",
                "code": "610523"
              },
              {
                "name": "合阳县",
                "code": "610524"
              },
              {
                "name": "澄城县",
                "code": "610525"
              },
              {
                "name": "蒲城县",
                "code": "610526"
              },
              {
                "name": "白水县",
                "code": "610527"
              },
              {
                "name": "富平县",
                "code": "610528"
              },
              {
                "name": "韩城市",
                "code": "610581"
              },
              {
                "name": "华阴市",
                "code": "610582"
              }
            ]
          },
          {
            "name": "延安",
            "code": "6",
            "children": [
              {
                "name": "宝塔区",
                "code": "610602"
              },
              {
                "name": "延长县",
                "code": "610621"
              },
              {
                "name": "延川县",
                "code": "610622"
              },
              {
                "name": "子长县",
                "code": "610623"
              },
              {
                "name": "安塞县",
                "code": "610624"
              },
              {
                "name": "志丹县",
                "code": "610625"
              },
              {
                "name": "吴起县",
                "code": "610626"
              },
              {
                "name": "甘泉县",
                "code": "610627"
              },
              {
                "name": "富　县",
                "code": "610628"
              },
              {
                "name": "洛川县",
                "code": "610629"
              },
              {
                "name": "宜川县",
                "code": "610630"
              },
              {
                "name": "黄龙县",
                "code": "610631"
              },
              {
                "name": "黄陵县",
                "code": "610632"
              }
            ]
          },
          {
            "name": "汉中",
            "code": "7",
            "children": [
              {
                "name": "汉台区",
                "code": "610702"
              },
              {
                "name": "南郑县",
                "code": "610721"
              },
              {
                "name": "城固县",
                "code": "610722"
              },
              {
                "name": "洋　县",
                "code": "610723"
              },
              {
                "name": "西乡县",
                "code": "610724"
              },
              {
                "name": "勉　县",
                "code": "610725"
              },
              {
                "name": "宁强县",
                "code": "610726"
              },
              {
                "name": "略阳县",
                "code": "610727"
              },
              {
                "name": "镇巴县",
                "code": "610728"
              },
              {
                "name": "留坝县",
                "code": "610729"
              },
              {
                "name": "佛坪县",
                "code": "610730"
              }
            ]
          },
          {
            "name": "榆林",
            "code": "8",
            "children": [
              {
                "name": "榆阳区",
                "code": "610802"
              },
              {
                "name": "神木县",
                "code": "610821"
              },
              {
                "name": "府谷县",
                "code": "610822"
              },
              {
                "name": "横山县",
                "code": "610823"
              },
              {
                "name": "靖边县",
                "code": "610824"
              },
              {
                "name": "定边县",
                "code": "610825"
              },
              {
                "name": "绥德县",
                "code": "610826"
              },
              {
                "name": "米脂县",
                "code": "610827"
              },
              {
                "name": "佳　县",
                "code": "610828"
              },
              {
                "name": "吴堡县",
                "code": "610829"
              },
              {
                "name": "清涧县",
                "code": "610830"
              },
              {
                "name": "子洲县",
                "code": "610831"
              }
            ]
          },
          {
            "name": "安康",
            "code": "9",
            "children": [
              {
                "name": "汉滨区",
                "code": "610902"
              },
              {
                "name": "汉阴县",
                "code": "610921"
              },
              {
                "name": "石泉县",
                "code": "610922"
              },
              {
                "name": "宁陕县",
                "code": "610923"
              },
              {
                "name": "紫阳县",
                "code": "610924"
              },
              {
                "name": "岚皋县",
                "code": "610925"
              },
              {
                "name": "平利县",
                "code": "610926"
              },
              {
                "name": "镇坪县",
                "code": "610927"
              },
              {
                "name": "旬阳县",
                "code": "610928"
              },
              {
                "name": "白河县",
                "code": "610929"
              }
            ]
          }
        ]
      },
      {
        "name": "甘肃",
        "code": "62",
        "children": [
          {
            "name": "兰州市",
            "code": "1",
            "children": [
              {
                "name": "城关区",
                "code": "620102"
              },
              {
                "name": "七里河区",
                "code": "620103"
              },
              {
                "name": "西固区",
                "code": "620104"
              },
              {
                "name": "安宁区",
                "code": "620105"
              },
              {
                "name": "红古区",
                "code": "620111"
              },
              {
                "name": "永登县",
                "code": "620121"
              },
              {
                "name": "皋兰县",
                "code": "620122"
              },
              {
                "name": "榆中县",
                "code": "620123"
              }
            ]
          },
          {
            "name": "庆阳",
            "code": "10",
            "children": [
              {
                "name": "西峰区",
                "code": "621002"
              },
              {
                "name": "庆城县",
                "code": "621021"
              },
              {
                "name": "环　县",
                "code": "621022"
              },
              {
                "name": "华池县",
                "code": "621023"
              },
              {
                "name": "合水县",
                "code": "621024"
              },
              {
                "name": "正宁县",
                "code": "621025"
              },
              {
                "name": "宁　县",
                "code": "621026"
              },
              {
                "name": "镇原县",
                "code": "621027"
              }
            ]
          },
          {
            "name": "定西",
            "code": "11",
            "children": [
              {
                "name": "安定区",
                "code": "621102"
              },
              {
                "name": "通渭县",
                "code": "621121"
              },
              {
                "name": "陇西县",
                "code": "621122"
              },
              {
                "name": "渭源县",
                "code": "621123"
              },
              {
                "name": "临洮县",
                "code": "621124"
              },
              {
                "name": "漳　县",
                "code": "621125"
              },
              {
                "name": "岷　县",
                "code": "621126"
              }
            ]
          },
          {
            "name": "陇南",
            "code": "12",
            "children": [
              {
                "name": "武都区",
                "code": "621202"
              },
              {
                "name": "成　县",
                "code": "621221"
              },
              {
                "name": "文　县",
                "code": "621222"
              },
              {
                "name": "宕昌县",
                "code": "621223"
              },
              {
                "name": "康　县",
                "code": "621224"
              },
              {
                "name": "西和县",
                "code": "621225"
              },
              {
                "name": "礼　县",
                "code": "621226"
              },
              {
                "name": "徽　县",
                "code": "621227"
              },
              {
                "name": "两当县",
                "code": "621228"
              }
            ]
          },
          {
            "name": "嘉峪关",
            "code": "2",
            "children": {
              "name": "嘉峪关市",
              "code": "620200"
            }
          },
          {
            "name": "临夏",
            "code": "29",
            "children": [
              {
                "name": "临夏市",
                "code": "622901"
              },
              {
                "name": "临夏县",
                "code": "622921"
              },
              {
                "name": "康乐县",
                "code": "622922"
              },
              {
                "name": "永靖县",
                "code": "622923"
              },
              {
                "name": "广河县",
                "code": "622924"
              },
              {
                "name": "和政县",
                "code": "622925"
              },
              {
                "name": "东乡族自治县",
                "code": "622926"
              },
              {
                "name": "积石山保安族东乡族撒拉族自治县",
                "code": "622927"
              }
            ]
          },
          {
            "name": "金昌",
            "code": "3",
            "children": [
              {
                "name": "金川区",
                "code": "620302"
              },
              {
                "name": "永昌县",
                "code": "620321"
              }
            ]
          },
          {
            "name": "甘南",
            "code": "30",
            "children": [
              {
                "name": "合作市",
                "code": "623001"
              },
              {
                "name": "临潭县",
                "code": "623021"
              },
              {
                "name": "卓尼县",
                "code": "623022"
              },
              {
                "name": "舟曲县",
                "code": "623023"
              },
              {
                "name": "迭部县",
                "code": "623024"
              },
              {
                "name": "玛曲县",
                "code": "623025"
              },
              {
                "name": "碌曲县",
                "code": "623026"
              },
              {
                "name": "夏河县",
                "code": "623027"
              }
            ]
          },
          {
            "name": "白银",
            "code": "4",
            "children": [
              {
                "name": "白银区",
                "code": "620402"
              },
              {
                "name": "平川区",
                "code": "620403"
              },
              {
                "name": "靖远县",
                "code": "620421"
              },
              {
                "name": "会宁县",
                "code": "620422"
              },
              {
                "name": "景泰县",
                "code": "620423"
              }
            ]
          },
          {
            "name": "天水",
            "code": "5",
            "children": [
              {
                "name": "秦州区",
                "code": "620502"
              },
              {
                "name": "麦积区",
                "code": "620503"
              },
              {
                "name": "清水县",
                "code": "620521"
              },
              {
                "name": "秦安县",
                "code": "620522"
              },
              {
                "name": "甘谷县",
                "code": "620523"
              },
              {
                "name": "武山县",
                "code": "620524"
              },
              {
                "name": "张家川回族自治县",
                "code": "620525"
              }
            ]
          },
          {
            "name": "武威",
            "code": "6",
            "children": [
              {
                "name": "凉州区",
                "code": "620602"
              },
              {
                "name": "民勤县",
                "code": "620621"
              },
              {
                "name": "古浪县",
                "code": "620622"
              },
              {
                "name": "天祝藏族自治县",
                "code": "620623"
              }
            ]
          },
          {
            "name": "张掖",
            "code": "7",
            "children": [
              {
                "name": "甘州区",
                "code": "620702"
              },
              {
                "name": "肃南裕固族自治县",
                "code": "620721"
              },
              {
                "name": "民乐县",
                "code": "620722"
              },
              {
                "name": "临泽县",
                "code": "620723"
              },
              {
                "name": "高台县",
                "code": "620724"
              },
              {
                "name": "山丹县",
                "code": "620725"
              }
            ]
          },
          {
            "name": "平凉",
            "code": "8",
            "children": [
              {
                "name": "崆峒区",
                "code": "620802"
              },
              {
                "name": "泾川县",
                "code": "620821"
              },
              {
                "name": "灵台县",
                "code": "620822"
              },
              {
                "name": "崇信县",
                "code": "620823"
              },
              {
                "name": "华亭县",
                "code": "620824"
              },
              {
                "name": "庄浪县",
                "code": "620825"
              },
              {
                "name": "静宁县",
                "code": "620826"
              }
            ]
          },
          {
            "name": "酒泉",
            "code": "9",
            "children": [
              {
                "name": "肃州区",
                "code": "620902"
              },
              {
                "name": "金塔县",
                "code": "620921"
              },
              {
                "name": "瓜州县",
                "code": "620922"
              },
              {
                "name": "肃北蒙古族自治县",
                "code": "620923"
              },
              {
                "name": "阿克塞哈萨克族自治县",
                "code": "620924"
              },
              {
                "name": "玉门市",
                "code": "620981"
              },
              {
                "name": "敦煌市",
                "code": "620982"
              }
            ]
          }
        ]
      },
      {
        "name": "青海",
        "code": "63",
        "children": [
          {
            "name": "西宁",
            "code": "1",
            "children": [
              {
                "name": "城东区",
                "code": "630102"
              },
              {
                "name": "城中区",
                "code": "630103"
              },
              {
                "name": "城西区",
                "code": "630104"
              },
              {
                "name": "城北区",
                "code": "630105"
              },
              {
                "name": "大通回族土族自治县",
                "code": "630121"
              },
              {
                "name": "湟中县",
                "code": "630122"
              },
              {
                "name": "湟源县",
                "code": "630123"
              }
            ]
          },
          {
            "name": "海东",
            "code": "21",
            "children": [
              {
                "name": "平安县",
                "code": "632121"
              },
              {
                "name": "民和回族土族自治县",
                "code": "632122"
              },
              {
                "name": "乐都县",
                "code": "632123"
              },
              {
                "name": "互助土族自治县",
                "code": "632126"
              },
              {
                "name": "化隆回族自治县",
                "code": "632127"
              },
              {
                "name": "循化撒拉族自治县",
                "code": "632128"
              }
            ]
          },
          {
            "name": "海北",
            "code": "22",
            "children": [
              {
                "name": "门源回族自治县",
                "code": "632221"
              },
              {
                "name": "祁连县",
                "code": "632222"
              },
              {
                "name": "海晏县",
                "code": "632223"
              },
              {
                "name": "刚察县",
                "code": "632224"
              }
            ]
          },
          {
            "name": "黄南",
            "code": "23",
            "children": [
              {
                "name": "同仁县",
                "code": "632321"
              },
              {
                "name": "尖扎县",
                "code": "632322"
              },
              {
                "name": "泽库县",
                "code": "632323"
              },
              {
                "name": "河南蒙古族自治县",
                "code": "632324"
              }
            ]
          },
          {
            "name": "海南",
            "code": "25",
            "children": [
              {
                "name": "共和县",
                "code": "632521"
              },
              {
                "name": "同德县",
                "code": "632522"
              },
              {
                "name": "贵德县",
                "code": "632523"
              },
              {
                "name": "兴海县",
                "code": "632524"
              },
              {
                "name": "贵南县",
                "code": "632525"
              }
            ]
          },
          {
            "name": "果洛",
            "code": "26",
            "children": [
              {
                "name": "玛沁县",
                "code": "632621"
              },
              {
                "name": "班玛县",
                "code": "632622"
              },
              {
                "name": "甘德县",
                "code": "632623"
              },
              {
                "name": "达日县",
                "code": "632624"
              },
              {
                "name": "久治县",
                "code": "632625"
              },
              {
                "name": "玛多县",
                "code": "632626"
              }
            ]
          },
          {
            "name": "玉树",
            "code": "27",
            "children": [
              {
                "name": "玉树县",
                "code": "632721"
              },
              {
                "name": "杂多县",
                "code": "632722"
              },
              {
                "name": "称多县",
                "code": "632723"
              },
              {
                "name": "治多县",
                "code": "632724"
              },
              {
                "name": "囊谦县",
                "code": "632725"
              },
              {
                "name": "曲麻莱县",
                "code": "632726"
              }
            ]
          },
          {
            "name": "海西",
            "code": "28",
            "children": [
              {
                "name": "格尔木市",
                "code": "632801"
              },
              {
                "name": "德令哈市",
                "code": "632802"
              },
              {
                "name": "乌兰县",
                "code": "632821"
              },
              {
                "name": "都兰县",
                "code": "632822"
              },
              {
                "name": "天峻县",
                "code": "632823"
              }
            ]
          }
        ]
      },
      {
        "name": "宁夏",
        "code": "64",
        "children": [
          {
            "name": "银川",
            "code": "1",
            "children": [
              {
                "name": "兴庆区",
                "code": "640104"
              },
              {
                "name": "西夏区",
                "code": "640105"
              },
              {
                "name": "金凤区",
                "code": "640106"
              },
              {
                "name": "永宁县",
                "code": "640121"
              },
              {
                "name": "贺兰县",
                "code": "640122"
              },
              {
                "name": "灵武市",
                "code": "640181"
              }
            ]
          },
          {
            "name": "石嘴山",
            "code": "2",
            "children": [
              {
                "name": "大武口区",
                "code": "640202"
              },
              {
                "name": "惠农区",
                "code": "640205"
              },
              {
                "name": "平罗县",
                "code": "640221"
              }
            ]
          },
          {
            "name": "吴忠",
            "code": "3",
            "children": [
              {
                "name": "利通区",
                "code": "640302"
              },
              {
                "name": "盐池县",
                "code": "640323"
              },
              {
                "name": "同心县",
                "code": "640324"
              },
              {
                "name": "青铜峡市",
                "code": "640381"
              }
            ]
          },
          {
            "name": "固原",
            "code": "4",
            "children": [
              {
                "name": "原州区",
                "code": "640402"
              },
              {
                "name": "西吉县",
                "code": "640422"
              },
              {
                "name": "隆德县",
                "code": "640423"
              },
              {
                "name": "泾源县",
                "code": "640424"
              },
              {
                "name": "彭阳县",
                "code": "640425"
              }
            ]
          },
          {
            "name": "中卫",
            "code": "5",
            "children": [
              {
                "name": "沙坡头区",
                "code": "640502"
              },
              {
                "name": "中宁县",
                "code": "640521"
              },
              {
                "name": "海原县",
                "code": "640522"
              }
            ]
          }
        ]
      },
      {
        "name": "新疆",
        "code": "65",
        "children": [
          {
            "name": "乌鲁木齐",
            "code": "1",
            "children": [
              {
                "name": "天山区",
                "code": "650102"
              },
              {
                "name": "沙依巴克区",
                "code": "650103"
              },
              {
                "name": "新市区",
                "code": "650104"
              },
              {
                "name": "水磨沟区",
                "code": "650105"
              },
              {
                "name": "头屯河区",
                "code": "650106"
              },
              {
                "name": "达坂城区",
                "code": "650107"
              },
              {
                "name": "米东区",
                "code": "650109"
              },
              {
                "name": "乌鲁木齐县",
                "code": "650121"
              }
            ]
          },
          {
            "name": "克拉玛依",
            "code": "2",
            "children": [
              {
                "name": "独山子区",
                "code": "650202"
              },
              {
                "name": "克拉玛依区",
                "code": "650203"
              },
              {
                "name": "白碱滩区",
                "code": "650204"
              },
              {
                "name": "乌尔禾区",
                "code": "650205"
              }
            ]
          },
          {
            "name": "吐鲁番",
            "code": "21",
            "children": [
              {
                "name": "吐鲁番市",
                "code": "652101"
              },
              {
                "name": "鄯善县",
                "code": "652122"
              },
              {
                "name": "托克逊县",
                "code": "652123"
              }
            ]
          },
          {
            "name": "哈密",
            "code": "22",
            "children": [
              {
                "name": "哈密市",
                "code": "652201"
              },
              {
                "name": "巴里坤哈萨克自治县",
                "code": "652222"
              },
              {
                "name": "伊吾县",
                "code": "652223"
              }
            ]
          },
          {
            "name": "昌吉",
            "code": "23",
            "children": [
              {
                "name": "昌吉市",
                "code": "652301"
              },
              {
                "name": "阜康市",
                "code": "652302"
              },
              {
                "name": "呼图壁县",
                "code": "652323"
              },
              {
                "name": "玛纳斯县",
                "code": "652324"
              },
              {
                "name": "奇台县",
                "code": "652325"
              },
              {
                "name": "吉木萨尔县",
                "code": "652327"
              },
              {
                "name": "木垒哈萨克自治县",
                "code": "652328"
              }
            ]
          },
          {
            "name": "博尔塔拉",
            "code": "27",
            "children": [
              {
                "name": "博乐市",
                "code": "652701"
              },
              {
                "name": "精河县",
                "code": "652722"
              },
              {
                "name": "温泉县",
                "code": "652723"
              }
            ]
          },
          {
            "name": "巴音郭楞",
            "code": "28",
            "children": [
              {
                "name": "库尔勒市",
                "code": "652801"
              },
              {
                "name": "轮台县",
                "code": "652822"
              },
              {
                "name": "尉犁县",
                "code": "652823"
              },
              {
                "name": "若羌县",
                "code": "652824"
              },
              {
                "name": "且末县",
                "code": "652825"
              },
              {
                "name": "焉耆回族自治县",
                "code": "652826"
              },
              {
                "name": "和静县",
                "code": "652827"
              },
              {
                "name": "和硕县",
                "code": "652828"
              },
              {
                "name": "博湖县",
                "code": "652829"
              }
            ]
          },
          {
            "name": "阿克苏",
            "code": "29",
            "children": [
              {
                "name": "阿克苏市",
                "code": "652901"
              },
              {
                "name": "温宿县",
                "code": "652922"
              },
              {
                "name": "库车县",
                "code": "652923"
              },
              {
                "name": "沙雅县",
                "code": "652924"
              },
              {
                "name": "新和县",
                "code": "652925"
              },
              {
                "name": "拜城县",
                "code": "652926"
              },
              {
                "name": "乌什县",
                "code": "652927"
              },
              {
                "name": "阿瓦提县",
                "code": "652928"
              },
              {
                "name": "柯坪县",
                "code": "652929"
              }
            ]
          },
          {
            "name": "克孜勒苏",
            "code": "30",
            "children": [
              {
                "name": "阿图什市",
                "code": "653001"
              },
              {
                "name": "阿克陶县",
                "code": "653022"
              },
              {
                "name": "阿合奇县",
                "code": "653023"
              },
              {
                "name": "乌恰县",
                "code": "653024"
              }
            ]
          },
          {
            "name": "喀什",
            "code": "31",
            "children": [
              {
                "name": "喀什市",
                "code": "653101"
              },
              {
                "name": "疏附县",
                "code": "653121"
              },
              {
                "name": "疏勒县",
                "code": "653122"
              },
              {
                "name": "英吉沙县",
                "code": "653123"
              },
              {
                "name": "泽普县",
                "code": "653124"
              },
              {
                "name": "莎车县",
                "code": "653125"
              },
              {
                "name": "叶城县",
                "code": "653126"
              },
              {
                "name": "麦盖提县",
                "code": "653127"
              },
              {
                "name": "岳普湖县",
                "code": "653128"
              },
              {
                "name": "伽师县",
                "code": "653129"
              },
              {
                "name": "巴楚县",
                "code": "653130"
              },
              {
                "name": "塔什库尔干塔吉克自治县",
                "code": "653131"
              }
            ]
          },
          {
            "name": "和田",
            "code": "32",
            "children": [
              {
                "name": "和田市",
                "code": "653201"
              },
              {
                "name": "和田县",
                "code": "653221"
              },
              {
                "name": "墨玉县",
                "code": "653222"
              },
              {
                "name": "皮山县",
                "code": "653223"
              },
              {
                "name": "洛浦县",
                "code": "653224"
              },
              {
                "name": "策勒县",
                "code": "653225"
              },
              {
                "name": "于田县",
                "code": "653226"
              },
              {
                "name": "民丰县",
                "code": "653227"
              }
            ]
          },
          {
            "name": "伊犁",
            "code": "40",
            "children": [
              {
                "name": "伊宁市",
                "code": "654002"
              },
              {
                "name": "奎屯市",
                "code": "654003"
              },
              {
                "name": "伊宁县",
                "code": "654021"
              },
              {
                "name": "察布查尔锡伯自治县",
                "code": "654022"
              },
              {
                "name": "霍城县",
                "code": "654023"
              },
              {
                "name": "巩留县",
                "code": "654024"
              },
              {
                "name": "新源县",
                "code": "654025"
              },
              {
                "name": "昭苏县",
                "code": "654026"
              },
              {
                "name": "特克斯县",
                "code": "654027"
              },
              {
                "name": "尼勒克县",
                "code": "654028"
              }
            ]
          },
          {
            "name": "塔城",
            "code": "42",
            "children": [
              {
                "name": "塔城市",
                "code": "654201"
              },
              {
                "name": "乌苏市",
                "code": "654202"
              },
              {
                "name": "额敏县",
                "code": "654221"
              },
              {
                "name": "沙湾县",
                "code": "654223"
              },
              {
                "name": "托里县",
                "code": "654224"
              },
              {
                "name": "裕民县",
                "code": "654225"
              },
              {
                "name": "和布克赛尔蒙古自治县",
                "code": "654226"
              }
            ]
          },
          {
            "name": "阿勒泰",
            "code": "43",
            "children": [
              {
                "name": "阿勒泰市",
                "code": "654301"
              },
              {
                "name": "布尔津县",
                "code": "654321"
              },
              {
                "name": "富蕴县",
                "code": "654322"
              },
              {
                "name": "福海县",
                "code": "654323"
              },
              {
                "name": "哈巴河县",
                "code": "654324"
              },
              {
                "name": "青河县",
                "code": "654325"
              },
              {
                "name": "吉木乃县",
                "code": "654326"
              }
            ]
          },
          {
            "name": "石河子",
            "code": "91"
          },
          {
            "name": "阿拉尔",
            "code": "92"
          },
          {
            "name": "图木舒克",
            "code": "93"
          },
          {
            "name": "五家渠",
            "code": "94"
          }
        ]
      },
      {
        "name": "台湾",
        "code": "71",
        "children": [
          {
            "name": "台北市",
            "code": "1"
          },
          {
            "name": "桃园县",
            "code": "10"
          },
          {
            "name": "新竹县",
            "code": "11"
          },
          {
            "name": "苗栗县",
            "code": "12"
          },
          {
            "name": "台中县",
            "code": "13"
          },
          {
            "name": "彰化县",
            "code": "14"
          },
          {
            "name": "南投县",
            "code": "15"
          },
          {
            "name": "云林县",
            "code": "16"
          },
          {
            "name": "嘉义县",
            "code": "17"
          },
          {
            "name": "台南县",
            "code": "18"
          },
          {
            "name": "高雄县",
            "code": "19"
          },
          {
            "name": "高雄市",
            "code": "2"
          },
          {
            "name": "屏东县",
            "code": "20"
          },
          {
            "name": "澎湖县",
            "code": "21"
          },
          {
            "name": "台东县",
            "code": "22"
          },
          {
            "name": "花莲县",
            "code": "23"
          },
          {
            "name": "基隆市",
            "code": "3"
          },
          {
            "name": "台中市",
            "code": "4"
          },
          {
            "name": "台南市",
            "code": "5"
          },
          {
            "name": "新竹市",
            "code": "6"
          },
          {
            "name": "嘉义市",
            "code": "7"
          },
          {
            "name": "台北县",
            "code": "8"
          },
          {
            "name": "宜兰县",
            "code": "9"
          }
        ]
      },
      {
        "name": "香港",
        "code": "81",
        "children": [
          {
            "name": "中西区",
            "code": "HCW"
          },
          {
            "name": "东区",
            "code": "HEA"
          },
          {
            "name": "南区",
            "code": "HSO"
          },
          {
            "name": "湾仔区",
            "code": "HWC"
          },
          {
            "name": "九龙城区",
            "code": "KKC"
          },
          {
            "name": "观塘区",
            "code": "KKT"
          },
          {
            "name": "深水埗区",
            "code": "KSS"
          },
          {
            "name": "黄大仙区",
            "code": "KWT"
          },
          {
            "name": "油尖旺区",
            "code": "KYT"
          },
          {
            "name": "离岛区",
            "code": "NIS"
          },
          {
            "name": "葵青区",
            "code": "NKT"
          },
          {
            "name": "北区",
            "code": "NNO"
          },
          {
            "name": "西贡区",
            "code": "NSK"
          },
          {
            "name": "沙田区",
            "code": "NST"
          },
          {
            "name": "屯门区",
            "code": "NTM"
          },
          {
            "name": "大埔区",
            "code": "NTP"
          },
          {
            "name": "荃湾区",
            "code": "NTW"
          },
          {
            "name": "元朗区",
            "code": "NYL"
          }
        ]
      },
      {
        "name": "澳门",
        "code": "82",
        "children": [
          {
            "name": "圣安多尼堂区",
            "code": "ANT"
          },
          {
            "name": "大堂区",
            "code": "CAT"
          },
          {
            "name": "路环",
            "code": "CLN"
          },
          {
            "name": "望德堂区",
            "code": "LAW"
          },
          {
            "name": "风顺堂区",
            "code": "LAZ"
          },
          {
            "name": "花地玛堂区",
            "code": "OLF"
          },
          {
            "name": "氹仔",
            "code": "TPA"
          }
        ]
      }
    ]
  },
  {
    "name": "阿鲁巴",
    "code": "ABW"
  },
  {
    "name": "阿富汗",
    "code": "AFG",
    "children": {
      "children": [
        {
          "name": "赫拉特",
          "code": "HEA"
        },
        {
          "name": "喀布尔",
          "code": "KBL"
        },
        {
          "name": "坎大哈",
          "code": "KDH"
        },
        {
          "name": "马扎里沙里夫",
          "code": "MZR"
        }
      ]
    }
  },
  {
    "name": "安哥拉",
    "code": "AGO",
    "children": {
      "children": [
        {
          "name": "本戈",
          "code": "BGO"
        },
        {
          "name": "本格拉",
          "code": "BGU"
        },
        {
          "name": "比耶",
          "code": "BIE"
        },
        {
          "name": "卡宾达",
          "code": "CAB"
        },
        {
          "name": "宽多库邦戈",
          "code": "CCU"
        },
        {
          "name": "库内内",
          "code": "CNN"
        },
        {
          "name": "北宽扎",
          "code": "CNO"
        },
        {
          "name": "南宽扎",
          "code": "CUS"
        },
        {
          "name": "万博",
          "code": "HUA"
        },
        {
          "name": "威拉",
          "code": "HUI"
        },
        {
          "name": "北隆达",
          "code": "LNO"
        },
        {
          "name": "南隆达",
          "code": "LSU"
        },
        {
          "name": "罗安达",
          "code": "LUA"
        },
        {
          "name": "马兰热",
          "code": "MAL"
        },
        {
          "name": "莫希科",
          "code": "MOX"
        },
        {
          "name": "纳米贝",
          "code": "NAM"
        },
        {
          "name": "威热",
          "code": "UIG"
        },
        {
          "name": "扎伊尔",
          "code": "ZAI"
        }
      ]
    }
  },
  {
    "name": "安圭拉",
    "code": "AIA"
  },
  {
    "name": "奥兰群岛",
    "code": "ALA"
  },
  {
    "name": "阿尔巴尼亚",
    "code": "ALB",
    "children": {
      "children": [
        {
          "name": "培拉特",
          "code": "BR"
        },
        {
          "name": "迪勃拉",
          "code": "DI"
        },
        {
          "name": "都拉斯",
          "code": "DR"
        },
        {
          "name": "爱尔巴桑",
          "code": "EL"
        },
        {
          "name": "费里",
          "code": "FR"
        },
        {
          "name": "吉诺卡斯特",
          "code": "GJ"
        },
        {
          "name": "科尔察",
          "code": "KO"
        },
        {
          "name": "库克斯",
          "code": "KU"
        },
        {
          "name": "莱什",
          "code": "LE"
        },
        {
          "name": "斯库台",
          "code": "SH"
        },
        {
          "name": "地拉那",
          "code": "TR"
        },
        {
          "name": "发罗拉",
          "code": "VL"
        }
      ]
    }
  },
  {
    "name": "安道尔",
    "code": "AND",
    "children": {
      "children": [
        {
          "name": "卡尼略",
          "code": "2"
        },
        {
          "name": "恩坎普",
          "code": "3"
        },
        {
          "name": "马萨纳",
          "code": "4"
        },
        {
          "name": "奥尔迪诺",
          "code": "5"
        },
        {
          "name": "圣胡利娅－德洛里亚",
          "code": "6"
        },
        {
          "name": "安道尔城",
          "code": "7"
        },
        {
          "name": "莱塞斯卡尔德－恩戈尔达",
          "code": "8"
        }
      ]
    }
  },
  {
    "name": "荷属安地列斯",
    "code": "ANT"
  },
  {
    "name": "阿拉伯联合酋长国",
    "code": "ARE",
    "children": {
      "children": [
        {
          "name": "艾因",
          "code": "AL"
        },
        {
          "name": "阿布扎比",
          "code": "AZ"
        },
        {
          "name": "迪拜",
          "code": "DU"
        },
        {
          "name": "沙迦",
          "code": "SH"
        }
      ]
    }
  },
  {
    "name": "阿根廷",
    "code": "ARG",
    "children": {
      "children": [
        {
          "name": "圣拉斐尔",
          "code": "AFA"
        },
        {
          "name": "布兰卡港",
          "code": "BHI"
        },
        {
          "name": "布宜诺斯艾利斯",
          "code": "BUE"
        },
        {
          "name": "科连特斯",
          "code": "CNQ"
        },
        {
          "name": "肯考迪娅",
          "code": "COC"
        },
        {
          "name": "科尔多瓦",
          "code": "COR"
        },
        {
          "name": "里瓦达维亚海军准将城",
          "code": "CRD"
        },
        {
          "name": "卡塔马卡",
          "code": "CTC"
        },
        {
          "name": "福莫萨",
          "code": "FMA"
        },
        {
          "name": "拉里奥哈",
          "code": "IRJ"
        },
        {
          "name": "胡胡伊",
          "code": "JUJ"
        },
        {
          "name": "拉普拉塔",
          "code": "LPG"
        },
        {
          "name": "圣路易斯",
          "code": "LUQ"
        },
        {
          "name": "马德普拉塔",
          "code": "MDQ"
        },
        {
          "name": "门多萨",
          "code": "MDZ"
        },
        {
          "name": "内乌肯",
          "code": "NQN"
        },
        {
          "name": "巴拉那",
          "code": "PRA"
        },
        {
          "name": "波萨达斯",
          "code": "PSS"
        },
        {
          "name": "里奥夸尔托",
          "code": "RCU"
        },
        {
          "name": "特雷利乌",
          "code": "REL"
        },
        {
          "name": "雷西斯滕匹亚",
          "code": "RES"
        },
        {
          "name": "里奥加耶戈斯",
          "code": "RGL"
        },
        {
          "name": "罗萨里奥",
          "code": "ROS"
        },
        {
          "name": "圣罗莎",
          "code": "RSA"
        },
        {
          "name": "罗森",
          "code": "RWO"
        },
        {
          "name": "圣地亚哥-德尔埃斯特罗",
          "code": "SDE"
        },
        {
          "name": "圣菲",
          "code": "SFN"
        },
        {
          "name": "萨尔塔",
          "code": "SLA"
        },
        {
          "name": "圣米格尔-德图库曼",
          "code": "SMC"
        },
        {
          "name": "圣尼古拉斯",
          "code": "SNS"
        },
        {
          "name": "圣胡安",
          "code": "UAQ"
        },
        {
          "name": "乌斯怀亚",
          "code": "USH"
        },
        {
          "name": "别德马",
          "code": "VDM"
        },
        {
          "name": "克劳斯城",
          "code": "VLK"
        }
      ]
    }
  },
  {
    "name": "亚美尼亚",
    "code": "ARM",
    "children": {
      "children": [
        {
          "name": "阿拉加措特恩",
          "code": "AGT"
        },
        {
          "name": "阿拉拉特",
          "code": "ARA"
        },
        {
          "name": "阿尔马维尔",
          "code": "ARM"
        },
        {
          "name": "埃里温市",
          "code": "EVN"
        },
        {
          "name": "格加尔库尼克",
          "code": "GEG"
        },
        {
          "name": "科泰克",
          "code": "KOT"
        },
        {
          "name": "洛里",
          "code": "LOR"
        },
        {
          "name": "希拉克",
          "code": "SHI"
        },
        {
          "name": "休尼克",
          "code": "SYU"
        },
        {
          "name": "塔武什",
          "code": "TAV"
        },
        {
          "name": "瓦约茨·佐尔",
          "code": "VAY"
        }
      ]
    }
  },
  {
    "name": "阿森松岛",
    "code": "ASC"
  },
  {
    "name": "美属萨摩亚",
    "code": "ASM",
    "children": {
      "children": [
        {
          "name": "阿纳",
          "code": "AAN"
        },
        {
          "name": "艾加伊勒泰",
          "code": "AIT"
        },
        {
          "name": "阿图阿",
          "code": "ATU"
        },
        {
          "name": "法塞莱莱阿加",
          "code": "FAA"
        },
        {
          "name": "加盖福毛加",
          "code": "GFG"
        },
        {
          "name": "加加埃毛加",
          "code": "GMG"
        },
        {
          "name": "帕劳利",
          "code": "PAL"
        },
        {
          "name": "萨图帕伊泰阿",
          "code": "SAT"
        },
        {
          "name": "萨瓦伊岛",
          "code": "SAV"
        },
        {
          "name": "图阿马萨加",
          "code": "TUA"
        },
        {
          "name": "乌波卢岛",
          "code": "UPO"
        },
        {
          "name": "瓦奥福诺蒂",
          "code": "VAF"
        },
        {
          "name": "韦西加诺",
          "code": "VAI"
        }
      ]
    }
  },
  {
    "name": "南极洲",
    "code": "ATA"
  },
  {
    "name": "法属南部领地",
    "code": "ATF"
  },
  {
    "name": "安提瓜岛和巴布达",
    "code": "ATG"
  },
  {
    "name": "澳大利亚",
    "code": "AUS",
    "children": [
      {
        "name": "堪培拉",
        "code": "ACT",
        "children": {
          "name": "堪培拉",
          "code": "CBR"
        }
      },
      {
        "name": "昆士兰",
        "code": "QLD",
        "children": [
          {
            "name": "布里斯班",
            "code": "BNE"
          },
          {
            "name": "凯恩斯",
            "code": "CNS"
          },
          {
            "name": "日光海岸",
            "code": "CUD"
          },
          {
            "name": "黄金海岸",
            "code": "OOL"
          },
          {
            "name": "汤斯维尔",
            "code": "TSV"
          },
          {
            "name": "图文巴",
            "code": "TWB"
          }
        ]
      },
      {
        "name": "新南威尔士",
        "code": "NSW",
        "children": [
          {
            "name": "悉尼",
            "code": "HBS"
          },
          {
            "name": "纽卡斯尔",
            "code": "NTL"
          },
          {
            "name": "伍伦贡",
            "code": "WOL"
          }
        ]
      },
      {
        "name": "北部地区",
        "code": "NT",
        "children": [
          {
            "name": "达尔文",
            "code": "DRW"
          },
          {
            "name": "北帕默斯顿",
            "code": "PAL"
          }
        ]
      },
      {
        "name": "南澳大利亚",
        "code": "SA",
        "children": [
          {
            "name": "阿德莱德",
            "code": "ADL"
          },
          {
            "name": "甘比亚山",
            "code": "MGB"
          },
          {
            "name": "默里布里奇",
            "code": "MYB"
          },
          {
            "name": "林肯港",
            "code": "PLO"
          },
          {
            "name": "皮里港",
            "code": "PPI"
          },
          {
            "name": "奥古斯塔港",
            "code": "PUG"
          },
          {
            "name": "维克托港",
            "code": "VHA"
          },
          {
            "name": "怀阿拉",
            "code": "WAY"
          }
        ]
      },
      {
        "name": "塔斯马尼亚",
        "code": "TAS",
        "children": [
          {
            "name": "伯尼港",
            "code": "BWT"
          },
          {
            "name": "德文波特",
            "code": "DPO"
          },
          {
            "name": "霍巴特",
            "code": "HBA"
          },
          {
            "name": "朗塞斯顿",
            "code": "LST"
          }
        ]
      },
      {
        "name": "维多利亚",
        "code": "VIC",
        "children": [
          {
            "name": "吉朗",
            "code": "GEX"
          },
          {
            "name": "墨尔本",
            "code": "MEL"
          }
        ]
      },
      {
        "name": "西澳大利亚",
        "code": "WA",
        "children": [
          {
            "name": "奥尔巴尼",
            "code": "ALH"
          },
          {
            "name": "班伯里",
            "code": "BUY"
          },
          {
            "name": "弗里曼特尔港",
            "code": "FRE"
          },
          {
            "name": "杰拉尔顿",
            "code": "GET"
          },
          {
            "name": "卡尔古利",
            "code": "KGI"
          },
          {
            "name": "曼哲拉",
            "code": "MDU"
          },
          {
            "name": "珀斯",
            "code": "PER"
          }
        ]
      }
    ]
  },
  {
    "name": "奥地利",
    "code": "AUT",
    "children": {
      "children": [
        {
          "name": "布尔根兰",
          "code": "BUR"
        },
        {
          "name": "克恩顿",
          "code": "CAT"
        },
        {
          "name": "下奥地利",
          "code": "LAU"
        },
        {
          "name": "施蒂利亚",
          "code": "STY"
        },
        {
          "name": "萨尔茨堡",
          "code": "SZG"
        },
        {
          "name": "蒂罗尔",
          "code": "TYR"
        },
        {
          "name": "上奥地利",
          "code": "UAU"
        },
        {
          "name": "维也纳",
          "code": "VDD"
        },
        {
          "name": "福拉尔贝格",
          "code": "VOR"
        }
      ]
    }
  },
  {
    "name": "阿塞拜疆",
    "code": "AZE",
    "children": {
      "children": [
        {
          "name": "阿布歇隆",
          "code": "ABS"
        },
        {
          "name": "占贾",
          "code": "GA"
        },
        {
          "name": "哈奇马斯",
          "code": "XAC"
        },
        {
          "name": "卡尔巴卡尔",
          "code": "KAL"
        },
        {
          "name": "卡扎赫",
          "code": "QAZ"
        },
        {
          "name": "连科兰",
          "code": "LAN"
        },
        {
          "name": "密尔-卡拉巴赫",
          "code": "MQA"
        },
        {
          "name": "穆甘-萨连",
          "code": "MSA"
        },
        {
          "name": "纳希切万",
          "code": "NX"
        },
        {
          "name": "纳戈尔诺－卡拉巴赫",
          "code": "NQA"
        },
        {
          "name": "普利亚拉克斯",
          "code": "PRI"
        },
        {
          "name": "舍基",
          "code": "SA"
        },
        {
          "name": "锡尔万",
          "code": "SIR"
        },
        {
          "name": "苏姆盖特",
          "code": "SMC"
        }
      ]
    }
  },
  {
    "name": "布隆迪",
    "code": "BDI",
    "children": {
      "children": [
        {
          "name": "布班扎",
          "code": "BB"
        },
        {
          "name": "布琼布拉城市",
          "code": "BM"
        },
        {
          "name": "布鲁里",
          "code": "BR"
        },
        {
          "name": "布琼布拉乡村",
          "code": "BU"
        },
        {
          "name": "坎库佐",
          "code": "CA"
        },
        {
          "name": "锡比托凯",
          "code": "CI"
        },
        {
          "name": "基特加",
          "code": "GI"
        },
        {
          "name": "基龙多",
          "code": "KI"
        },
        {
          "name": "卡鲁济",
          "code": "KR"
        },
        {
          "name": "卡扬扎",
          "code": "KY"
        },
        {
          "name": "马坎巴",
          "code": "MA"
        },
        {
          "name": "穆拉姆维亚",
          "code": "MU"
        },
        {
          "name": "穆瓦洛",
          "code": "MW"
        },
        {
          "name": "穆因加",
          "code": "MY"
        },
        {
          "name": "恩戈齐",
          "code": "NG"
        },
        {
          "name": "鲁塔纳",
          "code": "RT"
        },
        {
          "name": "鲁伊吉",
          "code": "RY"
        }
      ]
    }
  },
  {
    "name": "比利时",
    "code": "BEL",
    "children": {
      "children": [
        {
          "name": "布鲁塞尔",
          "code": "BRU"
        },
        {
          "name": "安特卫普",
          "code": "VAN"
        },
        {
          "name": "佛兰芒-布拉班特",
          "code": "VBR"
        },
        {
          "name": "林堡",
          "code": "VLI"
        },
        {
          "name": "东佛兰德",
          "code": "VOV"
        },
        {
          "name": "西佛兰德",
          "code": "VWV"
        },
        {
          "name": "布拉班特-瓦隆",
          "code": "WBR"
        },
        {
          "name": "埃诺",
          "code": "WHT"
        },
        {
          "name": "列日",
          "code": "WLG"
        },
        {
          "name": "卢森堡",
          "code": "WLX"
        },
        {
          "name": "那慕尔",
          "code": "WNA"
        }
      ]
    }
  },
  {
    "name": "贝宁",
    "code": "BEN",
    "children": {
      "children": [
        {
          "name": "阿塔科拉",
          "code": "AK"
        },
        {
          "name": "大西洋",
          "code": "AQ"
        },
        {
          "name": "阿黎博里",
          "code": "AL"
        },
        {
          "name": "博尔古",
          "code": "BO"
        },
        {
          "name": "波希康市",
          "code": "BOH"
        },
        {
          "name": "丘陵",
          "code": "CO"
        },
        {
          "name": "峡谷",
          "code": "DO"
        },
        {
          "name": "库福",
          "code": "KO"
        },
        {
          "name": "滨海",
          "code": "LI"
        },
        {
          "name": "莫诺",
          "code": "MO"
        },
        {
          "name": "韦梅",
          "code": "OU"
        },
        {
          "name": "高原",
          "code": "PL"
        },
        {
          "name": "祖",
          "code": "ZO"
        }
      ]
    }
  },
  {
    "name": "布基纳法索",
    "code": "BFA",
    "children": {
      "children": [
        {
          "name": "巴雷",
          "code": "BAL"
        },
        {
          "name": "巴姆",
          "code": "BAM"
        },
        {
          "name": "巴瓦",
          "code": "BAN"
        },
        {
          "name": "巴泽加",
          "code": "BAZ"
        },
        {
          "name": "布尔古",
          "code": "BLG"
        },
        {
          "name": "布尔基恩德",
          "code": "BOK"
        },
        {
          "name": "布古里巴",
          "code": "BOR"
        },
        {
          "name": "科莫埃",
          "code": "COM"
        },
        {
          "name": "冈祖尔古",
          "code": "GAN"
        },
        {
          "name": "尼亚尼亚",
          "code": "GNA"
        },
        {
          "name": "古尔马",
          "code": "GOU"
        },
        {
          "name": "乌埃",
          "code": "HOU"
        },
        {
          "name": "伊奥巴",
          "code": "IOA"
        },
        {
          "name": "卡焦戈",
          "code": "KAD"
        },
        {
          "name": "凯内杜古",
          "code": "KEN"
        },
        {
          "name": "库尔佩罗戈",
          "code": "KOL"
        },
        {
          "name": "科蒙加里",
          "code": "KOO"
        },
        {
          "name": "孔皮恩加",
          "code": "KOP"
        },
        {
          "name": "孔西",
          "code": "KOS"
        },
        {
          "name": "库里滕加",
          "code": "KOT"
        },
        {
          "name": "库尔维奥戈",
          "code": "KOW"
        },
        {
          "name": "雷拉巴",
          "code": "LER"
        },
        {
          "name": "罗卢姆",
          "code": "LOR"
        },
        {
          "name": "穆翁",
          "code": "MOU"
        },
        {
          "name": "纳乌里",
          "code": "NAH"
        },
        {
          "name": "纳门滕加",
          "code": "NAM"
        },
        {
          "name": "纳亚拉",
          "code": "NAY"
        },
        {
          "name": "努姆比埃尔",
          "code": "NOU"
        },
        {
          "name": "乌布里滕加",
          "code": "OUB"
        },
        {
          "name": "乌达兰",
          "code": "OUD"
        },
        {
          "name": "帕索雷",
          "code": "PAS"
        },
        {
          "name": "波尼",
          "code": "PON"
        },
        {
          "name": "桑吉",
          "code": "SAG"
        },
        {
          "name": "桑马滕加",
          "code": "SAM"
        },
        {
          "name": "塞诺",
          "code": "SEN"
        },
        {
          "name": "锡西里",
          "code": "SIS"
        },
        {
          "name": "苏姆",
          "code": "SOM"
        },
        {
          "name": "苏鲁",
          "code": "SOR"
        },
        {
          "name": "塔波阿",
          "code": "TAP"
        },
        {
          "name": "图伊",
          "code": "TUY"
        },
        {
          "name": "亚加",
          "code": "YAG"
        },
        {
          "name": "亚滕加",
          "code": "YAT"
        },
        {
          "name": "济罗",
          "code": "ZIR"
        },
        {
          "name": "宗多马",
          "code": "ZOD"
        },
        {
          "name": "宗德韦奥戈",
          "code": "ZOW"
        }
      ]
    }
  },
  {
    "name": "孟加拉",
    "code": "BGD",
    "children": {
      "children": [
        {
          "name": "吉大港",
          "code": "CGP"
        },
        {
          "name": "达卡",
          "code": "DAC"
        },
        {
          "name": "库尔纳",
          "code": "KHL"
        }
      ]
    }
  },
  {
    "name": "保加利亚",
    "code": "BGR",
    "children": {
      "children": [
        {
          "name": "布尔加斯",
          "code": "BOJ"
        },
        {
          "name": "索非亚市",
          "code": "GSO"
        },
        {
          "name": "卡斯科伏",
          "code": "KHO"
        },
        {
          "name": "洛维奇",
          "code": "LVP"
        },
        {
          "name": "蒙塔纳",
          "code": "OZA"
        },
        {
          "name": "普罗夫迪夫",
          "code": "PDV"
        },
        {
          "name": "鲁塞",
          "code": "ROU"
        },
        {
          "name": "索非亚",
          "code": "SOF"
        },
        {
          "name": "瓦尔纳",
          "code": "VAR"
        }
      ]
    }
  },
  {
    "name": "巴林",
    "code": "BHR",
    "children": {
      "children": [
        {
          "name": "哈德",
          "code": "1"
        },
        {
          "name": "西部",
          "code": "10"
        },
        {
          "name": "哈马德",
          "code": "12"
        },
        {
          "name": "穆哈拉格",
          "code": "2"
        },
        {
          "name": "麦纳麦",
          "code": "3"
        },
        {
          "name": "北部",
          "code": "5"
        },
        {
          "name": "中部",
          "code": "7"
        },
        {
          "name": "伊萨城",
          "code": "8"
        },
        {
          "name": "里法",
          "code": "9"
        }
      ]
    }
  },
  {
    "name": "巴哈马",
    "code": "BHS"
  },
  {
    "name": "波斯尼亚和黑塞哥维那",
    "code": "BIH",
    "children": {
      "children": [
        {
          "name": "波斯尼亚－波德里涅",
          "code": "FBP"
        },
        {
          "name": "西波斯尼亚",
          "code": "FHB"
        },
        {
          "name": "黑塞哥维那－涅雷特瓦",
          "code": "FHN"
        },
        {
          "name": "波萨维纳",
          "code": "FPO"
        },
        {
          "name": "萨拉热窝",
          "code": "FSA"
        },
        {
          "name": "中波斯尼亚",
          "code": "FSB"
        },
        {
          "name": "多米斯拉夫格勒",
          "code": "FTO"
        },
        {
          "name": "图兹拉－波德里涅",
          "code": "FTU"
        },
        {
          "name": "乌纳－萨纳",
          "code": "FUS"
        },
        {
          "name": "泽尼察－多博伊",
          "code": "FZE"
        },
        {
          "name": "西黑塞哥维那",
          "code": "FZH"
        }
      ]
    }
  },
  {
    "name": "白俄罗斯",
    "code": "BLR",
    "children": {
      "children": [
        {
          "name": "布列斯特",
          "code": "BR"
        },
        {
          "name": "戈梅利",
          "code": "HO"
        },
        {
          "name": "格罗德诺",
          "code": "HR"
        },
        {
          "name": "莫吉廖夫",
          "code": "MA"
        },
        {
          "name": "明斯克市",
          "code": "MI"
        },
        {
          "name": "维捷布斯克",
          "code": "VI"
        }
      ]
    }
  },
  {
    "name": "伯利兹",
    "code": "BLZ",
    "children": {
      "children": [
        {
          "name": "伯利兹",
          "code": "BZ"
        },
        {
          "name": "科罗萨尔",
          "code": "CR"
        },
        {
          "name": "卡约",
          "code": "CY"
        },
        {
          "name": "橘园",
          "code": "OW"
        },
        {
          "name": "斯坦港",
          "code": "SC"
        },
        {
          "name": "托莱多",
          "code": "TO"
        }
      ]
    }
  },
  {
    "name": "百慕大",
    "code": "BMU"
  },
  {
    "name": "玻利维亚",
    "code": "BOL",
    "children": {
      "children": [
        {
          "name": "奥尔托",
          "code": "ALT"
        },
        {
          "name": "贝尼",
          "code": "BEN"
        },
        {
          "name": "科恰班巴",
          "code": "CBB"
        },
        {
          "name": "丘基萨卡",
          "code": "CHU"
        },
        {
          "name": "基拉科洛",
          "code": "QUI"
        },
        {
          "name": "拉巴斯",
          "code": "LPB"
        },
        {
          "name": "奥鲁罗",
          "code": "ORU"
        },
        {
          "name": "潘多",
          "code": "PAN"
        },
        {
          "name": "波多西",
          "code": "POI"
        },
        {
          "name": "萨卡巴",
          "code": "SAC"
        },
        {
          "name": "圣克鲁斯",
          "code": "SRZ"
        },
        {
          "name": "塔里哈",
          "code": "TJA"
        }
      ]
    }
  },
  {
    "name": "巴西",
    "code": "BRA",
    "children": {
      "children": [
        {
          "name": "阿克里",
          "code": "AC"
        },
        {
          "name": "阿拉戈斯",
          "code": "AL"
        },
        {
          "name": "亚马孙",
          "code": "AM"
        },
        {
          "name": "阿马帕",
          "code": "AP"
        },
        {
          "name": "巴伊亚",
          "code": "BA"
        },
        {
          "name": "巴西利亚",
          "code": "BSB"
        },
        {
          "name": "塞阿拉",
          "code": "CE"
        },
        {
          "name": "圣埃斯皮里图",
          "code": "ES"
        },
        {
          "name": "戈亚斯",
          "code": "GO"
        },
        {
          "name": "马拉尼昂",
          "code": "MA"
        },
        {
          "name": "米纳斯吉拉斯",
          "code": "MG"
        },
        {
          "name": "南马托格罗索",
          "code": "MS"
        },
        {
          "name": "马托格罗索",
          "code": "MT"
        },
        {
          "name": "帕拉",
          "code": "PA"
        },
        {
          "name": "帕拉伊巴",
          "code": "PB"
        },
        {
          "name": "伯南布哥",
          "code": "PE"
        },
        {
          "name": "皮奥伊",
          "code": "PI"
        },
        {
          "name": "巴拉那",
          "code": "PR"
        },
        {
          "name": "里约热内卢",
          "code": "RJ"
        },
        {
          "name": "北里奥格兰德",
          "code": "RN"
        },
        {
          "name": "朗多尼亚",
          "code": "RO"
        },
        {
          "name": "罗赖马",
          "code": "RR"
        },
        {
          "name": "南里奥格兰德",
          "code": "RS"
        },
        {
          "name": "圣卡塔琳娜",
          "code": "SC"
        },
        {
          "name": "塞尔希培",
          "code": "SE"
        },
        {
          "name": "圣保罗",
          "code": "SP"
        },
        {
          "name": "托坎廷斯",
          "code": "TO"
        }
      ]
    }
  },
  {
    "name": "巴巴多斯岛",
    "code": "BRB"
  },
  {
    "name": "文莱",
    "code": "BRN"
  },
  {
    "name": "不丹",
    "code": "BTN"
  },
  {
    "name": "布韦岛",
    "code": "BVT"
  },
  {
    "name": "博茨瓦纳",
    "code": "BWA"
  },
  {
    "name": "中非共和国",
    "code": "CAF",
    "children": {
      "children": [
        {
          "name": "瓦姆",
          "code": "AC"
        },
        {
          "name": "巴明吉-班戈兰",
          "code": "BB"
        },
        {
          "name": "班吉直辖市",
          "code": "BGF"
        },
        {
          "name": "宾博",
          "code": "BI"
        },
        {
          "name": "下科托",
          "code": "BK"
        },
        {
          "name": "上科托",
          "code": "HK"
        },
        {
          "name": "上姆博穆",
          "code": "HM"
        },
        {
          "name": "曼贝雷-卡代",
          "code": "HS"
        },
        {
          "name": "纳纳-格里比齐",
          "code": "KB"
        },
        {
          "name": "凯莫",
          "code": "KG"
        },
        {
          "name": "洛巴伊",
          "code": "LB"
        },
        {
          "name": "姆博穆",
          "code": "MB"
        },
        {
          "name": "翁贝拉-姆波科",
          "code": "MP"
        },
        {
          "name": "纳纳-曼贝雷",
          "code": "NM"
        },
        {
          "name": "瓦姆-彭代",
          "code": "OP"
        },
        {
          "name": "桑加-姆巴埃雷",
          "code": "SE"
        },
        {
          "name": "瓦卡",
          "code": "UK"
        },
        {
          "name": "瓦卡加",
          "code": "VK"
        }
      ]
    }
  },
  {
    "name": "加拿大",
    "code": "CAN",
    "children": {
      "children": [
        {
          "name": "阿伯茨福",
          "code": "ABB"
        },
        {
          "name": "巴里",
          "code": "BAR"
        },
        {
          "name": "基奇纳",
          "code": "BRP"
        },
        {
          "name": "卡里加里",
          "code": "CAL"
        },
        {
          "name": "布列塔尼角",
          "code": "CBR"
        },
        {
          "name": "夏洛特敦",
          "code": "CHA"
        },
        {
          "name": "埃德蒙顿",
          "code": "EDM"
        },
        {
          "name": "弗雷德里顿",
          "code": "FRE"
        },
        {
          "name": "圭尔夫",
          "code": "GLP"
        },
        {
          "name": "哈利法克斯",
          "code": "HAL"
        },
        {
          "name": "哈密尔顿",
          "code": "HAM"
        },
        {
          "name": "伊魁特",
          "code": "IQL"
        },
        {
          "name": "金斯敦",
          "code": "KGN"
        },
        {
          "name": "基劳纳",
          "code": "KWL"
        },
        {
          "name": "魁北克",
          "code": "QUE"
        },
        {
          "name": "伦敦",
          "code": "LOD"
        },
        {
          "name": "蒙特利尔",
          "code": "MTR"
        },
        {
          "name": "奥沙瓦",
          "code": "OSH"
        },
        {
          "name": "渥太华",
          "code": "OTT"
        },
        {
          "name": "里贾纳",
          "code": "REG"
        },
        {
          "name": "萨斯卡通",
          "code": "SAK"
        },
        {
          "name": "舍布鲁克",
          "code": "SBE"
        },
        {
          "name": "圣卡塔琳娜",
          "code": "SCA"
        },
        {
          "name": "圣约翰斯",
          "code": "SJB"
        },
        {
          "name": "萨德伯里",
          "code": "SUD"
        },
        {
          "name": "桑德贝",
          "code": "THU"
        },
        {
          "name": "多伦多",
          "code": "TOR"
        },
        {
          "name": "三河城",
          "code": "TRR"
        },
        {
          "name": "温哥华",
          "code": "VAN"
        },
        {
          "name": "维多利亚",
          "code": "VIC"
        },
        {
          "name": "温莎",
          "code": "WDR"
        },
        {
          "name": "温尼伯",
          "code": "WNP"
        },
        {
          "name": "怀特霍斯",
          "code": "YXY"
        },
        {
          "name": "耶洛奈夫",
          "code": "YZF"
        }
      ]
    }
  },
  {
    "name": "科科斯群岛",
    "code": "CCK"
  },
  {
    "name": "瑞士",
    "code": "CHE",
    "children": {
      "children": [
        {
          "name": "阿尔高",
          "code": "AG"
        },
        {
          "name": "内阿彭策尔",
          "code": "AI"
        },
        {
          "name": "外阿彭策尔",
          "code": "AR"
        },
        {
          "name": "伯尔尼",
          "code": "BE"
        },
        {
          "name": "巴塞尔乡村",
          "code": "BL"
        },
        {
          "name": "巴塞尔城市",
          "code": "BS"
        },
        {
          "name": "弗里堡",
          "code": "FR"
        },
        {
          "name": "日内瓦",
          "code": "GE"
        },
        {
          "name": "格拉鲁斯",
          "code": "GL"
        },
        {
          "name": "格劳宾登",
          "code": "GR"
        },
        {
          "name": "汝拉",
          "code": "JU"
        },
        {
          "name": "洛桑",
          "code": "LA"
        },
        {
          "name": "卢塞恩",
          "code": "LU"
        },
        {
          "name": "纳沙泰尔",
          "code": "NE"
        },
        {
          "name": "下瓦尔登",
          "code": "NW"
        },
        {
          "name": "上瓦尔登",
          "code": "OW"
        },
        {
          "name": "圣加仑",
          "code": "SG"
        },
        {
          "name": "沙夫豪森",
          "code": "SH"
        },
        {
          "name": "索洛图恩",
          "code": "SO"
        },
        {
          "name": "施维茨",
          "code": "SZ"
        },
        {
          "name": "图尔高",
          "code": "TG"
        },
        {
          "name": "提契诺",
          "code": "TI"
        },
        {
          "name": "乌里",
          "code": "UR"
        },
        {
          "name": "沃",
          "code": "VD"
        },
        {
          "name": "瓦莱",
          "code": "VS"
        },
        {
          "name": "楚格",
          "code": "ZG"
        },
        {
          "name": "苏黎世",
          "code": "ZH"
        }
      ]
    }
  },
  {
    "name": "智利",
    "code": "CHL",
    "children": {
      "children": [
        {
          "name": "伊瓦涅斯将军的艾森大区",
          "code": "AI"
        },
        {
          "name": "安托法加斯塔大区",
          "code": "AN"
        },
        {
          "name": "阿劳卡尼亚大区",
          "code": "AR"
        },
        {
          "name": "阿塔卡马大区",
          "code": "AT"
        },
        {
          "name": "比奥比奥大区",
          "code": "BI"
        },
        {
          "name": "科金博大区",
          "code": "CO"
        },
        {
          "name": "复活节岛",
          "code": "LI"
        },
        {
          "name": "湖大区",
          "code": "LL"
        },
        {
          "name": "麦哲伦-智利南极大区",
          "code": "MA"
        },
        {
          "name": "马乌莱大区",
          "code": "ML"
        },
        {
          "name": "圣地亚哥",
          "code": "RM"
        },
        {
          "name": "塔拉帕卡大区",
          "code": "TA"
        },
        {
          "name": "瓦尔帕莱索大区",
          "code": "VS"
        }
      ]
    }
  },
  {
    "name": "圣诞岛",
    "code": "CXR"
  },
  {
    "name": "科特迪瓦",
    "code": "CIV",
    "children": {
      "children": [
        {
          "name": "阿涅比",
          "code": "AG"
        },
        {
          "name": "巴芬",
          "code": "BF"
        },
        {
          "name": "下萨桑德拉",
          "code": "BS"
        },
        {
          "name": "登盖莱",
          "code": "DE"
        },
        {
          "name": "山地",
          "code": "DH"
        },
        {
          "name": "弗罗马格尔",
          "code": "FR"
        },
        {
          "name": "萨桑德拉",
          "code": "HT"
        },
        {
          "name": "湖泊",
          "code": "LC"
        },
        {
          "name": "泻湖",
          "code": "LG"
        },
        {
          "name": "中科莫埃",
          "code": "MC"
        },
        {
          "name": "马拉韦",
          "code": "MR"
        },
        {
          "name": "中卡瓦利",
          "code": "MV"
        },
        {
          "name": "恩济－科莫埃",
          "code": "NC"
        },
        {
          "name": "南邦达马",
          "code": "SB"
        },
        {
          "name": "南科莫埃",
          "code": "SC"
        },
        {
          "name": "萨瓦纳",
          "code": "SV"
        },
        {
          "name": "邦达马河谷",
          "code": "VB"
        },
        {
          "name": "沃罗杜古",
          "code": "WR"
        },
        {
          "name": "赞赞",
          "code": "ZA"
        }
      ]
    }
  },
  {
    "name": "喀麦隆",
    "code": "CMR",
    "children": {
      "children": [
        {
          "name": "阿达马瓦",
          "code": "ADA"
        },
        {
          "name": "中央",
          "code": "CEN"
        },
        {
          "name": "北端",
          "code": "EXN"
        },
        {
          "name": "东部",
          "code": "EST"
        },
        {
          "name": "滨海",
          "code": "LIT"
        },
        {
          "name": "北部",
          "code": "NOR"
        },
        {
          "name": "西北",
          "code": "NOT"
        },
        {
          "name": "西部",
          "code": "OUE"
        },
        {
          "name": "西南",
          "code": "SOU"
        },
        {
          "name": "南部",
          "code": "SUD"
        }
      ]
    }
  },
  {
    "name": "刚果民主共和国",
    "code": "COD"
  },
  {
    "name": "刚果",
    "code": "COG"
  },
  {
    "name": "库克群岛",
    "code": "COK"
  },
  {
    "name": "哥伦比亚",
    "code": "COL",
    "children": {
      "children": [
        {
          "name": "亚马孙",
          "code": "AMZ"
        },
        {
          "name": "安提奥基亚",
          "code": "ANT"
        },
        {
          "name": "阿劳卡",
          "code": "ARA"
        },
        {
          "name": "大西洋",
          "code": "ATL"
        },
        {
          "name": "波哥大首都区",
          "code": "BDC"
        },
        {
          "name": "博利瓦尔",
          "code": "BOL"
        },
        {
          "name": "博亚卡",
          "code": "BOY"
        },
        {
          "name": "卡克塔",
          "code": "CAQ"
        },
        {
          "name": "卡尔达斯",
          "code": "CAL"
        },
        {
          "name": "昆迪纳马卡",
          "code": "CAM"
        },
        {
          "name": "卡萨纳雷",
          "code": "CAS"
        },
        {
          "name": "考卡",
          "code": "CAU"
        },
        {
          "name": "塞萨尔",
          "code": "CES"
        },
        {
          "name": "乔科",
          "code": "CHO"
        },
        {
          "name": "科尔多巴",
          "code": "COR"
        },
        {
          "name": "瓜希拉",
          "code": "GJR"
        },
        {
          "name": "瓜伊尼亚",
          "code": "GNA"
        },
        {
          "name": "瓜维亚雷",
          "code": "GVR"
        },
        {
          "name": "乌伊拉",
          "code": "HUI"
        },
        {
          "name": "金迪奥",
          "code": "QUI"
        },
        {
          "name": "马格达雷那",
          "code": "MAG"
        },
        {
          "name": "梅塔",
          "code": "MET"
        },
        {
          "name": "纳里尼奥",
          "code": "NAR"
        },
        {
          "name": "北桑坦德",
          "code": "NDS"
        },
        {
          "name": "普图马约",
          "code": "PUT"
        },
        {
          "name": "利萨拉尔达",
          "code": "RIS"
        },
        {
          "name": "桑坦德",
          "code": "SAN"
        },
        {
          "name": "圣安德烈斯-普罗维登西亚",
          "code": "SAP"
        },
        {
          "name": "苏克雷",
          "code": "SUC"
        },
        {
          "name": "托利马",
          "code": "TOL"
        },
        {
          "name": "沃佩斯",
          "code": "VAU"
        },
        {
          "name": "考卡山谷",
          "code": "VDC"
        },
        {
          "name": "维查达",
          "code": "VIC"
        }
      ]
    }
  },
  {
    "name": "科摩罗",
    "code": "COM"
  },
  {
    "name": "佛得角",
    "code": "CPV",
    "children": {
      "children": [
        {
          "name": "布拉瓦岛",
          "code": "BR"
        },
        {
          "name": "博阿维斯塔岛",
          "code": "BV"
        },
        {
          "name": "圣卡塔琳娜",
          "code": "CA"
        },
        {
          "name": "圣克鲁斯",
          "code": "CR"
        },
        {
          "name": "福古岛",
          "code": "FO"
        },
        {
          "name": "圣地亚哥岛",
          "code": "IA"
        },
        {
          "name": "马尤岛",
          "code": "MA"
        },
        {
          "name": "莫斯特罗",
          "code": "MO"
        },
        {
          "name": "保尔",
          "code": "PA"
        },
        {
          "name": "波多诺伏",
          "code": "PN"
        },
        {
          "name": "普拉亚",
          "code": "PR"
        },
        {
          "name": "大里贝拉",
          "code": "RG"
        },
        {
          "name": "圣安唐岛",
          "code": "SA"
        },
        {
          "name": "圣多明戈",
          "code": "SD"
        },
        {
          "name": "圣菲利普",
          "code": "SF"
        },
        {
          "name": "萨尔岛",
          "code": "SL"
        },
        {
          "name": "圣米戈尔",
          "code": "SM"
        },
        {
          "name": "圣尼古拉岛",
          "code": "SN"
        },
        {
          "name": "圣维森特岛",
          "code": "SV"
        },
        {
          "name": "塔拉法尔",
          "code": "TA"
        }
      ]
    }
  },
  {
    "name": "哥斯达黎加",
    "code": "CRI",
    "children": {
      "children": [
        {
          "name": "阿拉胡埃拉",
          "code": "A"
        },
        {
          "name": "卡塔戈",
          "code": "C"
        },
        {
          "name": "瓜纳卡斯特",
          "code": "G"
        },
        {
          "name": "埃雷迪亚",
          "code": "H"
        },
        {
          "name": "利蒙",
          "code": "L"
        },
        {
          "name": "蓬塔雷纳斯",
          "code": "P"
        },
        {
          "name": "圣何塞",
          "code": "SJ"
        }
      ]
    }
  },
  {
    "name": "古巴",
    "code": "CUB",
    "children": {
      "children": [
        {
          "name": "比那尔德里奥",
          "code": "1"
        },
        {
          "name": "拉斯图纳斯",
          "code": "10"
        },
        {
          "name": "奥尔金",
          "code": "11"
        },
        {
          "name": "格拉玛",
          "code": "12"
        },
        {
          "name": "圣地亚哥",
          "code": "13"
        },
        {
          "name": "关塔那摩",
          "code": "14"
        },
        {
          "name": "哈瓦那",
          "code": "2"
        },
        {
          "name": "哈瓦那城",
          "code": "3"
        },
        {
          "name": "马坦萨斯",
          "code": "4"
        },
        {
          "name": "比亚克拉拉",
          "code": "5"
        },
        {
          "name": "西恩富戈斯",
          "code": "6"
        },
        {
          "name": "圣斯皮里图斯",
          "code": "7"
        },
        {
          "name": "谢戈德阿维拉",
          "code": "8"
        },
        {
          "name": "卡马圭",
          "code": "9"
        },
        {
          "name": "青年岛特区",
          "code": "99"
        },
        {
          "name": "马亚里",
          "code": "MAY"
        },
        {
          "name": "曼萨尼罗",
          "code": "MZO"
        }
      ]
    }
  },
  {
    "name": "开曼群岛",
    "code": "CYM"
  },
  {
    "name": "塞浦路斯",
    "code": "CYP",
    "children": {
      "children": [
        {
          "name": "尼科西亚",
          "code": "1"
        },
        {
          "name": "利马索尔",
          "code": "2"
        },
        {
          "name": "拉纳卡",
          "code": "3"
        },
        {
          "name": "法马古斯塔",
          "code": "4"
        },
        {
          "name": "帕福斯",
          "code": "5"
        },
        {
          "name": "凯里尼亚",
          "code": "6"
        }
      ]
    }
  },
  {
    "name": "捷克共和国",
    "code": "CZE",
    "children": {
      "children": [
        {
          "name": "南摩拉维亚",
          "code": "JC"
        },
        {
          "name": "卡罗维发利",
          "code": "KA"
        },
        {
          "name": "赫拉德茨-克拉洛韦",
          "code": "KR"
        },
        {
          "name": "利贝雷克",
          "code": "LI"
        },
        {
          "name": "摩拉维亚-西里西亚",
          "code": "MO"
        },
        {
          "name": "奥洛穆茨",
          "code": "OL"
        },
        {
          "name": "帕尔杜比采",
          "code": "PA"
        },
        {
          "name": "比尔森",
          "code": "PL"
        },
        {
          "name": "布拉格直辖市",
          "code": "PR"
        },
        {
          "name": "中捷克",
          "code": "ST"
        },
        {
          "name": "乌斯季",
          "code": "US"
        },
        {
          "name": "维索基纳",
          "code": "VY"
        },
        {
          "name": "兹林",
          "code": "ZL"
        }
      ]
    }
  },
  {
    "name": "德国",
    "code": "DEU",
    "children": {
      "children": [
        {
          "name": "奥格斯堡",
          "code": "AGB"
        },
        {
          "name": "安斯巴格",
          "code": "ANS"
        },
        {
          "name": "阿恩斯贝格",
          "code": "ARN"
        },
        {
          "name": "柏林",
          "code": "BE"
        },
        {
          "name": "比勒费尔德",
          "code": "BFE"
        },
        {
          "name": "波鸿",
          "code": "BOM"
        },
        {
          "name": "不伦瑞克",
          "code": "BRW"
        },
        {
          "name": "拜伊罗特",
          "code": "BYU"
        },
        {
          "name": "科隆",
          "code": "CGN"
        },
        {
          "name": "开姆尼斯",
          "code": "CHE"
        },
        {
          "name": "达姆施塔特",
          "code": "DAR"
        },
        {
          "name": "德绍",
          "code": "DES"
        },
        {
          "name": "代特莫尔特",
          "code": "DET"
        },
        {
          "name": "德累斯顿",
          "code": "DRS"
        },
        {
          "name": "杜塞尔多夫",
          "code": "DUS"
        },
        {
          "name": "爱尔福特",
          "code": "ERF"
        },
        {
          "name": "弗赖堡",
          "code": "FBG"
        },
        {
          "name": "法兰克福",
          "code": "FFO"
        },
        {
          "name": "吉森",
          "code": "GBN"
        },
        {
          "name": "哈雷",
          "code": "HAE"
        },
        {
          "name": "汉诺威",
          "code": "HAJ"
        },
        {
          "name": "不来梅",
          "code": "HB"
        },
        {
          "name": "汉堡",
          "code": "HH"
        },
        {
          "name": "卡尔斯鲁厄",
          "code": "KAE"
        },
        {
          "name": "卡塞尔",
          "code": "KAS"
        },
        {
          "name": "基尔",
          "code": "KEL"
        },
        {
          "name": "科布伦次",
          "code": "KOB"
        },
        {
          "name": "吕讷堡",
          "code": "LBG"
        },
        {
          "name": "兰茨胡特",
          "code": "LDH"
        },
        {
          "name": "莱比锡",
          "code": "LEJ"
        },
        {
          "name": "马格德堡",
          "code": "MAG"
        },
        {
          "name": "美因兹",
          "code": "MAI"
        },
        {
          "name": "曼海姆",
          "code": "MHG"
        },
        {
          "name": "慕尼黑",
          "code": "MUC"
        },
        {
          "name": "明斯特",
          "code": "MUN"
        },
        {
          "name": "纽伦堡",
          "code": "NUE"
        },
        {
          "name": "波茨坦",
          "code": "POT"
        },
        {
          "name": "斯图加特",
          "code": "STR"
        },
        {
          "name": "什未林",
          "code": "SWH"
        },
        {
          "name": "特里尔",
          "code": "TRI"
        },
        {
          "name": "威斯巴登",
          "code": "WIB"
        },
        {
          "name": "维尔茨堡",
          "code": "WUG"
        }
      ]
    }
  },
  {
    "name": "吉布提",
    "code": "DJI",
    "children": {
      "children": [
        {
          "name": "迪基勒区",
          "code": "K"
        },
        {
          "name": "奥博克区",
          "code": "O"
        },
        {
          "name": "阿里萨比赫区",
          "code": "S"
        },
        {
          "name": "塔朱拉区",
          "code": "T"
        }
      ]
    }
  },
  {
    "name": "多米尼加",
    "code": "DMA"
  },
  {
    "name": "丹麦",
    "code": "DNK",
    "children": {
      "children": [
        {
          "name": "奥胡斯",
          "code": "AR"
        },
        {
          "name": "博恩霍尔姆",
          "code": "BO"
        },
        {
          "name": "哥本哈根",
          "code": "CPH"
        },
        {
          "name": "菲特烈堡",
          "code": "FRE"
        },
        {
          "name": "菲茵",
          "code": "FY"
        },
        {
          "name": "里伯",
          "code": "RIB"
        },
        {
          "name": "罗斯基勒",
          "code": "RKE"
        },
        {
          "name": "灵克宾",
          "code": "RKG"
        },
        {
          "name": "斯多斯特姆",
          "code": "ST"
        },
        {
          "name": "南日德兰",
          "code": "VBI"
        },
        {
          "name": "维厄勒",
          "code": "VEJ"
        },
        {
          "name": "维堡",
          "code": "VIB"
        },
        {
          "name": "西希兰",
          "code": "VS"
        },
        {
          "name": "北日德兰",
          "code": "VSV"
        }
      ]
    }
  },
  {
    "name": "多米尼加共和国",
    "code": "DOM"
  },
  {
    "name": "阿尔及利亚",
    "code": "DZA",
    "children": {
      "children": [
        {
          "name": "安纳巴",
          "code": "AAE"
        },
        {
          "name": "艾因·德夫拉",
          "code": "ADE"
        },
        {
          "name": "阿德拉尔",
          "code": "ADR"
        },
        {
          "name": "阿尔及尔",
          "code": "ALG"
        },
        {
          "name": "艾因·蒂姆尚特",
          "code": "ATE"
        },
        {
          "name": "巴特纳",
          "code": "BAT"
        },
        {
          "name": "贝沙尔",
          "code": "BEC"
        },
        {
          "name": "比斯克拉",
          "code": "BIS"
        },
        {
          "name": "贝贾亚",
          "code": "BJA"
        },
        {
          "name": "布利达",
          "code": "BLI"
        },
        {
          "name": "布依拉",
          "code": "BOA"
        },
        {
          "name": "布尔吉·布阿雷里吉",
          "code": "BOR"
        },
        {
          "name": "布迈德斯",
          "code": "BOU"
        },
        {
          "name": "谢里夫",
          "code": "CHL"
        },
        {
          "name": "君士坦丁",
          "code": "CZL"
        },
        {
          "name": "杰勒法",
          "code": "DJE"
        },
        {
          "name": "贝伊德",
          "code": "EBA"
        },
        {
          "name": "瓦德",
          "code": "EOU"
        },
        {
          "name": "塔里夫",
          "code": "ETA"
        },
        {
          "name": "盖尔达耶",
          "code": "GHA"
        },
        {
          "name": "盖尔马",
          "code": "GUE"
        },
        {
          "name": "伊利齐",
          "code": "ILL"
        },
        {
          "name": "提济乌祖",
          "code": "IOU"
        },
        {
          "name": "吉杰尔",
          "code": "JIJ"
        },
        {
          "name": "罕西拉",
          "code": "KHE"
        },
        {
          "name": "拉格瓦特",
          "code": "LAG"
        },
        {
          "name": "麦迪亚",
          "code": "MED"
        },
        {
          "name": "密拉",
          "code": "MIL"
        },
        {
          "name": "莫斯塔加纳姆",
          "code": "MOS"
        },
        {
          "name": "姆西拉",
          "code": "MSI"
        },
        {
          "name": "马斯卡拉",
          "code": "MUA"
        },
        {
          "name": "纳阿马",
          "code": "NAA"
        },
        {
          "name": "乌姆布阿基",
          "code": "OEB"
        },
        {
          "name": "奥兰",
          "code": "ORA"
        },
        {
          "name": "瓦尔格拉",
          "code": "OUA"
        },
        {
          "name": "赫利赞",
          "code": "REL"
        },
        {
          "name": "苏克·阿赫拉斯",
          "code": "SAH"
        },
        {
          "name": "赛伊达",
          "code": "SAI"
        },
        {
          "name": "西迪贝勒阿贝斯",
          "code": "SBA"
        },
        {
          "name": "塞蒂夫",
          "code": "SET"
        },
        {
          "name": "斯基克达",
          "code": "SKI"
        },
        {
          "name": "塔曼拉塞特",
          "code": "TAM"
        },
        {
          "name": "特贝萨",
          "code": "TEB"
        },
        {
          "name": "提亚雷特",
          "code": "TIA"
        },
        {
          "name": "廷杜夫",
          "code": "TIN"
        },
        {
          "name": "蒂巴扎",
          "code": "TIP"
        },
        {
          "name": "蒂斯姆西勒特",
          "code": "TIS"
        },
        {
          "name": "特莱姆森",
          "code": "TLE"
        }
      ]
    }
  },
  {
    "name": "厄瓜多尔",
    "code": "ECU",
    "children": {
      "children": [
        {
          "name": "阿苏艾",
          "code": "A"
        },
        {
          "name": "玻利瓦尔",
          "code": "B"
        },
        {
          "name": "卡尔奇",
          "code": "C"
        },
        {
          "name": "纳波，奥雷利亚纳",
          "code": "D"
        },
        {
          "name": "埃斯梅拉尔达斯",
          "code": "E"
        },
        {
          "name": "卡尼亚尔",
          "code": "F"
        },
        {
          "name": "瓜亚斯",
          "code": "G"
        },
        {
          "name": "钦博拉索",
          "code": "H"
        },
        {
          "name": "科托帕希",
          "code": "X"
        },
        {
          "name": "因巴布拉",
          "code": "I"
        },
        {
          "name": "洛哈",
          "code": "L"
        },
        {
          "name": "马纳比",
          "code": "M"
        },
        {
          "name": "埃尔奥罗",
          "code": "O"
        },
        {
          "name": "皮钦查",
          "code": "P"
        },
        {
          "name": "洛斯里奥斯",
          "code": "R"
        },
        {
          "name": "莫罗纳－圣地亚哥",
          "code": "S"
        },
        {
          "name": "通古拉瓦",
          "code": "T"
        },
        {
          "name": "苏昆毕奥斯",
          "code": "U"
        },
        {
          "name": "加拉帕戈斯",
          "code": "W"
        },
        {
          "name": "帕斯塔萨",
          "code": "Y"
        },
        {
          "name": "萨莫拉－钦奇佩",
          "code": "Z"
        }
      ]
    }
  },
  {
    "name": "埃及",
    "code": "EGY",
    "children": {
      "children": [
        {
          "name": "亚历山大",
          "code": "ALY"
        },
        {
          "name": "阿斯旺",
          "code": "ASW"
        },
        {
          "name": "开罗",
          "code": "CAI"
        },
        {
          "name": "古尔代盖",
          "code": "GBY"
        },
        {
          "name": "苏布拉开马",
          "code": "SKH"
        }
      ]
    }
  },
  {
    "name": "厄立特里亚",
    "code": "ERI",
    "children": {
      "children": [
        {
          "name": "加什·巴尔卡",
          "code": "BR"
        },
        {
          "name": "南部",
          "code": "DE"
        },
        {
          "name": "南红海",
          "code": "DK"
        },
        {
          "name": "安塞巴",
          "code": "KE"
        },
        {
          "name": "中部",
          "code": "MA"
        },
        {
          "name": "北红海",
          "code": "SK"
        }
      ]
    }
  },
  {
    "name": "西班牙",
    "code": "ESP",
    "children": {
      "children": [
        {
          "name": "马拉加",
          "code": "AGP"
        },
        {
          "name": "阿拉瓦",
          "code": "ALA"
        },
        {
          "name": "阿尔瓦塞特",
          "code": "ALB"
        },
        {
          "name": "阿利坎特",
          "code": "ALC"
        },
        {
          "name": "拉里奥哈",
          "code": "ARL"
        },
        {
          "name": "阿斯图利亚斯",
          "code": "AST"
        },
        {
          "name": "阿维拉",
          "code": "AVI"
        },
        {
          "name": "巴塞罗那",
          "code": "BCN"
        },
        {
          "name": "巴达霍斯",
          "code": "BJZ"
        },
        {
          "name": "巴利阿里",
          "code": "BLR"
        },
        {
          "name": "布尔戈斯",
          "code": "BUR"
        },
        {
          "name": "加的斯",
          "code": "CAD"
        },
        {
          "name": "卡斯特利翁",
          "code": "CAS"
        },
        {
          "name": "卡塞雷斯",
          "code": "CCS"
        },
        {
          "name": "卡斯蒂利亚",
          "code": "CIR"
        },
        {
          "name": "昆卡",
          "code": "CUE"
        },
        {
          "name": "格拉纳达",
          "code": "GRX"
        },
        {
          "name": "赫罗纳",
          "code": "GRO"
        },
        {
          "name": "瓜达拉哈拉",
          "code": "GUA"
        },
        {
          "name": "吉普斯夸",
          "code": "GUI"
        },
        {
          "name": "韦斯卡",
          "code": "HUC"
        },
        {
          "name": "韦尔瓦",
          "code": "HUV"
        },
        {
          "name": "哈恩",
          "code": "JAE"
        },
        {
          "name": "拉科鲁尼亚",
          "code": "LCG"
        },
        {
          "name": "阿尔梅里亚",
          "code": "LEI"
        },
        {
          "name": "莱昂",
          "code": "LEN"
        },
        {
          "name": "卢戈",
          "code": "LGO"
        },
        {
          "name": "莱里达",
          "code": "LLE"
        },
        {
          "name": "拉斯帕尔马斯",
          "code": "LPA"
        },
        {
          "name": "马德里",
          "code": "MAD"
        },
        {
          "name": "穆尔西亚",
          "code": "MJV"
        },
        {
          "name": "纳瓦拉",
          "code": "NVV"
        },
        {
          "name": "科尔多瓦",
          "code": "ODB"
        },
        {
          "name": "奥伦塞",
          "code": "ORE"
        },
        {
          "name": "帕伦西亚",
          "code": "PAC"
        },
        {
          "name": "蓬特韦德拉",
          "code": "PEV"
        },
        {
          "name": "圣克鲁斯-德特内里费",
          "code": "SCT"
        },
        {
          "name": "桑坦德",
          "code": "SDR"
        },
        {
          "name": "塞哥维亚",
          "code": "SEG"
        },
        {
          "name": "萨拉曼卡",
          "code": "SLM"
        },
        {
          "name": "索里亚",
          "code": "SOR"
        },
        {
          "name": "塞维利亚",
          "code": "SVQ"
        },
        {
          "name": "塔拉戈纳",
          "code": "TAR"
        },
        {
          "name": "特鲁埃尔",
          "code": "TER"
        },
        {
          "name": "托莱多",
          "code": "TOL"
        },
        {
          "name": "巴伦西亚",
          "code": "VLC"
        },
        {
          "name": "巴利亚多利德",
          "code": "VLL"
        },
        {
          "name": "比斯开",
          "code": "VSE"
        },
        {
          "name": "萨拉戈萨",
          "code": "ZAZ"
        },
        {
          "name": "萨莫拉",
          "code": "ZMR"
        }
      ]
    }
  },
  {
    "name": "爱沙尼亚",
    "code": "EST",
    "children": {
      "children": [
        {
          "name": "哈留",
          "code": "37"
        },
        {
          "name": "希尤",
          "code": "39"
        },
        {
          "name": "依达－维鲁",
          "code": "44"
        },
        {
          "name": "耶盖瓦",
          "code": "49"
        },
        {
          "name": "耶尔韦",
          "code": "51"
        },
        {
          "name": "里亚内",
          "code": "57"
        },
        {
          "name": "维鲁",
          "code": "59"
        },
        {
          "name": "贝尔瓦",
          "code": "65"
        },
        {
          "name": "帕尔努",
          "code": "67"
        },
        {
          "name": "拉普拉",
          "code": "70"
        },
        {
          "name": "萨雷",
          "code": "74"
        },
        {
          "name": "塔尔图",
          "code": "78"
        },
        {
          "name": "瓦尔加",
          "code": "82"
        },
        {
          "name": "维良地",
          "code": "84"
        },
        {
          "name": "沃鲁",
          "code": "86"
        }
      ]
    }
  },
  {
    "name": "埃塞俄比亚",
    "code": "ETH",
    "children": {
      "children": [
        {
          "name": "亚的斯亚贝巴",
          "code": "AA"
        },
        {
          "name": "阿法尔",
          "code": "AF"
        },
        {
          "name": "阿姆哈拉",
          "code": "AH"
        },
        {
          "name": "宾香古尔",
          "code": "BG"
        },
        {
          "name": "德雷达瓦",
          "code": "DD"
        },
        {
          "name": "甘贝拉各族",
          "code": "GB"
        },
        {
          "name": "哈勒里民族",
          "code": "HR"
        },
        {
          "name": "奥罗米亚",
          "code": "OR"
        },
        {
          "name": "索马里",
          "code": "SM"
        },
        {
          "name": "南方各族",
          "code": "SN"
        },
        {
          "name": "提格雷",
          "code": "TG"
        }
      ]
    }
  },
  {
    "name": "芬兰",
    "code": "FIN",
    "children": {
      "children": [
        {
          "name": "埃斯波",
          "code": "ESP"
        },
        {
          "name": "赫尔辛基",
          "code": "HEL"
        },
        {
          "name": "海门林纳",
          "code": "HMY"
        },
        {
          "name": "约恩苏",
          "code": "JOE"
        },
        {
          "name": "卡亚尼",
          "code": "KAJ"
        },
        {
          "name": "科科拉",
          "code": "KOK"
        },
        {
          "name": "科特卡",
          "code": "KTK"
        },
        {
          "name": "库奥皮奥",
          "code": "KUO"
        },
        {
          "name": "拉赫蒂",
          "code": "LHI"
        },
        {
          "name": "拉彭兰塔",
          "code": "LPP"
        },
        {
          "name": "玛丽港",
          "code": "MHQ"
        },
        {
          "name": "米凯利",
          "code": "MIK"
        },
        {
          "name": "奥卢",
          "code": "OLU"
        },
        {
          "name": "波里",
          "code": "POR"
        },
        {
          "name": "博尔沃",
          "code": "PRV"
        },
        {
          "name": "罗瓦涅米",
          "code": "RVN"
        },
        {
          "name": "图尔库",
          "code": "TKU"
        },
        {
          "name": "坦佩雷",
          "code": "TMP"
        },
        {
          "name": "瓦萨",
          "code": "VAA"
        },
        {
          "name": "万塔",
          "code": "VAT"
        }
      ]
    }
  },
  {
    "name": "斐济",
    "code": "FJI"
  },
  {
    "name": "弗兰克群岛",
    "code": "FLK"
  },
  {
    "name": "法国",
    "code": "FRA",
    "children": {
      "children": [
        {
          "name": "阿雅克修",
          "code": "AJA"
        },
        {
          "name": "亚眠",
          "code": "AMI"
        },
        {
          "name": "阿尔勒",
          "code": "ARL"
        },
        {
          "name": "贝桑松",
          "code": "BSN"
        },
        {
          "name": "卡昂",
          "code": "CFR"
        },
        {
          "name": "沙隆",
          "code": "CSM"
        },
        {
          "name": "第戎",
          "code": "DIJ"
        },
        {
          "name": "弗雷瑞斯",
          "code": "FRJ"
        },
        {
          "name": "艾克斯",
          "code": "QXB"
        },
        {
          "name": "利摩日",
          "code": "LIG"
        },
        {
          "name": "里昂",
          "code": "LIO"
        },
        {
          "name": "里尔",
          "code": "LLE"
        },
        {
          "name": "蒙彼利埃",
          "code": "MPL"
        },
        {
          "name": "马赛",
          "code": "MRS"
        },
        {
          "name": "梅斯",
          "code": "MZM"
        },
        {
          "name": "尼斯",
          "code": "NCE"
        },
        {
          "name": "南特",
          "code": "NTE"
        },
        {
          "name": "奥尔良",
          "code": "ORR"
        },
        {
          "name": "巴黎",
          "code": "PAR"
        },
        {
          "name": "雷恩",
          "code": "RNS"
        },
        {
          "name": "图卢兹",
          "code": "TLS"
        },
        {
          "name": "鲁昂",
          "code": "URO"
        },
        {
          "name": "瓦朗斯",
          "code": "VAA"
        }
      ]
    }
  },
  {
    "name": "法罗群岛",
    "code": "FRO"
  },
  {
    "name": "密克罗尼西亚",
    "code": "FSM"
  },
  {
    "name": "加蓬",
    "code": "GAB",
    "children": {
      "children": [
        {
          "name": "河口",
          "code": "ES"
        },
        {
          "name": "上奥果韦",
          "code": "HO"
        },
        {
          "name": "中奥果韦",
          "code": "MO"
        },
        {
          "name": "恩古涅",
          "code": "NG"
        },
        {
          "name": "尼扬加",
          "code": "NY"
        },
        {
          "name": "奥果韦-伊温多",
          "code": "OI"
        },
        {
          "name": "奥果韦-洛洛",
          "code": "OL"
        },
        {
          "name": "滨海奥果韦",
          "code": "OM"
        },
        {
          "name": "沃勒-恩特姆",
          "code": "WN"
        }
      ]
    }
  },
  {
    "name": "英国",
    "code": "GBR",
    "children": [
      {
        "name": "英格兰",
        "code": "ENG",
        "children": [
          {
            "name": "巴斯",
            "code": "BAS"
          },
          {
            "name": "伯明翰",
            "code": "BIR"
          },
          {
            "name": "布莱顿与赫福",
            "code": "BNH"
          },
          {
            "name": "布拉德福德",
            "code": "BRD"
          },
          {
            "name": "布里斯托尔",
            "code": "BST"
          },
          {
            "name": "卡莱尔",
            "code": "CAX"
          },
          {
            "name": "剑桥",
            "code": "CAM"
          },
          {
            "name": "切斯特",
            "code": "CEG"
          },
          {
            "name": "坎特伯雷",
            "code": "CNG"
          },
          {
            "name": "考文垂",
            "code": "COV"
          },
          {
            "name": "奇切斯特",
            "code": "CST"
          },
          {
            "name": "德比",
            "code": "DER"
          },
          {
            "name": "德罕",
            "code": "DUR"
          },
          {
            "name": "爱塞特",
            "code": "EXE"
          },
          {
            "name": "伊利",
            "code": "ELY"
          },
          {
            "name": "格洛斯特",
            "code": "GLO"
          },
          {
            "name": "赫里福德",
            "code": "HAF"
          },
          {
            "name": "赫尔河畔京斯敦",
            "code": "KUH"
          },
          {
            "name": "兰开斯特",
            "code": "LAN"
          },
          {
            "name": "列斯特",
            "code": "LCE"
          },
          {
            "name": "林肯",
            "code": "LCN"
          },
          {
            "name": "利茲",
            "code": "LDS"
          },
          {
            "name": "利奇菲尔德",
            "code": "LHF"
          },
          {
            "name": "利物浦",
            "code": "LIV"
          },
          {
            "name": "伦敦",
            "code": "LND"
          },
          {
            "name": "曼彻斯特",
            "code": "MAN"
          },
          {
            "name": "纽卡斯尔",
            "code": "NCL"
          },
          {
            "name": "诺丁汉",
            "code": "NGM"
          },
          {
            "name": "诺里奇",
            "code": "NRW"
          },
          {
            "name": "牛津",
            "code": "OXF"
          },
          {
            "name": "普利茅斯",
            "code": "PLY"
          },
          {
            "name": "朴茨茅斯",
            "code": "POR"
          },
          {
            "name": "普雷斯顿",
            "code": "PRE"
          },
          {
            "name": "彼得伯勒",
            "code": "PTE"
          },
          {
            "name": "里彭",
            "code": "RIP"
          },
          {
            "name": "谢菲尔德",
            "code": "SHE"
          },
          {
            "name": "索福特",
            "code": "SLF"
          },
          {
            "name": "索尔斯堡",
            "code": "SLS"
          },
          {
            "name": "特伦特河畔斯多克",
            "code": "SOT"
          },
          {
            "name": "南安普敦",
            "code": "STH"
          },
          {
            "name": "桑德兰",
            "code": "SUN"
          },
          {
            "name": "圣阿本斯",
            "code": "TBL"
          },
          {
            "name": "特鲁罗",
            "code": "TRU"
          },
          {
            "name": "韦克菲尔德",
            "code": "WKF"
          },
          {
            "name": "威尔斯",
            "code": "WLS"
          },
          {
            "name": "温彻斯特",
            "code": "WNE"
          },
          {
            "name": "伍斯特",
            "code": "WOR"
          },
          {
            "name": "伍尔弗汉普顿",
            "code": "WOV"
          },
          {
            "name": "约克",
            "code": "YOR"
          }
        ]
      },
      {
        "name": "北爱尔兰",
        "code": "NIR",
        "children": [
          {
            "name": "贝尔法斯特",
            "code": "BFS"
          },
          {
            "name": "德里",
            "code": "DRY"
          },
          {
            "name": "利斯本",
            "code": "LSB"
          },
          {
            "name": "纽里",
            "code": "NYM"
          }
        ]
      },
      {
        "name": "苏格兰",
        "code": "SCT",
        "children": [
          {
            "name": "阿伯丁",
            "code": "ABD"
          },
          {
            "name": "丹迪",
            "code": "DND"
          },
          {
            "name": "爱丁堡",
            "code": "EDH"
          },
          {
            "name": "格拉斯哥",
            "code": "GLG"
          },
          {
            "name": "因弗内斯",
            "code": "INV"
          },
          {
            "name": "斯特灵",
            "code": "STG"
          }
        ]
      },
      {
        "name": "威尔士",
        "code": "WLS",
        "children": [
          {
            "name": "班戈",
            "code": "BAN"
          },
          {
            "name": "卡迪夫",
            "code": "CDF"
          },
          {
            "name": "纽波特",
            "code": "NWP"
          },
          {
            "name": "斯旺西",
            "code": "SWA"
          }
        ]
      }
    ]
  },
  {
    "name": "乔治亚",
    "code": "GEO"
  },
  {
    "name": "格恩西岛",
    "code": "GGY"
  },
  {
    "name": "加纳",
    "code": "GHA",
    "children": {
      "children": [
        {
          "name": "阿散蒂",
          "code": "AS"
        },
        {
          "name": "布朗阿哈福",
          "code": "BA"
        },
        {
          "name": "中部",
          "code": "CE"
        },
        {
          "name": "东部",
          "code": "EA"
        },
        {
          "name": "大阿克拉",
          "code": "GA"
        },
        {
          "name": "北部",
          "code": "NO"
        },
        {
          "name": "奥布阿西",
          "code": "OBU"
        },
        {
          "name": "上东部",
          "code": "UE"
        },
        {
          "name": "上西部",
          "code": "UW"
        },
        {
          "name": "沃尔特",
          "code": "VO"
        },
        {
          "name": "西部",
          "code": "WE"
        }
      ]
    }
  },
  {
    "name": "直布罗陀",
    "code": "GIB"
  },
  {
    "name": "几内亚",
    "code": "GIN",
    "children": {
      "children": [
        {
          "name": "博凯",
          "code": "BOK"
        },
        {
          "name": "科纳克里",
          "code": "CNK"
        },
        {
          "name": "法拉纳",
          "code": "FRN"
        },
        {
          "name": "金迪亚",
          "code": "KND"
        },
        {
          "name": "康康",
          "code": "KNK"
        },
        {
          "name": "拉贝",
          "code": "LAB"
        },
        {
          "name": "玛木",
          "code": "MAM"
        },
        {
          "name": "恩泽雷科雷",
          "code": "NZR"
        }
      ]
    }
  },
  {
    "name": "瓜德罗普",
    "code": "GLP"
  },
  {
    "name": "冈比亚",
    "code": "GMB"
  },
  {
    "name": "几内亚比绍",
    "code": "GNB"
  },
  {
    "name": "希腊",
    "code": "GRC",
    "children": {
      "children": [
        {
          "name": "雅典",
          "code": "ATH"
        },
        {
          "name": "干尼亚",
          "code": "CHQ"
        },
        {
          "name": "基克拉迪",
          "code": "CY"
        },
        {
          "name": "多德卡尼斯",
          "code": "DO"
        },
        {
          "name": "伊拉克里翁",
          "code": "HER"
        },
        {
          "name": "莱斯博斯",
          "code": "LES"
        },
        {
          "name": "拉西锡",
          "code": "LST"
        },
        {
          "name": "比雷埃夫斯",
          "code": "PRI"
        },
        {
          "name": "雷西姆农",
          "code": "RET"
        },
        {
          "name": "萨摩斯",
          "code": "SMI"
        }
      ]
    }
  },
  {
    "name": "格林纳达",
    "code": "GRD"
  },
  {
    "name": "格陵兰",
    "code": "GRL"
  },
  {
    "name": "危地马拉",
    "code": "GTM",
    "children": {
      "children": [
        {
          "name": "上韦拉帕斯",
          "code": "AV"
        },
        {
          "name": "下韦拉帕斯",
          "code": "BV"
        },
        {
          "name": "奇基穆拉",
          "code": "CQ"
        },
        {
          "name": "奇马尔特南戈",
          "code": "CM"
        },
        {
          "name": "埃斯昆特拉",
          "code": "ES"
        },
        {
          "name": "危地马拉",
          "code": "GU"
        },
        {
          "name": "韦韦特南戈",
          "code": "HU"
        },
        {
          "name": "伊萨瓦尔",
          "code": "IZ"
        },
        {
          "name": "哈拉帕",
          "code": "JA"
        },
        {
          "name": "胡蒂亚帕",
          "code": "JU"
        },
        {
          "name": "基切",
          "code": "QC"
        },
        {
          "name": "克萨尔特南戈",
          "code": "QZ"
        },
        {
          "name": "米克斯科",
          "code": "MIX"
        },
        {
          "name": "佩滕",
          "code": "PE"
        },
        {
          "name": "埃尔普罗格雷索",
          "code": "PR"
        },
        {
          "name": "雷塔卢莱乌",
          "code": "RE"
        },
        {
          "name": "圣马科斯",
          "code": "SM"
        },
        {
          "name": "索洛拉",
          "code": "SO"
        },
        {
          "name": "圣罗莎",
          "code": "SR"
        },
        {
          "name": "萨卡特佩克斯",
          "code": "ST"
        },
        {
          "name": "苏奇特佩克斯",
          "code": "SU"
        },
        {
          "name": "托托尼卡潘",
          "code": "TO"
        },
        {
          "name": "新城",
          "code": "VIN"
        },
        {
          "name": "萨卡帕",
          "code": "ZA"
        }
      ]
    }
  },
  {
    "name": "法属圭亚那",
    "code": "GUF"
  },
  {
    "name": "关岛",
    "code": "GUM"
  },
  {
    "name": "圭亚那",
    "code": "GUY",
    "children": {
      "children": [
        {
          "name": "巴里马-瓦伊尼",
          "code": "BW"
        },
        {
          "name": "库尤尼-马扎鲁尼",
          "code": "CM"
        },
        {
          "name": "德梅拉拉-马海卡",
          "code": "DM"
        },
        {
          "name": "东伯比斯-科兰太因",
          "code": "EC"
        },
        {
          "name": "埃塞奎博群岛-西德梅拉拉",
          "code": "EW"
        },
        {
          "name": "马海卡-伯比斯",
          "code": "MB"
        },
        {
          "name": "波塔罗-锡帕鲁尼",
          "code": "PI"
        },
        {
          "name": "波默伦-苏佩纳姆",
          "code": "PM"
        },
        {
          "name": "上德梅拉拉-伯比斯",
          "code": "UD"
        },
        {
          "name": "上塔库图-上埃塞奎博",
          "code": "UT"
        }
      ]
    }
  },
  {
    "name": "赫德和麦克唐纳群岛",
    "code": "HMD"
  },
  {
    "name": "洪都拉斯",
    "code": "HND",
    "children": {
      "children": [
        {
          "name": "阿特兰蒂达",
          "code": "AT"
        },
        {
          "name": "乔卢特卡",
          "code": "CH"
        },
        {
          "name": "乔罗马",
          "code": "CHO"
        },
        {
          "name": "科隆",
          "code": "CL"
        },
        {
          "name": "科马亚瓜",
          "code": "CM"
        },
        {
          "name": "科潘",
          "code": "CP"
        },
        {
          "name": "科尔特斯",
          "code": "CR"
        },
        {
          "name": "弗朗西斯科-莫拉桑",
          "code": "FM"
        },
        {
          "name": "格拉西亚斯-阿迪奥斯",
          "code": "GD"
        },
        {
          "name": "海湾群岛",
          "code": "IB"
        },
        {
          "name": "因蒂布卡",
          "code": "IN"
        },
        {
          "name": "伦皮拉",
          "code": "LE"
        },
        {
          "name": "奥科特佩克",
          "code": "OC"
        },
        {
          "name": "奥兰乔",
          "code": "OL"
        },
        {
          "name": "埃尔帕拉伊索",
          "code": "PA"
        },
        {
          "name": "拉巴斯",
          "code": "PZ"
        },
        {
          "name": "圣巴巴拉",
          "code": "SB"
        },
        {
          "name": "山谷",
          "code": "VA"
        },
        {
          "name": "约罗",
          "code": "YO"
        }
      ]
    }
  },
  {
    "name": "克罗地亚",
    "code": "HRV",
    "children": {
      "children": [
        {
          "name": "萨格勒布",
          "code": "1"
        },
        {
          "name": "维罗维蒂察-波德拉维纳",
          "code": "10"
        },
        {
          "name": "波热加-斯拉沃尼亚",
          "code": "11"
        },
        {
          "name": "布罗德-波萨维纳",
          "code": "12"
        },
        {
          "name": "扎达尔",
          "code": "13"
        },
        {
          "name": "奥西耶克-巴拉尼亚",
          "code": "14"
        },
        {
          "name": "希贝尼克-克宁",
          "code": "15"
        },
        {
          "name": "武科瓦尔-斯里耶姆",
          "code": "16"
        },
        {
          "name": "斯普利特-达尔马提亚",
          "code": "17"
        },
        {
          "name": "伊斯特拉",
          "code": "18"
        },
        {
          "name": "杜布罗夫斯克-内雷特瓦",
          "code": "19"
        },
        {
          "name": "克拉皮纳-扎戈列",
          "code": "2"
        },
        {
          "name": "梅吉穆列",
          "code": "20"
        },
        {
          "name": "萨格勒布市",
          "code": "21"
        },
        {
          "name": "锡萨克-莫斯拉维纳",
          "code": "3"
        },
        {
          "name": "卡尔洛瓦茨",
          "code": "4"
        },
        {
          "name": "瓦拉日丁",
          "code": "5"
        },
        {
          "name": "科普里夫尼察-克里热夫齐",
          "code": "6"
        },
        {
          "name": "别洛瓦尔-比洛戈拉",
          "code": "7"
        },
        {
          "name": "滨海和山区",
          "code": "8"
        },
        {
          "name": "利卡-塞尼",
          "code": "9"
        }
      ]
    }
  },
  {
    "name": "海地",
    "code": "HTI"
  },
  {
    "name": "匈牙利",
    "code": "HUN",
    "children": {
      "children": [
        {
          "name": "巴兰尼亚",
          "code": "BA"
        },
        {
          "name": "贝凯什",
          "code": "BE"
        },
        {
          "name": "巴奇-基什孔",
          "code": "BK"
        },
        {
          "name": "布达佩斯",
          "code": "BU"
        },
        {
          "name": "包尔绍德-奥包乌伊-曾普伦",
          "code": "BZ"
        },
        {
          "name": "琼格拉德",
          "code": "CS"
        },
        {
          "name": "费耶尔",
          "code": "FE"
        },
        {
          "name": "杰尔-莫松-肖普朗",
          "code": "GS"
        },
        {
          "name": "豪伊杜-比豪尔",
          "code": "HB"
        },
        {
          "name": "赫维什",
          "code": "HE"
        },
        {
          "name": "加兹-纳杰孔-索尔诺克",
          "code": "JN"
        },
        {
          "name": "科马罗姆",
          "code": "KE"
        },
        {
          "name": "诺格拉德",
          "code": "NO"
        },
        {
          "name": "佩斯",
          "code": "PE"
        },
        {
          "name": "绍莫吉",
          "code": "SO"
        },
        {
          "name": "索博尔奇-索特马尔-贝拉格",
          "code": "SZ"
        },
        {
          "name": "托尔瑙",
          "code": "TO"
        },
        {
          "name": "沃什",
          "code": "VA"
        },
        {
          "name": "维斯普雷姆",
          "code": "VE"
        },
        {
          "name": "佐洛",
          "code": "ZA"
        }
      ]
    }
  },
  {
    "name": "印度尼西亚",
    "code": "IDN",
    "children": {
      "children": [
        {
          "name": "亚齐",
          "code": "AC"
        },
        {
          "name": "巴厘",
          "code": "BA"
        },
        {
          "name": "邦加－勿里洞群岛",
          "code": "BB"
        },
        {
          "name": "明古鲁",
          "code": "BE"
        },
        {
          "name": "万丹",
          "code": "BT"
        },
        {
          "name": "伊里安查亚",
          "code": "IJ"
        },
        {
          "name": "占碑",
          "code": "JA"
        },
        {
          "name": "西爪哇",
          "code": "JB"
        },
        {
          "name": "东爪哇",
          "code": "JI"
        },
        {
          "name": "雅加达",
          "code": "JK"
        },
        {
          "name": "中爪哇",
          "code": "JT"
        },
        {
          "name": "大雅加达首都特区",
          "code": "KB"
        },
        {
          "name": "东加里曼丹",
          "code": "KI"
        },
        {
          "name": "南加里曼丹",
          "code": "KS"
        },
        {
          "name": "中加里曼丹",
          "code": "KT"
        },
        {
          "name": "楠榜",
          "code": "LA"
        },
        {
          "name": "马鲁古",
          "code": "MA"
        },
        {
          "name": "西努沙登加拉",
          "code": "NB"
        },
        {
          "name": "东努沙登加拉",
          "code": "NT"
        },
        {
          "name": "廖内",
          "code": "RI"
        },
        {
          "name": "北苏拉威西",
          "code": "SA"
        },
        {
          "name": "东南苏拉威西",
          "code": "SG"
        },
        {
          "name": "南苏拉威西",
          "code": "SN"
        },
        {
          "name": "西苏门答腊",
          "code": "SR"
        },
        {
          "name": "南苏门答腊",
          "code": "SS"
        },
        {
          "name": "中苏拉威西",
          "code": "ST"
        },
        {
          "name": "北苏门答腊",
          "code": "SU"
        },
        {
          "name": "日惹特区",
          "code": "YO"
        }
      ]
    }
  },
  {
    "name": "曼岛",
    "code": "IMN"
  },
  {
    "name": "印度",
    "code": "IND",
    "children": {
      "children": [
        {
          "name": "艾藻尔",
          "code": "AJL"
        },
        {
          "name": "布巴内斯瓦尔",
          "code": "BBI"
        },
        {
          "name": "博帕尔",
          "code": "BHO"
        },
        {
          "name": "班加罗尔",
          "code": "BLR"
        },
        {
          "name": "加尔各答",
          "code": "CCU"
        },
        {
          "name": "哥印拜陀",
          "code": "CJB"
        },
        {
          "name": "达曼",
          "code": "DAM"
        },
        {
          "name": "第乌",
          "code": "DIU"
        },
        {
          "name": "甘托克",
          "code": "GTO"
        },
        {
          "name": "新德里",
          "code": "ICD"
        },
        {
          "name": "印多尔",
          "code": "IDR"
        },
        {
          "name": "昌迪加尔",
          "code": "IXC"
        },
        {
          "name": "马杜赖",
          "code": "IXM"
        },
        {
          "name": "因帕尔",
          "code": "IMF"
        },
        {
          "name": "斋普尔",
          "code": "JAI"
        },
        {
          "name": "焦特布尔",
          "code": "JDH"
        },
        {
          "name": "贾巴尔普尔",
          "code": "JLR"
        },
        {
          "name": "贾朗达尔",
          "code": "JUC"
        },
        {
          "name": "科希马",
          "code": "KOM"
        },
        {
          "name": "加里加尔",
          "code": "KRK"
        },
        {
          "name": "卡瓦拉蒂",
          "code": "KVA"
        },
        {
          "name": "金奈",
          "code": "MAA"
        },
        {
          "name": "马埃",
          "code": "MAH"
        },
        {
          "name": "本地治里",
          "code": "PNY"
        },
        {
          "name": "西隆",
          "code": "SHL"
        },
        {
          "name": "锡尔萨瓦",
          "code": "SIL"
        },
        {
          "name": "森伯尔布尔",
          "code": "SLR"
        },
        {
          "name": "亚南",
          "code": "SRV"
        },
        {
          "name": "特里凡得琅",
          "code": "TRV"
        },
        {
          "name": "乌代布尔",
          "code": "UDR"
        }
      ]
    }
  },
  {
    "name": "英属印度洋领地",
    "code": "IOT"
  },
  {
    "name": "伊拉克",
    "code": "IRQ"
  },
  {
    "name": "爱尔兰",
    "code": "IRL",
    "children": {
      "children": [
        {
          "name": "科克",
          "code": "CK"
        },
        {
          "name": "克莱尔",
          "code": "CL"
        },
        {
          "name": "卡范",
          "code": "CV"
        },
        {
          "name": "卡洛",
          "code": "CW"
        },
        {
          "name": "都柏林",
          "code": "DB"
        },
        {
          "name": "多内加尔",
          "code": "DG"
        },
        {
          "name": "戈尔韦",
          "code": "GW"
        },
        {
          "name": "基尔代尔",
          "code": "KD"
        },
        {
          "name": "基尔肯尼",
          "code": "KK"
        },
        {
          "name": "凯里",
          "code": "KR"
        },
        {
          "name": "崂斯",
          "code": "LA"
        },
        {
          "name": "朗福德",
          "code": "LF"
        },
        {
          "name": "利默里克",
          "code": "LM"
        },
        {
          "name": "利特里姆",
          "code": "LR"
        },
        {
          "name": "劳斯",
          "code": "LT"
        },
        {
          "name": "莫内根",
          "code": "MG"
        },
        {
          "name": "米斯",
          "code": "MT"
        },
        {
          "name": "梅奥",
          "code": "MY"
        },
        {
          "name": "奥法利",
          "code": "OF"
        },
        {
          "name": "罗斯康芒",
          "code": "RC"
        },
        {
          "name": "斯莱戈",
          "code": "SL"
        },
        {
          "name": "蒂珀雷里",
          "code": "TP"
        },
        {
          "name": "沃特福德",
          "code": "WF"
        },
        {
          "name": "韦克斯福德",
          "code": "WX"
        },
        {
          "name": "威克洛",
          "code": "WK"
        },
        {
          "name": "西米斯",
          "code": "WM"
        }
      ]
    }
  },
  {
    "name": "伊朗",
    "code": "IRN"
  },
  {
    "name": "冰岛",
    "code": "ISL"
  },
  {
    "name": "以色列",
    "code": "ISR",
    "children": {
      "children": [
        {
          "name": "阿什杜德",
          "code": "ASH"
        },
        {
          "name": "贝特雁",
          "code": "BAT"
        },
        {
          "name": "贝尔谢巴",
          "code": "BEV"
        },
        {
          "name": "海法",
          "code": "HFA"
        },
        {
          "name": "霍隆",
          "code": "HOL"
        },
        {
          "name": "耶路撒冷",
          "code": "J"
        },
        {
          "name": "内坦亚",
          "code": "NAT"
        },
        {
          "name": "特拉维夫",
          "code": "TLV"
        }
      ]
    }
  },
  {
    "name": "意大利",
    "code": "ITA",
    "children": {
      "children": [
        {
          "name": "亚历山德里亚",
          "code": "ALE"
        },
        {
          "name": "安科纳",
          "code": "AOI"
        },
        {
          "name": "奥斯塔",
          "code": "AOT"
        },
        {
          "name": "阿斯科利皮切诺",
          "code": "ASP"
        },
        {
          "name": "阿斯蒂",
          "code": "AST"
        },
        {
          "name": "布林迪西",
          "code": "BDS"
        },
        {
          "name": "贝内文托",
          "code": "BEN"
        },
        {
          "name": "贝加莫",
          "code": "BGO"
        },
        {
          "name": "布拉",
          "code": "BIE"
        },
        {
          "name": "博洛尼亚",
          "code": "BLQ"
        },
        {
          "name": "布雷西亚",
          "code": "BRC"
        },
        {
          "name": "巴里",
          "code": "BRI"
        },
        {
          "name": "卡利亚里",
          "code": "CAG"
        },
        {
          "name": "热那亚",
          "code": "CAX"
        },
        {
          "name": "科摩",
          "code": "CIY"
        },
        {
          "name": "坎波巴索",
          "code": "COB"
        },
        {
          "name": "克罗托内",
          "code": "CRV"
        },
        {
          "name": "卡塞塔",
          "code": "CST"
        },
        {
          "name": "卡塔尼亚",
          "code": "CTA"
        },
        {
          "name": "库内奥",
          "code": "CUN"
        },
        {
          "name": "佛罗伦萨",
          "code": "FLR"
        },
        {
          "name": "福贾",
          "code": "FOG"
        },
        {
          "name": "费拉拉",
          "code": "FRR"
        },
        {
          "name": "伊塞尔尼亚",
          "code": "ISE"
        },
        {
          "name": "科森扎",
          "code": "QCS"
        },
        {
          "name": "卡坦扎罗",
          "code": "QCZ"
        },
        {
          "name": "努奥罗",
          "code": "QNU"
        },
        {
          "name": "奥里斯塔诺",
          "code": "QOS"
        },
        {
          "name": "波坦察",
          "code": "QPO"
        },
        {
          "name": "萨萨里",
          "code": "QSS"
        },
        {
          "name": "拉奎拉",
          "code": "LAQ"
        },
        {
          "name": "莱切",
          "code": "LCC"
        },
        {
          "name": "莱科",
          "code": "LCO"
        },
        {
          "name": "里窝那",
          "code": "LIV"
        },
        {
          "name": "马萨",
          "code": "MCR"
        },
        {
          "name": "米兰",
          "code": "MIL"
        },
        {
          "name": "摩德纳",
          "code": "MOD"
        },
        {
          "name": "墨西拿",
          "code": "MSN"
        },
        {
          "name": "马泰拉",
          "code": "MTR"
        },
        {
          "name": "蒙扎",
          "code": "MZA"
        },
        {
          "name": "那不勒斯",
          "code": "NAP"
        },
        {
          "name": "诺瓦拉",
          "code": "NVR"
        },
        {
          "name": "奥尔比亚",
          "code": "OLB"
        },
        {
          "name": "帕维亚",
          "code": "PAV"
        },
        {
          "name": "佩鲁贾",
          "code": "PEG"
        },
        {
          "name": "帕尔马",
          "code": "PMF"
        },
        {
          "name": "巴勒莫",
          "code": "PMO"
        },
        {
          "name": "波代诺内",
          "code": "PRD"
        },
        {
          "name": "比萨",
          "code": "PSA"
        },
        {
          "name": "雷焦卡拉布里亚",
          "code": "REG"
        },
        {
          "name": "雷焦艾米利亚",
          "code": "RNE"
        },
        {
          "name": "罗马",
          "code": "ROM"
        },
        {
          "name": "萨莱诺",
          "code": "SAL"
        },
        {
          "name": "锡耶纳",
          "code": "SNA"
        },
        {
          "name": "拉斯佩齐亚",
          "code": "SPE"
        },
        {
          "name": "萨沃纳",
          "code": "SVN"
        },
        {
          "name": "锡拉库扎",
          "code": "SYR"
        },
        {
          "name": "塔兰托",
          "code": "TAR"
        },
        {
          "name": "特拉帕尼",
          "code": "TPS"
        },
        {
          "name": "都灵",
          "code": "TRN"
        },
        {
          "name": "的里雅斯特",
          "code": "TRS"
        },
        {
          "name": "特伦托",
          "code": "TRT"
        },
        {
          "name": "乌迪内",
          "code": "UDN"
        },
        {
          "name": "威尼斯",
          "code": "VCE"
        },
        {
          "name": "维泰博",
          "code": "VIT"
        },
        {
          "name": "韦尔切利",
          "code": "VRL"
        }
      ]
    }
  },
  {
    "name": "牙买加",
    "code": "JAM",
    "children": {
      "children": [
        {
          "name": "圣安德鲁斯",
          "code": "AND"
        },
        {
          "name": "圣安娜",
          "code": "ANN"
        },
        {
          "name": "圣凯瑟琳",
          "code": "CAT"
        },
        {
          "name": "克拉伦登",
          "code": "CLA"
        },
        {
          "name": "圣伊丽莎白",
          "code": "ELI"
        },
        {
          "name": "汉诺威",
          "code": "HAN"
        },
        {
          "name": "圣詹姆斯",
          "code": "JAM"
        },
        {
          "name": "金斯敦",
          "code": "KIN"
        },
        {
          "name": "曼彻斯特",
          "code": "MAN"
        },
        {
          "name": "圣玛丽",
          "code": "MAR"
        },
        {
          "name": "波特兰",
          "code": "POR"
        },
        {
          "name": "圣托马斯",
          "code": "THO"
        },
        {
          "name": "特里洛尼",
          "code": "TRL"
        },
        {
          "name": "西摩兰",
          "code": "WML"
        }
      ]
    }
  },
  {
    "name": "泽西岛",
    "code": "JEY"
  },
  {
    "name": "约旦",
    "code": "JOR",
    "children": {
      "children": [
        {
          "name": "阿吉隆",
          "code": "AJ"
        },
        {
          "name": "亚喀巴",
          "code": "AQ"
        },
        {
          "name": "安曼",
          "code": "AM"
        },
        {
          "name": "拜勒加",
          "code": "BA"
        },
        {
          "name": "伊尔比德",
          "code": "IR"
        },
        {
          "name": "杰拉什",
          "code": "JA"
        },
        {
          "name": "卡拉克",
          "code": "KA"
        },
        {
          "name": "马德巴",
          "code": "MD"
        },
        {
          "name": "马夫拉克",
          "code": "MF"
        },
        {
          "name": "马安",
          "code": "MN"
        },
        {
          "name": "鲁赛法",
          "code": "RU"
        },
        {
          "name": "塔菲拉",
          "code": "TA"
        },
        {
          "name": "扎尔卡",
          "code": "ZA"
        }
      ]
    }
  },
  {
    "name": "日本",
    "code": "JPN",
    "children": {
      "children": [
        {
          "name": "北海道",
          "code": "1"
        },
        {
          "name": "群马",
          "code": "10"
        },
        {
          "name": "埼玉",
          "code": "11"
        },
        {
          "name": "千叶",
          "code": "12"
        },
        {
          "name": "东京",
          "code": "13"
        },
        {
          "name": "神奈川",
          "code": "14"
        },
        {
          "name": "新潟",
          "code": "15"
        },
        {
          "name": "富山",
          "code": "16"
        },
        {
          "name": "石川",
          "code": "17"
        },
        {
          "name": "福井",
          "code": "18"
        },
        {
          "name": "山梨",
          "code": "19"
        },
        {
          "name": "青森",
          "code": "2"
        },
        {
          "name": "长野",
          "code": "20"
        },
        {
          "name": "岐阜",
          "code": "21"
        },
        {
          "name": "静冈",
          "code": "22"
        },
        {
          "name": "爱知",
          "code": "23"
        },
        {
          "name": "三重",
          "code": "24"
        },
        {
          "name": "滋贺",
          "code": "25"
        },
        {
          "name": "京都",
          "code": "26"
        },
        {
          "name": "大阪",
          "code": "27"
        },
        {
          "name": "兵库",
          "code": "28"
        },
        {
          "name": "奈良",
          "code": "29"
        },
        {
          "name": "岩手",
          "code": "3"
        },
        {
          "name": "和歌山",
          "code": "30"
        },
        {
          "name": "鸟取",
          "code": "31"
        },
        {
          "name": "岛根",
          "code": "32"
        },
        {
          "name": "冈山",
          "code": "33"
        },
        {
          "name": "广岛",
          "code": "34"
        },
        {
          "name": "山口",
          "code": "35"
        },
        {
          "name": "徳岛",
          "code": "36"
        },
        {
          "name": "香川",
          "code": "37"
        },
        {
          "name": "爱媛",
          "code": "38"
        },
        {
          "name": "高知",
          "code": "39"
        },
        {
          "name": "宮城",
          "code": "4"
        },
        {
          "name": "福冈",
          "code": "40"
        },
        {
          "name": "佐贺",
          "code": "41"
        },
        {
          "name": "长崎",
          "code": "42"
        },
        {
          "name": "熊本",
          "code": "43"
        },
        {
          "name": "大分",
          "code": "44"
        },
        {
          "name": "宫崎",
          "code": "45"
        },
        {
          "name": "鹿儿岛",
          "code": "46"
        },
        {
          "name": "冲绳",
          "code": "47"
        },
        {
          "name": "秋田",
          "code": "5"
        },
        {
          "name": "山形",
          "code": "6"
        },
        {
          "name": "福岛",
          "code": "7"
        },
        {
          "name": "茨城",
          "code": "8"
        },
        {
          "name": "枥木",
          "code": "9"
        }
      ]
    }
  },
  {
    "name": "哈萨克斯坦",
    "code": "KAZ",
    "children": {
      "children": [
        {
          "name": "阿克莫拉",
          "code": "AKM"
        },
        {
          "name": "阿克苏",
          "code": "AKS"
        },
        {
          "name": "阿克托别",
          "code": "AKT"
        },
        {
          "name": "阿拉木图",
          "code": "ALA"
        },
        {
          "name": "阿雷斯",
          "code": "ARY"
        },
        {
          "name": "阿斯塔纳市",
          "code": "AST"
        },
        {
          "name": "阿特劳",
          "code": "ATY"
        },
        {
          "name": "阿尔卡累克",
          "code": "AYK"
        },
        {
          "name": "巴尔喀什",
          "code": "BXH"
        },
        {
          "name": "江布尔",
          "code": "DMB"
        },
        {
          "name": "杰兹卡兹甘",
          "code": "DZH"
        },
        {
          "name": "埃基巴斯图兹",
          "code": "EKB"
        },
        {
          "name": "卡普恰盖",
          "code": "KAP"
        },
        {
          "name": "卡拉干达",
          "code": "KAR"
        },
        {
          "name": "肯套",
          "code": "KEN"
        },
        {
          "name": "南哈萨克斯坦",
          "code": "KGT"
        },
        {
          "name": "科斯塔奈",
          "code": "KST"
        },
        {
          "name": "库尔恰托夫",
          "code": "KUR"
        },
        {
          "name": "卡拉扎尔",
          "code": "KZO"
        },
        {
          "name": "克孜勒奥尔达",
          "code": "KZY"
        },
        {
          "name": "列宁诺戈尔斯克",
          "code": "LEN"
        },
        {
          "name": "利萨科夫斯克",
          "code": "LKK"
        },
        {
          "name": "曼格斯套",
          "code": "MAN"
        },
        {
          "name": "巴甫洛达尔",
          "code": "PAV"
        },
        {
          "name": "鲁德内",
          "code": "RUD"
        },
        {
          "name": "沙赫京斯克",
          "code": "SAK"
        },
        {
          "name": "萨兰",
          "code": "SAR"
        },
        {
          "name": "塞梅伊",
          "code": "SEM"
        },
        {
          "name": "北哈萨克斯坦",
          "code": "SEV"
        },
        {
          "name": "斯捷普诺戈尔斯克",
          "code": "STE"
        },
        {
          "name": "铁克利",
          "code": "TEK"
        },
        {
          "name": "铁米尔套",
          "code": "TEM"
        },
        {
          "name": "突厥斯坦",
          "code": "TUR"
        },
        {
          "name": "东哈萨克斯坦",
          "code": "VOS"
        },
        {
          "name": "西哈萨克斯坦",
          "code": "ZAP"
        },
        {
          "name": "扎纳奥津",
          "code": "ZHA"
        },
        {
          "name": "济良诺夫斯克",
          "code": "ZYR"
        }
      ]
    }
  },
  {
    "name": "肯尼亚",
    "code": "KEN",
    "children": {
      "children": [
        {
          "name": "巴林戈",
          "code": "BAR"
        },
        {
          "name": "博美特",
          "code": "BOM"
        },
        {
          "name": "邦戈马",
          "code": "BUN"
        },
        {
          "name": "布希亚",
          "code": "BUS"
        },
        {
          "name": "中央",
          "code": "CE"
        },
        {
          "name": "埃尔格约-马拉奎特",
          "code": "EMA"
        },
        {
          "name": "恩布",
          "code": "EMB"
        },
        {
          "name": "加里萨",
          "code": "GAS"
        },
        {
          "name": "霍马湾",
          "code": "HOB"
        },
        {
          "name": "伊希约洛",
          "code": "ISI"
        },
        {
          "name": "卡耶亚多",
          "code": "KAJ"
        },
        {
          "name": "卡卡梅加",
          "code": "KAK"
        },
        {
          "name": "凯里乔",
          "code": "KEY"
        },
        {
          "name": "基安布",
          "code": "KIA"
        },
        {
          "name": "基西",
          "code": "KII"
        },
        {
          "name": "基里菲",
          "code": "KIL"
        },
        {
          "name": "基里尼亚加",
          "code": "KIR"
        },
        {
          "name": "基苏木",
          "code": "KIS"
        },
        {
          "name": "基图伊",
          "code": "KIT"
        },
        {
          "name": "夸勒",
          "code": "KWA"
        },
        {
          "name": "莱基皮亚",
          "code": "LAI"
        },
        {
          "name": "拉木",
          "code": "LAU"
        },
        {
          "name": "马查科斯",
          "code": "MAC"
        },
        {
          "name": "马瓜尼",
          "code": "MAK"
        },
        {
          "name": "曼德拉",
          "code": "MAN"
        },
        {
          "name": "梅鲁",
          "code": "MER"
        },
        {
          "name": "米戈利",
          "code": "MIG"
        },
        {
          "name": "蒙巴萨",
          "code": "MOM"
        },
        {
          "name": "穆兰卡",
          "code": "MUR"
        },
        {
          "name": "内罗毕",
          "code": "NA"
        },
        {
          "name": "南迪",
          "code": "NAN"
        },
        {
          "name": "纳罗克",
          "code": "NAR"
        },
        {
          "name": "尼蒂",
          "code": "NIT"
        },
        {
          "name": "纳库鲁",
          "code": "NUU"
        },
        {
          "name": "涅里",
          "code": "NYE"
        },
        {
          "name": "尼亚米拉",
          "code": "NYM"
        },
        {
          "name": "年达鲁阿",
          "code": "NYN"
        },
        {
          "name": "马萨布布",
          "code": "RBT"
        },
        {
          "name": "夏亚",
          "code": "SIA"
        },
        {
          "name": "特兰斯-恩佐亚",
          "code": "TNZ"
        },
        {
          "name": "塔纳河",
          "code": "TRI"
        },
        {
          "name": "泰塔塔维塔",
          "code": "TTA"
        },
        {
          "name": "图尔卡纳",
          "code": "TUR"
        },
        {
          "name": "桑布卢",
          "code": "UAS"
        },
        {
          "name": "瓦辛基苏",
          "code": "UGI"
        },
        {
          "name": "韦希加",
          "code": "VIH"
        },
        {
          "name": "瓦吉尔",
          "code": "WJR"
        },
        {
          "name": "西波克特",
          "code": "WPO"
        }
      ]
    }
  },
  {
    "name": "吉尔吉斯斯坦",
    "code": "KGZ",
    "children": {
      "children": [
        {
          "name": "巴特肯",
          "code": "B"
        },
        {
          "name": "楚河",
          "code": "C"
        },
        {
          "name": "比什凯克市",
          "code": "GB"
        },
        {
          "name": "贾拉拉巴德",
          "code": "J"
        },
        {
          "name": "坎特",
          "code": "KAN"
        },
        {
          "name": "卡拉巴尔塔",
          "code": "KBA"
        },
        {
          "name": "科克扬加克",
          "code": "KJ"
        },
        {
          "name": "卡拉库尔",
          "code": "KKO"
        },
        {
          "name": "迈利赛",
          "code": "MS"
        },
        {
          "name": "纳伦",
          "code": "N"
        },
        {
          "name": "奥什",
          "code": "O"
        },
        {
          "name": "苏卢克图",
          "code": "SU"
        },
        {
          "name": "塔拉斯",
          "code": "T"
        },
        {
          "name": "塔什库梅尔",
          "code": "TK"
        },
        {
          "name": "乌兹根",
          "code": "UG"
        },
        {
          "name": "伊塞克湖",
          "code": "Y"
        }
      ]
    }
  },
  {
    "name": "柬埔寨",
    "code": "KHM",
    "children": {
      "children": [
        {
          "name": "马德望",
          "code": "BA"
        },
        {
          "name": "班迭棉吉",
          "code": "BM"
        },
        {
          "name": "西哈努克市",
          "code": "KA"
        },
        {
          "name": "白马市",
          "code": "KB"
        },
        {
          "name": "桔井",
          "code": "KH"
        },
        {
          "name": "戈公",
          "code": "KKZ"
        },
        {
          "name": "干丹",
          "code": "KL"
        },
        {
          "name": "磅湛",
          "code": "KM"
        },
        {
          "name": "贡布",
          "code": "KMT"
        },
        {
          "name": "磅士卑",
          "code": "KO"
        },
        {
          "name": "磅清扬",
          "code": "KZC"
        },
        {
          "name": "磅同",
          "code": "KZK"
        },
        {
          "name": "蒙多基里",
          "code": "MWV"
        },
        {
          "name": "奥多棉吉",
          "code": "OC"
        },
        {
          "name": "波罗勉",
          "code": "PG"
        },
        {
          "name": "拜林市",
          "code": "PL"
        },
        {
          "name": "金边市",
          "code": "PNH"
        },
        {
          "name": "菩萨",
          "code": "PO"
        },
        {
          "name": "柏威夏",
          "code": "PR"
        },
        {
          "name": "腊塔纳基里",
          "code": "RBE"
        },
        {
          "name": "暹粒",
          "code": "REP"
        },
        {
          "name": "柴桢",
          "code": "SVR"
        },
        {
          "name": "茶胶",
          "code": "TK"
        },
        {
          "name": "上丁",
          "code": "TNX"
        }
      ]
    }
  },
  {
    "name": "基里巴斯",
    "code": "KIR",
    "children": {
      "children": [
        {
          "name": "吉尔伯特群岛",
          "code": "GIL"
        },
        {
          "name": "莱恩群岛",
          "code": "LIN"
        },
        {
          "name": "菲尼克斯群岛",
          "code": "PHO"
        }
      ]
    }
  },
  {
    "name": "圣基茨和尼维斯",
    "code": "KNA"
  },
  {
    "name": "韩国",
    "code": "KOR",
    "children": [
      {
        "name": "首尔",
        "code": "11"
      },
      {
        "name": "釜山",
        "code": "26"
      },
      {
        "name": "大邱",
        "code": "27",
        "children": [
          {
            "name": "达城郡",
            "code": "DSG"
          },
          {
            "name": "寿城区",
            "code": "SUS"
          },
          {
            "name": "大邱",
            "code": "TAE"
          }
        ]
      },
      {
        "name": "仁川",
        "code": "28"
      },
      {
        "name": "光州",
        "code": "29"
      },
      {
        "name": "大田",
        "code": "30"
      },
      {
        "name": "蔚山",
        "code": "31"
      },
      {
        "name": "济州特别自治道",
        "code": "41"
      },
      {
        "name": "江原道",
        "code": "42",
        "children": [
          {
            "name": "春川市",
            "code": "CHC"
          },
          {
            "name": "铁原郡",
            "code": "CWN"
          },
          {
            "name": "高城郡",
            "code": "GSG"
          },
          {
            "name": "华川郡",
            "code": "HCH"
          },
          {
            "name": "洪川郡",
            "code": "HCN"
          },
          {
            "name": "横城郡",
            "code": "HSG"
          },
          {
            "name": "麟蹄郡",
            "code": "IJE"
          },
          {
            "name": "旌善郡",
            "code": "JSE"
          },
          {
            "name": "江陵市",
            "code": "KAG"
          },
          {
            "name": "平昌郡",
            "code": "POG"
          },
          {
            "name": "束草市",
            "code": "SHO"
          },
          {
            "name": "三陟市",
            "code": "SUK"
          },
          {
            "name": "太白市",
            "code": "TBK"
          },
          {
            "name": "东海市",
            "code": "TGH"
          },
          {
            "name": "原州市",
            "code": "WJU"
          },
          {
            "name": "杨口郡",
            "code": "YGU"
          },
          {
            "name": "襄阳郡",
            "code": "YNY"
          },
          {
            "name": "宁越郡",
            "code": "YWL"
          }
        ]
      },
      {
        "name": "庆尚北道",
        "code": "43",
        "children": [
          {
            "name": "安东市",
            "code": "ADG"
          },
          {
            "name": "奉化郡",
            "code": "BHA"
          },
          {
            "name": "淸道郡",
            "code": "CDO"
          },
          {
            "name": "漆谷郡",
            "code": "CGK"
          },
          {
            "name": "靑松郡",
            "code": "CSG"
          },
          {
            "name": "庆州市",
            "code": "GJU"
          },
          {
            "name": "高灵郡",
            "code": "GRG"
          },
          {
            "name": "军威郡",
            "code": "GWI"
          },
          {
            "name": "庆山市",
            "code": "GYS"
          },
          {
            "name": "金泉市",
            "code": "KMC"
          },
          {
            "name": "浦项市",
            "code": "KPO"
          },
          {
            "name": "龟尾市",
            "code": "KUM"
          },
          {
            "name": "闻庆市",
            "code": "MGG"
          },
          {
            "name": "星州郡",
            "code": "SEJ"
          },
          {
            "name": "尙州市",
            "code": "SJU"
          },
          {
            "name": "蔚珍郡",
            "code": "UJN"
          },
          {
            "name": "郁陵郡",
            "code": "ULG"
          },
          {
            "name": "义城郡",
            "code": "USG"
          },
          {
            "name": "永川市",
            "code": "YCH"
          },
          {
            "name": "盈德郡",
            "code": "YDK"
          },
          {
            "name": "醴泉郡",
            "code": "YEC"
          },
          {
            "name": "荣州市",
            "code": "YEJ"
          },
          {
            "name": "英阳郡",
            "code": "YYG"
          }
        ]
      },
      {
        "name": "庆尚南道",
        "code": "44",
        "children": [
          {
            "name": "鎭海市",
            "code": "CHF"
          },
          {
            "name": "昌原市",
            "code": "CHW"
          },
          {
            "name": "昌宁郡",
            "code": "CNG"
          },
          {
            "name": "居昌郡",
            "code": "GCH"
          },
          {
            "name": "固城郡",
            "code": "GSO"
          },
          {
            "name": "咸安郡",
            "code": "HAN"
          },
          {
            "name": "陜川郡",
            "code": "HCE"
          },
          {
            "name": "河东郡",
            "code": "HDG"
          },
          {
            "name": "晋州市",
            "code": "HIN"
          },
          {
            "name": "咸阳郡",
            "code": "HYG"
          },
          {
            "name": "巨济市",
            "code": "KJE"
          },
          {
            "name": "金海市",
            "code": "KMH"
          },
          {
            "name": "马山市",
            "code": "MAS"
          },
          {
            "name": "密阳市",
            "code": "MIR"
          },
          {
            "name": "南海郡",
            "code": "NHE"
          },
          {
            "name": "泗川市",
            "code": "SAH"
          },
          {
            "name": "山淸郡",
            "code": "SCH"
          },
          {
            "name": "统营市",
            "code": "TYG"
          },
          {
            "name": "宜宁郡",
            "code": "URG"
          },
          {
            "name": "梁山市",
            "code": "YSN"
          }
        ]
      },
      {
        "name": "忠清北道",
        "code": "45",
        "children": [
          {
            "name": "报恩郡",
            "code": "BEN"
          },
          {
            "name": "忠州市",
            "code": "CHU"
          },
          {
            "name": "淸州市",
            "code": "CJJ"
          },
          {
            "name": "淸原郡",
            "code": "CWO"
          },
          {
            "name": "丹阳郡",
            "code": "DYG"
          },
          {
            "name": "阴城郡",
            "code": "ESG"
          },
          {
            "name": "槐山郡",
            "code": "GSN"
          },
          {
            "name": "堤川市",
            "code": "JCH"
          },
          {
            "name": "鎭川郡",
            "code": "JCN"
          },
          {
            "name": "曾坪郡",
            "code": "JYG"
          },
          {
            "name": "沃川郡",
            "code": "OCN"
          },
          {
            "name": "永同郡",
            "code": "YDG"
          }
        ]
      },
      {
        "name": "忠清南道",
        "code": "46",
        "children": [
          {
            "name": "牙山市",
            "code": "ASA"
          },
          {
            "name": "保宁市",
            "code": "BOR"
          },
          {
            "name": "扶余郡",
            "code": "BYO"
          },
          {
            "name": "天安市",
            "code": "CHO"
          },
          {
            "name": "青阳郡",
            "code": "CYG"
          },
          {
            "name": "公州市",
            "code": "GOJ"
          },
          {
            "name": "锦山郡",
            "code": "GSA"
          },
          {
            "name": "鸡龙市",
            "code": "GYE"
          },
          {
            "name": "洪城郡",
            "code": "HSE"
          },
          {
            "name": "论山市",
            "code": "NSN"
          },
          {
            "name": "舒川郡",
            "code": "SCE"
          },
          {
            "name": "瑞山市",
            "code": "SSA"
          },
          {
            "name": "泰安郡",
            "code": "TAN"
          },
          {
            "name": "唐津郡",
            "code": "TJI"
          },
          {
            "name": "燕岐郡",
            "code": "YGI"
          },
          {
            "name": "礼山郡",
            "code": "YOS"
          }
        ]
      },
      {
        "name": "全罗北道",
        "code": "47",
        "children": [
          {
            "name": "高敞郡",
            "code": "GCG"
          },
          {
            "name": "金堤市",
            "code": "GJE"
          },
          {
            "name": "益山市",
            "code": "IKS"
          },
          {
            "name": "任实郡",
            "code": "ISL"
          },
          {
            "name": "鎭安郡",
            "code": "JAN"
          },
          {
            "name": "井邑市",
            "code": "JEO"
          },
          {
            "name": "全州市",
            "code": "JNJ"
          },
          {
            "name": "长水郡",
            "code": "JSU"
          },
          {
            "name": "群山市",
            "code": "KUV"
          },
          {
            "name": "茂朱郡",
            "code": "MJU"
          },
          {
            "name": "南原市",
            "code": "NWN"
          },
          {
            "name": "扶安郡",
            "code": "PUS"
          },
          {
            "name": "淳昌郡",
            "code": "SCG"
          },
          {
            "name": "完州郡",
            "code": "WAJ"
          }
        ]
      },
      {
        "name": "全罗南道",
        "code": "48",
        "children": [
          {
            "name": "宝城郡",
            "code": "BSG"
          },
          {
            "name": "潭阳郡",
            "code": "DYA"
          },
          {
            "name": "高兴郡",
            "code": "GHG"
          },
          {
            "name": "康津郡",
            "code": "GJN"
          },
          {
            "name": "求礼郡",
            "code": "GRE"
          },
          {
            "name": "谷城郡",
            "code": "GSE"
          },
          {
            "name": "海南郡",
            "code": "HAE"
          },
          {
            "name": "咸平郡",
            "code": "HPG"
          },
          {
            "name": "和顺郡",
            "code": "HSN"
          },
          {
            "name": "珍岛郡",
            "code": "JDO"
          },
          {
            "name": "长兴郡",
            "code": "JHG"
          },
          {
            "name": "长城郡",
            "code": "JSN"
          },
          {
            "name": "光阳市",
            "code": "KAN"
          },
          {
            "name": "务安郡",
            "code": "MAN"
          },
          {
            "name": "木浦市",
            "code": "MOK"
          },
          {
            "name": "罗州市",
            "code": "NJU"
          },
          {
            "name": "新安郡",
            "code": "SAN"
          },
          {
            "name": "顺天市",
            "code": "SYS"
          },
          {
            "name": "莞岛郡",
            "code": "WND"
          },
          {
            "name": "灵岩郡",
            "code": "YAM"
          },
          {
            "name": "灵光郡",
            "code": "YGG"
          },
          {
            "name": "丽水市",
            "code": "YOS"
          }
        ]
      },
      {
        "name": "京畿道",
        "code": "49",
        "children": [
          {
            "name": "安养市",
            "code": "ANY"
          },
          {
            "name": "安城市",
            "code": "ASG"
          },
          {
            "name": "安山市",
            "code": "ASN"
          },
          {
            "name": "富川市",
            "code": "BCN"
          },
          {
            "name": "东豆川市",
            "code": "DDC"
          },
          {
            "name": "果川市",
            "code": "GCN"
          },
          {
            "name": "光明市",
            "code": "GMG"
          },
          {
            "name": "金浦市",
            "code": "GMP"
          },
          {
            "name": "加平郡",
            "code": "GPG"
          },
          {
            "name": "九里市",
            "code": "GRI"
          },
          {
            "name": "军浦市",
            "code": "GUN"
          },
          {
            "name": "高阳市",
            "code": "GYG"
          },
          {
            "name": "华城市",
            "code": "HCH"
          },
          {
            "name": "河南市",
            "code": "HNM"
          },
          {
            "name": "利川市",
            "code": "ICE"
          },
          {
            "name": "广州市",
            "code": "KWU"
          },
          {
            "name": "南杨州市",
            "code": "NYU"
          },
          {
            "name": "乌山市",
            "code": "OSN"
          },
          {
            "name": "坡州市",
            "code": "PJU"
          },
          {
            "name": "抱川市",
            "code": "POC"
          },
          {
            "name": "平泽市",
            "code": "PTK"
          },
          {
            "name": "城南市",
            "code": "SEO"
          },
          {
            "name": "始兴市",
            "code": "SHE"
          },
          {
            "name": "水原市",
            "code": "SUO"
          },
          {
            "name": "议政府市",
            "code": "UIJ"
          },
          {
            "name": "仪旺市",
            "code": "UWN"
          },
          {
            "name": "涟川郡",
            "code": "YCN"
          },
          {
            "name": "骊州郡",
            "code": "YJU"
          },
          {
            "name": "龙仁市",
            "code": "YNG"
          },
          {
            "name": "扬平郡",
            "code": "YPG"
          },
          {
            "name": "杨州市",
            "code": "YYU"
          }
        ]
      }
    ]
  },
  {
    "name": "科威特",
    "code": "KWT"
  },
  {
    "name": "卡塔尔",
    "code": "QAT",
    "children": {
      "children": [
        {
          "name": "多哈",
          "code": "DW"
        },
        {
          "name": "古韦里耶",
          "code": "GW"
        },
        {
          "name": "杰里扬拜特奈",
          "code": "JB"
        },
        {
          "name": "朱迈利耶",
          "code": "JM"
        },
        {
          "name": "豪尔",
          "code": "KR"
        },
        {
          "name": "北部",
          "code": "MS"
        },
        {
          "name": "赖扬",
          "code": "RN"
        },
        {
          "name": "乌姆锡拉勒",
          "code": "UL"
        },
        {
          "name": "沃克拉",
          "code": "WK"
        }
      ]
    }
  },
  {
    "name": "老挝",
    "code": "LAO",
    "children": {
      "children": [
        {
          "name": "阿速坡",
          "code": "AT"
        },
        {
          "name": "博乔",
          "code": "BK"
        },
        {
          "name": "波里坎赛",
          "code": "BL"
        },
        {
          "name": "占巴塞",
          "code": "CH"
        },
        {
          "name": "华潘",
          "code": "HO"
        },
        {
          "name": "沙耶武里",
          "code": "XA"
        },
        {
          "name": "色贡",
          "code": "XE"
        },
        {
          "name": "川圹",
          "code": "XI"
        },
        {
          "name": "赛宋本行政特区",
          "code": "XN"
        },
        {
          "name": "甘蒙",
          "code": "KH"
        },
        {
          "name": "琅南塔",
          "code": "LM"
        },
        {
          "name": "琅勃拉邦",
          "code": "LP"
        },
        {
          "name": "乌多姆赛",
          "code": "OU"
        },
        {
          "name": "丰沙里",
          "code": "PH"
        },
        {
          "name": "沙拉湾",
          "code": "SL"
        },
        {
          "name": "沙湾拿吉",
          "code": "SV"
        },
        {
          "name": "万象",
          "code": "VI"
        }
      ]
    }
  },
  {
    "name": "黎巴嫩",
    "code": "LBN",
    "children": {
      "children": [
        {
          "name": "北部",
          "code": "AS"
        },
        {
          "name": "贝鲁特",
          "code": "BA"
        },
        {
          "name": "贝卡",
          "code": "BI"
        },
        {
          "name": "南部",
          "code": "JA"
        },
        {
          "name": "黎巴嫩山",
          "code": "JL"
        },
        {
          "name": "奈拜提耶市",
          "code": "NA"
        }
      ]
    }
  },
  {
    "name": "利比里亚",
    "code": "LBR",
    "children": {
      "children": [
        {
          "name": "邦",
          "code": "BG"
        },
        {
          "name": "博米",
          "code": "BM"
        },
        {
          "name": "博波卢",
          "code": "BOP"
        },
        {
          "name": "大角山",
          "code": "CM"
        },
        {
          "name": "菲什敦",
          "code": "FT"
        },
        {
          "name": "大巴萨",
          "code": "GB"
        },
        {
          "name": "巴波卢",
          "code": "GBA"
        },
        {
          "name": "大吉德",
          "code": "GG"
        },
        {
          "name": "大克鲁",
          "code": "GK"
        },
        {
          "name": "洛法",
          "code": "LO"
        },
        {
          "name": "马吉比",
          "code": "MG"
        },
        {
          "name": "蒙特塞拉多",
          "code": "MO"
        },
        {
          "name": "马里兰",
          "code": "MY"
        },
        {
          "name": "宁巴",
          "code": "NI"
        },
        {
          "name": "吉河",
          "code": "RG"
        },
        {
          "name": "里弗塞斯",
          "code": "RI"
        },
        {
          "name": "锡诺",
          "code": "SI"
        }
      ]
    }
  },
  {
    "name": "利比亚",
    "code": "LBY"
  },
  {
    "name": "圣卢西亚",
    "code": "LCA"
  },
  {
    "name": "列支敦士登",
    "code": "LIE"
  },
  {
    "name": "斯里兰卡",
    "code": "LKA",
    "children": {
      "children": [
        {
          "name": "阿努拉德普勒",
          "code": "ADP"
        },
        {
          "name": "安帕赖",
          "code": "AMP"
        },
        {
          "name": "巴杜勒",
          "code": "BAD"
        },
        {
          "name": "拜蒂克洛",
          "code": "BTC"
        },
        {
          "name": "科伦坡",
          "code": "CMB"
        },
        {
          "name": "加勒",
          "code": "GAL"
        },
        {
          "name": "加姆珀哈",
          "code": "GAM"
        },
        {
          "name": "汉班托特",
          "code": "HBA"
        },
        {
          "name": "贾夫纳",
          "code": "JAF"
        },
        {
          "name": "康提",
          "code": "KAN"
        },
        {
          "name": "凯格勒",
          "code": "KEG"
        },
        {
          "name": "基里诺奇",
          "code": "KIL"
        },
        {
          "name": "卡卢特勒",
          "code": "KLT"
        },
        {
          "name": "库鲁内格勒",
          "code": "KUR"
        },
        {
          "name": "马特勒",
          "code": "MAA"
        },
        {
          "name": "马纳尔",
          "code": "MAN"
        },
        {
          "name": "马特莱",
          "code": "MAT"
        },
        {
          "name": "莫讷勒格勒",
          "code": "MON"
        },
        {
          "name": "穆莱蒂武",
          "code": "MUL"
        },
        {
          "name": "努沃勒埃利耶",
          "code": "NUE"
        },
        {
          "name": "波隆纳鲁沃",
          "code": "POL"
        },
        {
          "name": "普塔勒姆",
          "code": "PUT"
        },
        {
          "name": "拉特纳普勒",
          "code": "RAT"
        },
        {
          "name": "亭可马里",
          "code": "TRR"
        },
        {
          "name": "瓦武尼亚",
          "code": "VAV"
        }
      ]
    }
  },
  {
    "name": "莱索托",
    "code": "LSO",
    "children": {
      "children": [
        {
          "name": "马塞卢",
          "code": "A"
        },
        {
          "name": "布塔布泰",
          "code": "B"
        },
        {
          "name": "莱里贝",
          "code": "C"
        },
        {
          "name": "伯里亚",
          "code": "D"
        },
        {
          "name": "马费滕",
          "code": "E"
        },
        {
          "name": "莫哈莱斯胡克",
          "code": "F"
        },
        {
          "name": "古廷",
          "code": "G"
        },
        {
          "name": "加查斯内克",
          "code": "H"
        },
        {
          "name": "莫霍特隆",
          "code": "J"
        },
        {
          "name": "塔巴采卡",
          "code": "K"
        }
      ]
    }
  },
  {
    "name": "立陶宛",
    "code": "LTU",
    "children": {
      "children": [
        {
          "name": "亚克曼",
          "code": "AKM"
        },
        {
          "name": "阿利图斯",
          "code": "AL"
        },
        {
          "name": "考纳斯",
          "code": "KA"
        },
        {
          "name": "克莱佩达",
          "code": "KL"
        },
        {
          "name": "马里扬泊列",
          "code": "MA"
        },
        {
          "name": "帕涅韦日斯",
          "code": "PA"
        },
        {
          "name": "希奥利艾",
          "code": "SI"
        },
        {
          "name": "陶拉格",
          "code": "TA"
        },
        {
          "name": "特尔希艾",
          "code": "TE"
        },
        {
          "name": "乌田纳",
          "code": "UT"
        },
        {
          "name": "维尔纽斯",
          "code": "VI"
        }
      ]
    }
  },
  {
    "name": "卢森堡",
    "code": "LUX",
    "children": {
      "children": [
        {
          "name": "迪基希",
          "code": "DD"
        },
        {
          "name": "格雷文马赫",
          "code": "GG"
        },
        {
          "name": "卢森堡",
          "code": "LL"
        }
      ]
    }
  },
  {
    "name": "拉脱维亚",
    "code": "LVA",
    "children": {
      "children": [
        {
          "name": "爱兹克劳克雷",
          "code": "AIZ"
        },
        {
          "name": "阿卢克斯内",
          "code": "ALU"
        },
        {
          "name": "巴尔维",
          "code": "BAL"
        },
        {
          "name": "包斯卡",
          "code": "BAU"
        },
        {
          "name": "采西斯",
          "code": "CES"
        },
        {
          "name": "陶格夫皮尔斯",
          "code": "DGR"
        },
        {
          "name": "多贝莱",
          "code": "DOB"
        },
        {
          "name": "古尔贝内",
          "code": "GUL"
        },
        {
          "name": "杰卡布皮尔斯",
          "code": "JEK"
        },
        {
          "name": "叶尔加瓦",
          "code": "JGR"
        },
        {
          "name": "克拉斯拉瓦",
          "code": "KRA"
        },
        {
          "name": "库尔迪加",
          "code": "KUL"
        },
        {
          "name": "林巴济",
          "code": "LIM"
        },
        {
          "name": "利耶帕亚",
          "code": "LPK"
        },
        {
          "name": "卢扎",
          "code": "LUD"
        },
        {
          "name": "马多纳",
          "code": "MAD"
        },
        {
          "name": "奥格雷",
          "code": "OGR"
        },
        {
          "name": "普雷利",
          "code": "PRE"
        },
        {
          "name": "里加",
          "code": "RGA"
        },
        {
          "name": "雷泽克内",
          "code": "RZR"
        },
        {
          "name": "萨尔杜斯",
          "code": "SAL"
        },
        {
          "name": "塔尔西",
          "code": "TAL"
        },
        {
          "name": "图库马",
          "code": "TUK"
        },
        {
          "name": "瓦尔加",
          "code": "VLK"
        },
        {
          "name": "瓦尔米耶拉",
          "code": "VLM"
        },
        {
          "name": "文茨皮尔斯",
          "code": "VSL"
        }
      ]
    }
  },
  {
    "name": "摩洛哥",
    "code": "MAR",
    "children": {
      "children": [
        {
          "name": "卡萨布兰卡",
          "code": "CBL"
        },
        {
          "name": "非斯",
          "code": "FES"
        },
        {
          "name": "梅克内斯",
          "code": "MKN"
        },
        {
          "name": "马拉喀什",
          "code": "MRK"
        },
        {
          "name": "乌季达",
          "code": "OUJ"
        },
        {
          "name": "拉巴特",
          "code": "RSA"
        },
        {
          "name": "得土安",
          "code": "TET"
        },
        {
          "name": "丹吉尔",
          "code": "TGR"
        },
        {
          "name": "西撒哈拉",
          "code": "WSH"
        }
      ]
    }
  },
  {
    "name": "摩纳哥",
    "code": "MCO"
  },
  {
    "name": "摩尔多瓦",
    "code": "MDA"
  },
  {
    "name": "马达加斯加",
    "code": "MDG",
    "children": {
      "children": [
        {
          "name": "塔那那利佛",
          "code": "AN"
        },
        {
          "name": "安齐拉纳纳",
          "code": "AS"
        },
        {
          "name": "菲亚纳兰楚阿",
          "code": "FN"
        },
        {
          "name": "马哈赞加",
          "code": "MJ"
        },
        {
          "name": "图利亚拉",
          "code": "TL"
        },
        {
          "name": "图阿马西拉",
          "code": "TM"
        }
      ]
    }
  },
  {
    "name": "马尔代夫",
    "code": "MDV",
    "children": {
      "children": [
        {
          "name": "北阿里",
          "code": "AAD"
        },
        {
          "name": "南阿里",
          "code": "AAU"
        },
        {
          "name": "阿杜",
          "code": "ADD"
        },
        {
          "name": "法迪福卢",
          "code": "FAA"
        },
        {
          "name": "费利杜",
          "code": "FEA"
        },
        {
          "name": "福阿穆拉库",
          "code": "FMU"
        },
        {
          "name": "北苏瓦迪瓦",
          "code": "HAD"
        },
        {
          "name": "南苏瓦迪瓦",
          "code": "HAU"
        },
        {
          "name": "哈杜马蒂",
          "code": "HDH"
        },
        {
          "name": "科卢马杜卢",
          "code": "KLH"
        },
        {
          "name": "马累岛",
          "code": "MAA"
        },
        {
          "name": "北马洛斯马杜卢",
          "code": "MAD"
        },
        {
          "name": "马累",
          "code": "MAL"
        },
        {
          "name": "南马洛斯马杜卢",
          "code": "MAU"
        },
        {
          "name": "北米拉杜马杜卢",
          "code": "MLD"
        },
        {
          "name": "南米拉杜马杜卢",
          "code": "MLU"
        },
        {
          "name": "穆拉库",
          "code": "MUA"
        },
        {
          "name": "北尼兰杜",
          "code": "NAD"
        },
        {
          "name": "南尼兰杜",
          "code": "NAU"
        },
        {
          "name": "北蒂拉杜马蒂",
          "code": "THD"
        },
        {
          "name": "南蒂拉杜马蒂",
          "code": "THU"
        }
      ]
    }
  },
  {
    "name": "墨西哥",
    "code": "MEX",
    "children": {
      "children": [
        {
          "name": "阿卡普尔科",
          "code": "ACA"
        },
        {
          "name": "阿瓜斯卡连斯特",
          "code": "AGU"
        },
        {
          "name": "华雷斯港",
          "code": "BJU"
        },
        {
          "name": "埃佩切",
          "code": "CAM"
        },
        {
          "name": "卡门",
          "code": "CAR"
        },
        {
          "name": "奇瓦瓦",
          "code": "CHH"
        },
        {
          "name": "奇尔潘辛戈",
          "code": "CHI"
        },
        {
          "name": "塞拉亚",
          "code": "CLY"
        },
        {
          "name": "夸察夸拉克斯",
          "code": "COA"
        },
        {
          "name": "科利马",
          "code": "COL"
        },
        {
          "name": "切图马尔",
          "code": "CTM"
        },
        {
          "name": "库利阿坎",
          "code": "CUL"
        },
        {
          "name": "库埃纳瓦卡",
          "code": "CVC"
        },
        {
          "name": "杜兰戈",
          "code": "DUR"
        },
        {
          "name": "恩塞纳达",
          "code": "ESE"
        },
        {
          "name": "瓜达拉哈拉",
          "code": "GDL"
        },
        {
          "name": "瓜纳华托",
          "code": "GUA"
        },
        {
          "name": "埃莫西约",
          "code": "HMO"
        },
        {
          "name": "伊拉普阿托",
          "code": "IRP"
        },
        {
          "name": "哈拉帕",
          "code": "JAL"
        },
        {
          "name": "华雷斯",
          "code": "JUZ"
        },
        {
          "name": "克雷塔罗",
          "code": "QUE"
        },
        {
          "name": "拉巴斯",
          "code": "LAP"
        },
        {
          "name": "莱昂",
          "code": "LEN"
        },
        {
          "name": "洛斯莫奇斯",
          "code": "LMM"
        },
        {
          "name": "蒙克洛瓦",
          "code": "LOV"
        },
        {
          "name": "马塔莫罗斯",
          "code": "MAM"
        },
        {
          "name": "墨西哥城",
          "code": "MEX"
        },
        {
          "name": "墨西卡利",
          "code": "MXL"
        },
        {
          "name": "梅里达",
          "code": "MID"
        },
        {
          "name": "莫雷利亚",
          "code": "MLM"
        },
        {
          "name": "蒙特雷",
          "code": "MTY"
        },
        {
          "name": "马萨特兰",
          "code": "MZT"
        },
        {
          "name": "新拉雷多",
          "code": "NLE"
        },
        {
          "name": "诺加莱斯",
          "code": "NOG"
        },
        {
          "name": "瓦哈卡",
          "code": "OAX"
        },
        {
          "name": "奥夫雷贡城",
          "code": "OBR"
        },
        {
          "name": "奥里萨巴",
          "code": "ORI"
        },
        {
          "name": "帕丘卡",
          "code": "PAC"
        },
        {
          "name": "波萨里卡",
          "code": "PRH"
        },
        {
          "name": "普埃布拉",
          "code": "PUE"
        },
        {
          "name": "巴亚尔塔港",
          "code": "PVR"
        },
        {
          "name": "雷诺萨",
          "code": "REX"
        },
        {
          "name": "圣路易斯波托亚",
          "code": "SLP"
        },
        {
          "name": "萨尔蒂约",
          "code": "SLW"
        },
        {
          "name": "坦皮科",
          "code": "TAM"
        },
        {
          "name": "塔帕丘拉",
          "code": "TAP"
        },
        {
          "name": "特瓦坎",
          "code": "TCN"
        },
        {
          "name": "图斯特拉-古铁雷斯",
          "code": "TGZ"
        },
        {
          "name": "蒂华纳",
          "code": "TIJ"
        },
        {
          "name": "特拉斯卡拉",
          "code": "TLA"
        },
        {
          "name": "托卢卡",
          "code": "TLC"
        },
        {
          "name": "特皮克",
          "code": "TPQ"
        },
        {
          "name": "托雷翁",
          "code": "TRC"
        },
        {
          "name": "乌鲁阿潘",
          "code": "UPN"
        },
        {
          "name": "韦拉克鲁斯",
          "code": "VER"
        },
        {
          "name": "巴利城",
          "code": "VHM"
        },
        {
          "name": "维多利亚城",
          "code": "VIC"
        },
        {
          "name": "比利亚埃尔莫萨",
          "code": "VSA"
        },
        {
          "name": "萨卡特卡斯",
          "code": "ZAC"
        }
      ]
    }
  },
  {
    "name": "马绍尔群岛",
    "code": "MHL"
  },
  {
    "name": "马其顿",
    "code": "MKD"
  },
  {
    "name": "马里",
    "code": "MLI",
    "children": {
      "children": [
        {
          "name": "巴马科首都区",
          "code": "CD"
        },
        {
          "name": "加奥",
          "code": "GA"
        },
        {
          "name": "基达尔",
          "code": "KD"
        },
        {
          "name": "库利科罗",
          "code": "KL"
        },
        {
          "name": "卡伊",
          "code": "KY"
        },
        {
          "name": "莫普提",
          "code": "MP"
        },
        {
          "name": "塞古",
          "code": "SG"
        },
        {
          "name": "锡卡索",
          "code": "SK"
        },
        {
          "name": "通布图",
          "code": "TB"
        }
      ]
    }
  },
  {
    "name": "马耳他",
    "code": "MLT"
  },
  {
    "name": "缅甸",
    "code": "MMR",
    "children": {
      "children": [
        {
          "name": "伊洛瓦底省",
          "code": "AY"
        },
        {
          "name": "勃固省",
          "code": "BG"
        },
        {
          "name": "钦邦",
          "code": "CH"
        },
        {
          "name": "克钦邦",
          "code": "KC"
        },
        {
          "name": "克耶邦",
          "code": "KH"
        },
        {
          "name": "克伦邦",
          "code": "KN"
        },
        {
          "name": "曼德勒省",
          "code": "MD"
        },
        {
          "name": "马圭省",
          "code": "MG"
        },
        {
          "name": "孟邦",
          "code": "MN"
        },
        {
          "name": "若开邦",
          "code": "RK"
        },
        {
          "name": "实皆省",
          "code": "SG"
        },
        {
          "name": "掸邦",
          "code": "SH"
        },
        {
          "name": "德林达依省",
          "code": "TN"
        },
        {
          "name": "仰光省",
          "code": "YG"
        }
      ]
    }
  },
  {
    "name": "蒙古",
    "code": "MNG",
    "children": {
      "children": [
        {
          "name": "乌兰巴托市",
          "code": "1"
        },
        {
          "name": "鄂尔浑",
          "code": "35"
        },
        {
          "name": "达尔汗乌勒",
          "code": "37"
        },
        {
          "name": "肯特",
          "code": "39"
        },
        {
          "name": "库苏古尔",
          "code": "41"
        },
        {
          "name": "科布多",
          "code": "43"
        },
        {
          "name": "乌布苏",
          "code": "46"
        },
        {
          "name": "中央",
          "code": "47"
        },
        {
          "name": "色楞格",
          "code": "49"
        },
        {
          "name": "苏赫巴托尔",
          "code": "51"
        },
        {
          "name": "扎布汗",
          "code": "57"
        },
        {
          "name": "中戈壁",
          "code": "59"
        },
        {
          "name": "东方",
          "code": "61"
        },
        {
          "name": "东戈壁",
          "code": "63"
        },
        {
          "name": "戈壁苏木贝尔",
          "code": "64"
        },
        {
          "name": "戈壁阿尔泰",
          "code": "65"
        },
        {
          "name": "布尔干",
          "code": "67"
        },
        {
          "name": "巴彦洪格尔",
          "code": "69"
        },
        {
          "name": "巴彦乌勒盖",
          "code": "71"
        },
        {
          "name": "后杭爱",
          "code": "73"
        },
        {
          "name": "南戈壁",
          "code": "UMN"
        },
        {
          "name": "前杭爱",
          "code": "UVO"
        }
      ]
    }
  },
  {
    "name": "北马里亚纳群岛",
    "code": "MNP"
  },
  {
    "name": "莫桑比克",
    "code": "MOZ"
  },
  {
    "name": "毛里塔尼亚",
    "code": "MRT",
    "children": {
      "children": [
        {
          "name": "阿德拉尔",
          "code": "AD"
        },
        {
          "name": "阿萨巴",
          "code": "AS"
        },
        {
          "name": "卜拉克纳",
          "code": "BR"
        },
        {
          "name": "努瓦迪布湾",
          "code": "DN"
        },
        {
          "name": "吉迪马卡",
          "code": "GM"
        },
        {
          "name": "戈尔戈勒",
          "code": "GO"
        },
        {
          "name": "西胡德",
          "code": "HC"
        },
        {
          "name": "东胡德",
          "code": "HG"
        },
        {
          "name": "因希里",
          "code": "IN"
        },
        {
          "name": "努瓦克肖特特区",
          "code": "NO"
        },
        {
          "name": "塔甘特",
          "code": "TA"
        },
        {
          "name": "特拉扎",
          "code": "TR"
        },
        {
          "name": "提里斯-宰穆尔",
          "code": "TZ"
        }
      ]
    }
  },
  {
    "name": "蒙特塞拉特",
    "code": "MSR"
  },
  {
    "name": "马提尼克",
    "code": "MTQ"
  },
  {
    "name": "毛里求斯",
    "code": "MUS"
  },
  {
    "name": "马拉维",
    "code": "MWI",
    "children": {
      "children": [
        {
          "name": "中央区",
          "code": "C"
        },
        {
          "name": "北部区",
          "code": "N"
        },
        {
          "name": "南部区",
          "code": "S"
        }
      ]
    }
  },
  {
    "name": "马来西亚",
    "code": "MYS",
    "children": [
      {
        "name": "柔佛",
        "code": "JH",
        "children": [
          {
            "name": "峇株巴辖",
            "code": "BAT"
          },
          {
            "name": "新山",
            "code": "JHB"
          },
          {
            "name": "居銮",
            "code": "KLA"
          },
          {
            "name": "哥打丁宜",
            "code": "KTI"
          },
          {
            "name": "丰盛港",
            "code": "MEP"
          },
          {
            "name": "麻坡",
            "code": "MUA"
          },
          {
            "name": "笨珍",
            "code": "POW"
          },
          {
            "name": "昔加末",
            "code": "SGM"
          }
        ]
      },
      {
        "name": "吉打",
        "code": "KD",
        "children": [
          {
            "name": "华玲",
            "code": "BLZ"
          },
          {
            "name": "万拉峇鲁",
            "code": "BMA"
          },
          {
            "name": "居林",
            "code": "KLM"
          },
          {
            "name": "瓜拉姆达",
            "code": "KMU"
          },
          {
            "name": "哥打士打",
            "code": "KOR"
          },
          {
            "name": "古邦巴素",
            "code": "KPA"
          },
          {
            "name": "浮罗交怡",
            "code": "LGK"
          },
          {
            "name": "笨筒",
            "code": "PEN"
          },
          {
            "name": "巴东得腊",
            "code": "PGT"
          }
        ]
      },
      {
        "name": "吉隆坡",
        "code": "KL",
        "children": {
          "name": "吉隆坡",
          "code": "KUL"
        }
      },
      {
        "name": "吉兰丹",
        "code": "KN",
        "children": [
          {
            "name": "登卓",
            "code": "BAC"
          },
          {
            "name": "话望生",
            "code": "GMU"
          },
          {
            "name": "日里",
            "code": "JEL"
          },
          {
            "name": "哥打巴鲁",
            "code": "KBR"
          },
          {
            "name": "瓜拉吉赖",
            "code": "KUG"
          },
          {
            "name": "马樟",
            "code": "MAC"
          },
          {
            "name": "巴西马",
            "code": "PMA"
          },
          {
            "name": "巴西富地",
            "code": "PPU"
          },
          {
            "name": "丹那美拉",
            "code": "TMR"
          },
          {
            "name": "道北",
            "code": "TUM"
          }
        ]
      },
      {
        "name": "纳闽",
        "code": "LB",
        "children": [
          {
            "name": "纳闽",
            "code": "LBU"
          },
          {
            "name": "维多利亚",
            "code": "VIC"
          }
        ]
      },
      {
        "name": "马六甲",
        "code": "ML",
        "children": [
          {
            "name": "亚罗牙也",
            "code": "AOG"
          },
          {
            "name": "野新",
            "code": "JAS"
          },
          {
            "name": "马六甲市",
            "code": "MEL"
          }
        ]
      },
      {
        "name": "森美兰",
        "code": "NS",
        "children": [
          {
            "name": "日叻务",
            "code": "JEL"
          },
          {
            "name": "仁保",
            "code": "JEP"
          },
          {
            "name": "瓜拉庇劳",
            "code": "KPI"
          },
          {
            "name": "波德申",
            "code": "PDI"
          },
          {
            "name": "林茂",
            "code": "REM"
          },
          {
            "name": "芙蓉",
            "code": "SRB"
          },
          {
            "name": "淡边",
            "code": "TAI"
          }
        ]
      },
      {
        "name": "彭亨",
        "code": "PG",
        "children": [
          {
            "name": "文冬",
            "code": "BEN"
          },
          {
            "name": "百乐",
            "code": "BER"
          },
          {
            "name": "金马仑高原",
            "code": "CAH"
          },
          {
            "name": "而连突",
            "code": "JER"
          },
          {
            "name": "关丹",
            "code": "KUA"
          },
          {
            "name": "立卑",
            "code": "KUL"
          },
          {
            "name": "马兰",
            "code": "MAR"
          },
          {
            "name": "北根",
            "code": "PEK"
          },
          {
            "name": "劳勿",
            "code": "RAU"
          },
          {
            "name": "淡马鲁",
            "code": "TEM"
          },
          {
            "name": "云冰",
            "code": "TOM"
          }
        ]
      },
      {
        "name": "槟榔屿",
        "code": "PH",
        "children": [
          {
            "name": "大山脚",
            "code": "BMJ"
          },
          {
            "name": "北海",
            "code": "BWH"
          },
          {
            "name": "高渊",
            "code": "NTE"
          },
          {
            "name": "槟城",
            "code": "PEN"
          }
        ]
      },
      {
        "name": "霹雳",
        "code": "PK",
        "children": [
          {
            "name": "华都牙也",
            "code": "BGA"
          },
          {
            "name": "怡保",
            "code": "IPH"
          },
          {
            "name": "江沙",
            "code": "KAR"
          },
          {
            "name": "紅土坎",
            "code": "LUM"
          },
          {
            "name": "和丰",
            "code": "SSP"
          },
          {
            "name": "丹绒马",
            "code": "TAM"
          },
          {
            "name": "安顺",
            "code": "TAS"
          },
          {
            "name": "太平",
            "code": "TPG"
          }
        ]
      },
      {
        "name": "玻璃市",
        "code": "PS",
        "children": {
          "name": "加央",
          "code": "KGR"
        }
      },
      {
        "name": "沙巴",
        "code": "SB",
        "children": [
          {
            "name": "保佛",
            "code": "BEF"
          },
          {
            "name": "比鲁兰",
            "code": "BEL"
          },
          {
            "name": "哥打基纳巴鲁",
            "code": "BKI"
          },
          {
            "name": "古打毛律",
            "code": "KBD"
          },
          {
            "name": "京那巴登岸",
            "code": "KBT"
          },
          {
            "name": "根地咬",
            "code": "KEG"
          },
          {
            "name": "哥打马鲁都",
            "code": "KMU"
          },
          {
            "name": "瓜拉班尤",
            "code": "KPU"
          },
          {
            "name": "古达",
            "code": "KUD"
          },
          {
            "name": "古纳",
            "code": "KUN"
          },
          {
            "name": "拿笃",
            "code": "LDU"
          },
          {
            "name": "纳巴湾",
            "code": "NAB"
          },
          {
            "name": "吧巴",
            "code": "PAP"
          },
          {
            "name": "必达士",
            "code": "PIT"
          },
          {
            "name": "兵南邦",
            "code": "PMP"
          },
          {
            "name": "兰脑",
            "code": "RNU"
          },
          {
            "name": "山打根",
            "code": "SDK"
          },
          {
            "name": "仙本那",
            "code": "SMM"
          },
          {
            "name": "西比陶",
            "code": "SPT"
          },
          {
            "name": "担布南",
            "code": "TAB"
          },
          {
            "name": "斗湖",
            "code": "TAW"
          },
          {
            "name": "丹南",
            "code": "TEN"
          },
          {
            "name": "斗亚兰",
            "code": "TUR"
          }
        ]
      },
      {
        "name": "雪兰莪",
        "code": "SL",
        "children": [
          {
            "name": "鹅麦",
            "code": "GOM"
          },
          {
            "name": "乌鲁冷岳",
            "code": "HUL"
          },
          {
            "name": "乌鲁雪兰莪",
            "code": "HUS"
          },
          {
            "name": "瓜拉冷岳",
            "code": "KLG"
          },
          {
            "name": "瓜拉雪兰莪",
            "code": "KSL"
          },
          {
            "name": "八打灵",
            "code": "PJA"
          },
          {
            "name": "沙白安南",
            "code": "SBM"
          },
          {
            "name": "雪邦",
            "code": "SEP"
          }
        ]
      },
      {
        "name": "沙捞越",
        "code": "SR",
        "children": [
          {
            "name": "木中",
            "code": "BTG"
          },
          {
            "name": "民都鲁",
            "code": "BTU"
          },
          {
            "name": "古晋",
            "code": "KCH"
          },
          {
            "name": "加帛",
            "code": "KPI"
          },
          {
            "name": "林梦",
            "code": "LMN"
          },
          {
            "name": "木胶",
            "code": "MKM"
          },
          {
            "name": "美里",
            "code": "MYY"
          },
          {
            "name": "斯里阿曼",
            "code": "SAM"
          },
          {
            "name": "泗里街",
            "code": "SAR"
          },
          {
            "name": "泗务",
            "code": "SBW"
          },
          {
            "name": "三马拉汉",
            "code": "SMH"
          }
        ]
      },
      {
        "name": "丁加奴",
        "code": "TR",
        "children": [
          {
            "name": "勿述",
            "code": "BES"
          },
          {
            "name": "龙运",
            "code": "DGN"
          },
          {
            "name": "乌鲁",
            "code": "HUL"
          },
          {
            "name": "甘马挽",
            "code": "KEM"
          },
          {
            "name": "马江",
            "code": "MAR"
          },
          {
            "name": "实兆",
            "code": "SET"
          },
          {
            "name": "瓜拉丁加奴",
            "code": "TGG"
          }
        ]
      }
    ]
  },
  {
    "name": "马约特岛",
    "code": "MYT"
  },
  {
    "name": "纳米比亚",
    "code": "NAM",
    "children": {
      "children": [
        {
          "name": "卡普里维",
          "code": "CA"
        },
        {
          "name": "埃龙戈",
          "code": "ER"
        },
        {
          "name": "哈达普",
          "code": "HA"
        },
        {
          "name": "霍马斯",
          "code": "KH"
        },
        {
          "name": "卡拉斯",
          "code": "KR"
        },
        {
          "name": "库内内",
          "code": "KU"
        },
        {
          "name": "奥卡万戈",
          "code": "KV"
        },
        {
          "name": "奥乔宗蒂约巴",
          "code": "OJ"
        },
        {
          "name": "奥马赫科",
          "code": "OK"
        },
        {
          "name": "奥沙纳",
          "code": "ON"
        },
        {
          "name": "奥希科托",
          "code": "OO"
        },
        {
          "name": "奥姆沙蒂",
          "code": "OT"
        },
        {
          "name": "奥汉圭纳",
          "code": "OW"
        }
      ]
    }
  },
  {
    "name": "新喀里多尼亚",
    "code": "NCL"
  },
  {
    "name": "尼日尔",
    "code": "NER",
    "children": {
      "children": [
        {
          "name": "阿加德兹",
          "code": "AJY"
        },
        {
          "name": "迪法",
          "code": "DIF"
        },
        {
          "name": "多索",
          "code": "DSS"
        },
        {
          "name": "马拉迪",
          "code": "MFQ"
        },
        {
          "name": "尼亚美市",
          "code": "NIM"
        },
        {
          "name": "塔瓦",
          "code": "THZ"
        },
        {
          "name": "蒂拉贝里",
          "code": "TIL"
        },
        {
          "name": "津德尔",
          "code": "ZND"
        }
      ]
    }
  },
  {
    "name": "诺福克",
    "code": "NFK"
  },
  {
    "name": "尼日利亚",
    "code": "NGA",
    "children": {
      "children": [
        {
          "name": "阿比亚",
          "code": "ABV"
        },
        {
          "name": "伊巴丹",
          "code": "IBA"
        },
        {
          "name": "卡诺",
          "code": "KAN"
        },
        {
          "name": "拉各斯",
          "code": "LOS"
        },
        {
          "name": "奥博莫绍",
          "code": "OGB"
        }
      ]
    }
  },
  {
    "name": "尼加拉瓜",
    "code": "NIC",
    "children": {
      "children": [
        {
          "name": "北大西洋",
          "code": "AN"
        },
        {
          "name": "南大西洋",
          "code": "AS"
        },
        {
          "name": "博阿科",
          "code": "BO"
        },
        {
          "name": "卡拉索",
          "code": "CA"
        },
        {
          "name": "奇南德加",
          "code": "CD"
        },
        {
          "name": "琼塔莱斯",
          "code": "CT"
        },
        {
          "name": "埃斯特利",
          "code": "ES"
        },
        {
          "name": "格拉纳达",
          "code": "GR"
        },
        {
          "name": "希诺特加",
          "code": "JI"
        },
        {
          "name": "莱昂",
          "code": "LE"
        },
        {
          "name": "马德里斯",
          "code": "MD"
        },
        {
          "name": "马那瓜",
          "code": "MN"
        },
        {
          "name": "马萨亚",
          "code": "MS"
        },
        {
          "name": "马塔加尔帕",
          "code": "MT"
        },
        {
          "name": "新塞哥维亚",
          "code": "NS"
        },
        {
          "name": "里瓦斯",
          "code": "RV"
        },
        {
          "name": "圣胡安河",
          "code": "SJ"
        }
      ]
    }
  },
  {
    "name": "纽埃",
    "code": "NIU"
  },
  {
    "name": "荷兰",
    "code": "NLD",
    "children": {
      "children": [
        {
          "name": "阿尔梅勒",
          "code": "AER"
        },
        {
          "name": "阿默斯福特",
          "code": "AME"
        },
        {
          "name": "阿姆斯特丹",
          "code": "AMS"
        },
        {
          "name": "阿珀尔多伦",
          "code": "APE"
        },
        {
          "name": "阿纳姆",
          "code": "ARN"
        },
        {
          "name": "阿森",
          "code": "ASS"
        },
        {
          "name": "布雷达",
          "code": "BRD"
        },
        {
          "name": "多德雷赫特",
          "code": "DOR"
        },
        {
          "name": "埃德",
          "code": "EDE"
        },
        {
          "name": "埃因霍芬",
          "code": "EIN"
        },
        {
          "name": "埃门",
          "code": "EMM"
        },
        {
          "name": "恩斯赫德",
          "code": "ENS"
        },
        {
          "name": "格罗宁根",
          "code": "GRQ"
        },
        {
          "name": "海牙",
          "code": "HAG"
        },
        {
          "name": "霍夫多尔普",
          "code": "HFD"
        },
        {
          "name": "哈勒姆",
          "code": "HRA"
        },
        {
          "name": "斯海尔托亨博思",
          "code": "HTB"
        },
        {
          "name": "莱利斯塔德",
          "code": "LEY"
        },
        {
          "name": "莱顿",
          "code": "LID"
        },
        {
          "name": "吕伐登",
          "code": "LWR"
        },
        {
          "name": "米德尔堡",
          "code": "MDL"
        },
        {
          "name": "马斯特里赫特",
          "code": "MST"
        },
        {
          "name": "奈梅亨",
          "code": "NIJ"
        },
        {
          "name": "鹿特丹",
          "code": "RTM"
        },
        {
          "name": "蒂尔堡",
          "code": "TLB"
        },
        {
          "name": "乌得勒支",
          "code": "UTC"
        },
        {
          "name": "佐特尔梅",
          "code": "ZTM"
        },
        {
          "name": "兹沃勒",
          "code": "ZWO"
        }
      ]
    }
  },
  {
    "name": "挪威",
    "code": "NOR",
    "children": {
      "children": [
        {
          "name": "东福尔",
          "code": "1"
        },
        {
          "name": "西阿格德尔",
          "code": "10"
        },
        {
          "name": "罗加兰",
          "code": "11"
        },
        {
          "name": "霍达兰",
          "code": "12"
        },
        {
          "name": "松恩－菲尤拉讷",
          "code": "14"
        },
        {
          "name": "默勒－鲁姆斯达尔",
          "code": "15"
        },
        {
          "name": "南特伦德拉格",
          "code": "16"
        },
        {
          "name": "北特伦德拉格",
          "code": "17"
        },
        {
          "name": "诺尔兰",
          "code": "18"
        },
        {
          "name": "特罗姆斯",
          "code": "19"
        },
        {
          "name": "阿克什胡斯",
          "code": "2"
        },
        {
          "name": "芬马克",
          "code": "20"
        },
        {
          "name": "奥斯陆市",
          "code": "3"
        },
        {
          "name": "海德马克",
          "code": "4"
        },
        {
          "name": "奥普兰",
          "code": "5"
        },
        {
          "name": "布斯克吕",
          "code": "6"
        },
        {
          "name": "西福尔",
          "code": "7"
        },
        {
          "name": "泰勒马克",
          "code": "8"
        },
        {
          "name": "东阿格德尔",
          "code": "9"
        }
      ]
    }
  },
  {
    "name": "尼泊尔",
    "code": "NPL",
    "children": {
      "children": [
        {
          "name": "巴格马蒂",
          "code": "BA"
        },
        {
          "name": "佩里",
          "code": "BH"
        },
        {
          "name": "道拉吉里",
          "code": "DH"
        },
        {
          "name": "甘达基",
          "code": "GA"
        },
        {
          "name": "贾纳克布尔",
          "code": "JA"
        },
        {
          "name": "格尔纳利",
          "code": "KA"
        },
        {
          "name": "戈西",
          "code": "KO"
        },
        {
          "name": "蓝毗尼",
          "code": "LU"
        },
        {
          "name": "马哈卡利",
          "code": "MA"
        },
        {
          "name": "梅吉",
          "code": "ME"
        },
        {
          "name": "纳拉亚尼",
          "code": "NA"
        },
        {
          "name": "拉布蒂",
          "code": "RA"
        },
        {
          "name": "萨加玛塔",
          "code": "SA"
        },
        {
          "name": "塞蒂",
          "code": "SE"
        }
      ]
    }
  },
  {
    "name": "瑙鲁",
    "code": "NRU"
  },
  {
    "name": "新西兰",
    "code": "NZL",
    "children": {
      "children": [
        {
          "name": "奥克兰",
          "code": "AUK"
        },
        {
          "name": "布莱尼姆",
          "code": "BHE"
        },
        {
          "name": "克赖斯特彻奇",
          "code": "CHC"
        },
        {
          "name": "达尼丁",
          "code": "DUD"
        },
        {
          "name": "北远",
          "code": "FNR"
        },
        {
          "name": "吉斯伯恩",
          "code": "GIS"
        },
        {
          "name": "格雷茅斯",
          "code": "GMN"
        },
        {
          "name": "黑斯廷斯",
          "code": "HAS"
        },
        {
          "name": "哈密尔顿",
          "code": "HLZ"
        },
        {
          "name": "因弗卡吉尔",
          "code": "IVC"
        },
        {
          "name": "凯帕拉",
          "code": "KAI"
        },
        {
          "name": "马努考",
          "code": "MNK"
        },
        {
          "name": "内皮尔",
          "code": "NPE"
        },
        {
          "name": "新普利茅斯",
          "code": "NPL"
        },
        {
          "name": "北岸",
          "code": "NSH"
        },
        {
          "name": "纳尔逊",
          "code": "NSN"
        },
        {
          "name": "北帕默斯顿",
          "code": "PMR"
        },
        {
          "name": "里士满",
          "code": "RMD"
        },
        {
          "name": "斯特拉特福德",
          "code": "STR"
        },
        {
          "name": "陶马鲁努伊",
          "code": "TAU"
        },
        {
          "name": "怀塔科拉",
          "code": "WAE"
        },
        {
          "name": "旺格努伊",
          "code": "WAG"
        },
        {
          "name": "瓦卡塔尼",
          "code": "WHK"
        },
        {
          "name": "旺阿雷",
          "code": "WRE"
        }
      ]
    }
  },
  {
    "name": "阿曼",
    "code": "OMN",
    "children": {
      "children": [
        {
          "name": "巴提奈地区",
          "code": "BA"
        },
        {
          "name": "内地地区",
          "code": "DA"
        },
        {
          "name": "马斯喀特省",
          "code": "MA"
        },
        {
          "name": "穆桑达姆省",
          "code": "MU"
        },
        {
          "name": "东部地区",
          "code": "SH"
        },
        {
          "name": "中部地区",
          "code": "WU"
        },
        {
          "name": "达希莱地区",
          "code": "ZA"
        },
        {
          "name": "佐法尔省",
          "code": "ZU"
        }
      ]
    }
  },
  {
    "name": "巴基斯坦",
    "code": "PAK",
    "children": {
      "children": [
        {
          "name": "故吉软瓦拉",
          "code": "GUJ"
        },
        {
          "name": "海德拉巴",
          "code": "HDD"
        },
        {
          "name": "伊斯兰堡",
          "code": "ISB"
        },
        {
          "name": "卡拉奇",
          "code": "KCT"
        },
        {
          "name": "拉合尔",
          "code": "LHE"
        },
        {
          "name": "费萨拉巴德",
          "code": "LYP"
        },
        {
          "name": "木尔坦",
          "code": "MUX"
        },
        {
          "name": "白沙瓦",
          "code": "PEW"
        },
        {
          "name": "拉瓦尔品第",
          "code": "RWP"
        }
      ]
    }
  },
  {
    "name": "巴拿马",
    "code": "PAN"
  },
  {
    "name": "皮特凯恩",
    "code": "PCN"
  },
  {
    "name": "秘鲁",
    "code": "PER",
    "children": {
      "children": [
        {
          "name": "亚马孙",
          "code": "AM"
        },
        {
          "name": "安卡什",
          "code": "AN"
        },
        {
          "name": "阿普里马克",
          "code": "AP"
        },
        {
          "name": "阿雷基帕",
          "code": "AR"
        },
        {
          "name": "阿亚库乔",
          "code": "AY"
        },
        {
          "name": "钦查阿尔塔",
          "code": "CHI"
        },
        {
          "name": "钦博特",
          "code": "CHM"
        },
        {
          "name": "卡哈马卡",
          "code": "CJ"
        },
        {
          "name": "卡亚俄",
          "code": "CL"
        },
        {
          "name": "库斯科",
          "code": "CU"
        },
        {
          "name": "瓦努科",
          "code": "HO"
        },
        {
          "name": "万卡维利卡",
          "code": "HV"
        },
        {
          "name": "伊卡",
          "code": "IC"
        },
        {
          "name": "胡宁",
          "code": "JU"
        },
        {
          "name": "胡利亚卡",
          "code": "JUL"
        },
        {
          "name": "拉利伯塔德",
          "code": "LD"
        },
        {
          "name": "利马",
          "code": "LI"
        },
        {
          "name": "洛雷托",
          "code": "LO"
        },
        {
          "name": "兰巴耶克",
          "code": "LY"
        },
        {
          "name": "马德雷德迪奥斯",
          "code": "MD"
        },
        {
          "name": "莫克瓜",
          "code": "MO"
        },
        {
          "name": "帕斯科",
          "code": "PA"
        },
        {
          "name": "皮乌拉",
          "code": "PI"
        },
        {
          "name": "普诺",
          "code": "PU"
        },
        {
          "name": "圣马丁",
          "code": "SM"
        },
        {
          "name": "苏拉纳",
          "code": "SUL"
        },
        {
          "name": "塔克纳",
          "code": "TA"
        },
        {
          "name": "通贝斯",
          "code": "TU"
        },
        {
          "name": "乌卡亚利",
          "code": "UC"
        }
      ]
    }
  },
  {
    "name": "菲律宾",
    "code": "PHL",
    "children": {
      "children": [
        {
          "name": "卡卢坎",
          "code": "CAO"
        },
        {
          "name": "宿务",
          "code": "CEB"
        },
        {
          "name": "达沃",
          "code": "DOR"
        },
        {
          "name": "马尼拉",
          "code": "MNL"
        }
      ]
    }
  },
  {
    "name": "帕劳群岛",
    "code": "PLW"
  },
  {
    "name": "巴布亚新几内亚",
    "code": "PNG",
    "children": {
      "children": [
        {
          "name": "布干维尔",
          "code": "BV"
        },
        {
          "name": "东新不列颠",
          "code": "EB"
        },
        {
          "name": "东部高地",
          "code": "EH"
        },
        {
          "name": "恩加",
          "code": "EN"
        },
        {
          "name": "东塞皮克",
          "code": "ES"
        },
        {
          "name": "海湾",
          "code": "GU"
        },
        {
          "name": "米尔恩湾",
          "code": "MB"
        },
        {
          "name": "马当",
          "code": "MD"
        },
        {
          "name": "马努斯",
          "code": "MN"
        },
        {
          "name": "莫罗贝",
          "code": "MR"
        },
        {
          "name": "莫尔兹比港",
          "code": "NC"
        },
        {
          "name": "新爱尔兰",
          "code": "NI"
        },
        {
          "name": "北部",
          "code": "NO"
        },
        {
          "name": "桑道恩",
          "code": "SA"
        },
        {
          "name": "南部高地",
          "code": "SH"
        },
        {
          "name": "钦布",
          "code": "SI"
        },
        {
          "name": "西新不列颠",
          "code": "WB"
        },
        {
          "name": "西部",
          "code": "WE"
        },
        {
          "name": "西部高地",
          "code": "WH"
        }
      ]
    }
  },
  {
    "name": "波兰",
    "code": "POL",
    "children": {
      "children": [
        {
          "name": "比亚瓦波德拉斯卡",
          "code": "BAP"
        },
        {
          "name": "比亚维斯托克",
          "code": "BIA"
        },
        {
          "name": "比托姆",
          "code": "BYT"
        },
        {
          "name": "比得哥什",
          "code": "BZG"
        },
        {
          "name": "海乌姆",
          "code": "CHO"
        },
        {
          "name": "霍茹夫",
          "code": "CHZ"
        },
        {
          "name": "切哈努夫",
          "code": "CIE"
        },
        {
          "name": "达布罗瓦戈尼察",
          "code": "DAB"
        },
        {
          "name": "埃尔布隆格",
          "code": "ELB"
        },
        {
          "name": "格但斯克",
          "code": "GDN"
        },
        {
          "name": "格丁尼亚",
          "code": "GDY"
        },
        {
          "name": "大波兰地区戈茹夫",
          "code": "GOW"
        },
        {
          "name": "格鲁琼兹",
          "code": "GRU"
        },
        {
          "name": "格利维采",
          "code": "GWC"
        },
        {
          "name": "绿山城",
          "code": "IEG"
        },
        {
          "name": "雅沃兹诺",
          "code": "JAW"
        },
        {
          "name": "耶莱尼亚古拉",
          "code": "JEG"
        },
        {
          "name": "卡利什",
          "code": "KAL"
        },
        {
          "name": "凯尔采",
          "code": "KLC"
        },
        {
          "name": "科宁",
          "code": "KON"
        },
        {
          "name": "克拉科夫",
          "code": "KRK"
        },
        {
          "name": "克罗斯诺",
          "code": "KRO"
        },
        {
          "name": "卡托维兹",
          "code": "KTW"
        },
        {
          "name": "塔尔诺布热格",
          "code": "QEP"
        },
        {
          "name": "沃姆扎",
          "code": "QOY"
        },
        {
          "name": "莱格尼察",
          "code": "LEG"
        },
        {
          "name": "莱什诺",
          "code": "LEZ"
        },
        {
          "name": "罗兹",
          "code": "LOD"
        },
        {
          "name": "卢布林",
          "code": "LUL"
        },
        {
          "name": "米什洛维采",
          "code": "MYL"
        },
        {
          "name": "新松奇",
          "code": "NOW"
        },
        {
          "name": "奥尔什丁",
          "code": "OLS"
        },
        {
          "name": "波莱",
          "code": "OPO"
        },
        {
          "name": "奥斯特罗文卡",
          "code": "OSS"
        },
        {
          "name": "科沙林",
          "code": "OSZ"
        },
        {
          "name": "皮瓦",
          "code": "PIL"
        },
        {
          "name": "彼得库夫",
          "code": "PIO"
        },
        {
          "name": "普沃茨克",
          "code": "PLO"
        },
        {
          "name": "波兹南",
          "code": "POZ"
        },
        {
          "name": "普热梅希尔",
          "code": "PRZ"
        },
        {
          "name": "拉多姆",
          "code": "RDM"
        },
        {
          "name": "鲁达",
          "code": "RDS"
        },
        {
          "name": "热舒夫",
          "code": "RZE"
        },
        {
          "name": "谢德尔采",
          "code": "SDC"
        },
        {
          "name": "谢拉兹",
          "code": "SIR"
        },
        {
          "name": "斯凯尔涅维采",
          "code": "SKI"
        },
        {
          "name": "斯武普斯克",
          "code": "SLP"
        },
        {
          "name": "索波特",
          "code": "SOP"
        },
        {
          "name": "希米亚诺维采",
          "code": "SOW"
        },
        {
          "name": "索斯诺维茨",
          "code": "SWC"
        },
        {
          "name": "希维诺乌伊希切",
          "code": "SWI"
        },
        {
          "name": "苏瓦乌基",
          "code": "SWL"
        },
        {
          "name": "希维托赫洛维采",
          "code": "SWT"
        },
        {
          "name": "什切青",
          "code": "SZZ"
        },
        {
          "name": "塔尔努夫",
          "code": "TAR"
        },
        {
          "name": "托伦",
          "code": "TOR"
        },
        {
          "name": "特切",
          "code": "TYY"
        },
        {
          "name": "华沙",
          "code": "WAW"
        },
        {
          "name": "弗沃茨瓦韦克",
          "code": "WLO"
        },
        {
          "name": "弗罗茨瓦夫",
          "code": "WRO"
        },
        {
          "name": "瓦乌布日赫",
          "code": "WZH"
        },
        {
          "name": "扎布热",
          "code": "ZAB"
        },
        {
          "name": "扎莫希奇",
          "code": "ZAM"
        }
      ]
    }
  },
  {
    "name": "波多黎各",
    "code": "PRI"
  },
  {
    "name": "朝鲜",
    "code": "PRK",
    "children": {
      "children": [
        {
          "name": "清津",
          "code": "CHO"
        },
        {
          "name": "平壤",
          "code": "FNJ"
        },
        {
          "name": "海州",
          "code": "HAE"
        },
        {
          "name": "咸兴",
          "code": "HAM"
        },
        {
          "name": "惠山",
          "code": "HYE"
        },
        {
          "name": "江界",
          "code": "KAN"
        },
        {
          "name": "开城",
          "code": "KSN"
        },
        {
          "name": "南浦",
          "code": "NAM"
        },
        {
          "name": "罗先",
          "code": "NAS"
        },
        {
          "name": "沙里院",
          "code": "SAR"
        },
        {
          "name": "新义州",
          "code": "SII"
        },
        {
          "name": "元山",
          "code": "WON"
        }
      ]
    }
  },
  {
    "name": "葡萄牙",
    "code": "PRT",
    "children": {
      "children": [
        {
          "name": "上阿连特茹",
          "code": "AAT"
        },
        {
          "name": "万福",
          "code": "AES"
        },
        {
          "name": "中阿连特茹",
          "code": "ALC"
        },
        {
          "name": "滨海阿连特茹",
          "code": "ALL"
        },
        {
          "name": "上特拉斯山",
          "code": "ATM"
        },
        {
          "name": "下阿连特茹",
          "code": "BAL"
        },
        {
          "name": "内贝拉北",
          "code": "BIN"
        },
        {
          "name": "内贝拉南",
          "code": "BIS"
        },
        {
          "name": "下蒙德古",
          "code": "BMO"
        },
        {
          "name": "下伏日",
          "code": "BVO"
        },
        {
          "name": "卡瓦多",
          "code": "CAV"
        },
        {
          "name": "科瓦贝拉",
          "code": "CLB"
        },
        {
          "name": "恩特拉杜罗伏日",
          "code": "EDV"
        },
        {
          "name": "法鲁",
          "code": "FAO"
        },
        {
          "name": "丰沙尔",
          "code": "FUN"
        },
        {
          "name": "里斯本",
          "code": "LIS"
        },
        {
          "name": "利巴特茹",
          "code": "LTE"
        },
        {
          "name": "杜罗",
          "code": "MDR"
        },
        {
          "name": "米尼奥-利马",
          "code": "MLI"
        },
        {
          "name": "梅地奥特茹",
          "code": "MTE"
        },
        {
          "name": "西部",
          "code": "OES"
        },
        {
          "name": "蓬塔德尔加达",
          "code": "PDL"
        },
        {
          "name": "内皮尼亚尔北",
          "code": "PIN"
        },
        {
          "name": "内皮尼亚尔南",
          "code": "PIS"
        },
        {
          "name": "滨海皮尼亚尔",
          "code": "PLT"
        },
        {
          "name": "塞图巴尔半岛",
          "code": "PSE"
        },
        {
          "name": "山后",
          "code": "SES"
        },
        {
          "name": "塔梅加",
          "code": "TAM"
        },
        {
          "name": "波尔图",
          "code": "VDP"
        }
      ]
    }
  },
  {
    "name": "巴拉圭",
    "code": "PRY",
    "children": {
      "children": [
        {
          "name": "上巴拉圭",
          "code": "AG"
        },
        {
          "name": "阿曼拜",
          "code": "AM"
        },
        {
          "name": "上巴拉那",
          "code": "AN"
        },
        {
          "name": "亚松森特别区",
          "code": "AS"
        },
        {
          "name": "博克龙",
          "code": "BO"
        },
        {
          "name": "康塞普西翁",
          "code": "CC"
        },
        {
          "name": "科迪勒拉",
          "code": "CD"
        },
        {
          "name": "中央",
          "code": "CE"
        },
        {
          "name": "卡瓜苏",
          "code": "CG"
        },
        {
          "name": "卡嫩迪尤",
          "code": "CN"
        },
        {
          "name": "卡萨帕",
          "code": "CZ"
        },
        {
          "name": "瓜伊拉",
          "code": "GU"
        },
        {
          "name": "伊塔普亚",
          "code": "IT"
        },
        {
          "name": "米西奥内斯",
          "code": "MI"
        },
        {
          "name": "涅恩布库",
          "code": "NE"
        },
        {
          "name": "巴拉瓜里",
          "code": "PA"
        },
        {
          "name": "阿耶斯总统省",
          "code": "PH"
        },
        {
          "name": "圣佩德罗",
          "code": "SP"
        }
      ]
    }
  },
  {
    "name": "巴勒斯坦",
    "code": "PSE",
    "children": {
      "children": [
        {
          "name": "加沙地带",
          "code": "GZ"
        },
        {
          "name": "西岸",
          "code": "WE"
        }
      ]
    }
  },
  {
    "name": "法属波利尼西亚",
    "code": "PYF"
  },
  {
    "name": "留尼旺岛",
    "code": "REU"
  },
  {
    "name": "罗马尼亚",
    "code": "ROU",
    "children": {
      "children": [
        {
          "name": "亚厉山德里亚",
          "code": "AD"
        },
        {
          "name": "阿尔巴尤利亚",
          "code": "AL"
        },
        {
          "name": "阿拉德",
          "code": "AR"
        },
        {
          "name": "巴克乌",
          "code": "BA"
        },
        {
          "name": "布加勒斯特",
          "code": "BC"
        },
        {
          "name": "布勒伊拉",
          "code": "BL"
        },
        {
          "name": "巴亚马雷",
          "code": "BM"
        },
        {
          "name": "比斯特里察",
          "code": "BN"
        },
        {
          "name": "博托沙尼",
          "code": "BO"
        },
        {
          "name": "布拉索夫",
          "code": "BS"
        },
        {
          "name": "布泽乌",
          "code": "BZ"
        },
        {
          "name": "克卢日纳波卡",
          "code": "CN"
        },
        {
          "name": "克勒拉希",
          "code": "CR"
        },
        {
          "name": "康斯坦察",
          "code": "CT"
        },
        {
          "name": "德瓦",
          "code": "DE"
        },
        {
          "name": "克拉约瓦",
          "code": "DO"
        },
        {
          "name": "德罗贝塔-塞维林堡",
          "code": "DT"
        },
        {
          "name": "福克沙尼",
          "code": "FO"
        },
        {
          "name": "久尔久",
          "code": "GG"
        },
        {
          "name": "加拉茨",
          "code": "GL"
        },
        {
          "name": "雅西",
          "code": "IS"
        },
        {
          "name": "梅尔库里亚丘克",
          "code": "MC"
        },
        {
          "name": "奥拉迪亚",
          "code": "OR"
        },
        {
          "name": "皮特什蒂",
          "code": "PI"
        },
        {
          "name": "普洛耶什蒂",
          "code": "PL"
        },
        {
          "name": "皮亚特拉尼亚姆茨",
          "code": "PN"
        },
        {
          "name": "雷希察",
          "code": "RE"
        },
        {
          "name": "斯洛博齐亚",
          "code": "SB"
        },
        {
          "name": "圣格奥尔基",
          "code": "SG"
        },
        {
          "name": "萨图·马雷",
          "code": "SM"
        },
        {
          "name": "锡比乌",
          "code": "SO"
        },
        {
          "name": "斯拉蒂纳",
          "code": "ST"
        },
        {
          "name": "苏恰瓦",
          "code": "SU"
        },
        {
          "name": "特尔戈维什泰",
          "code": "TA"
        },
        {
          "name": "蒂米什瓦拉",
          "code": "TI"
        },
        {
          "name": "特尔古日乌",
          "code": "TJ"
        },
        {
          "name": "特尔古穆列什",
          "code": "TM"
        },
        {
          "name": "图尔恰",
          "code": "TU"
        },
        {
          "name": "瓦斯卢伊",
          "code": "VA"
        },
        {
          "name": "勒姆尼库沃尔恰",
          "code": "VI"
        },
        {
          "name": "扎勒乌",
          "code": "ZA"
        }
      ]
    }
  },
  {
    "name": "俄罗斯",
    "code": "RUS",
    "children": {
      "children": [
        {
          "name": "阿巴坎",
          "code": "ABA"
        },
        {
          "name": "阿金斯科耶",
          "code": "AGI"
        },
        {
          "name": "阿尔汉格尔斯克",
          "code": "ARK"
        },
        {
          "name": "阿斯特拉罕",
          "code": "AST"
        },
        {
          "name": "巴尔瑙尔",
          "code": "BAX"
        },
        {
          "name": "比罗比詹",
          "code": "BBZ"
        },
        {
          "name": "别尔哥罗德",
          "code": "BEL"
        },
        {
          "name": "布拉戈维申斯克",
          "code": "BQS"
        },
        {
          "name": "布良斯克",
          "code": "BRY"
        },
        {
          "name": "车里雅宾斯克",
          "code": "CHE"
        },
        {
          "name": "赤塔",
          "code": "CHI"
        },
        {
          "name": "切尔克斯克",
          "code": "CKS"
        },
        {
          "name": "伯力",
          "code": "COK"
        },
        {
          "name": "切博克萨雷",
          "code": "CSY"
        },
        {
          "name": "阿纳德尔",
          "code": "DYR"
        },
        {
          "name": "埃利斯塔",
          "code": "ESL"
        },
        {
          "name": "戈尔诺－阿尔泰斯克",
          "code": "GOA"
        },
        {
          "name": "下诺夫哥罗德",
          "code": "GOJ"
        },
        {
          "name": "格罗兹尼",
          "code": "GRV"
        },
        {
          "name": "伊热夫斯克",
          "code": "IJK"
        },
        {
          "name": "伊尔库茨克",
          "code": "IKT"
        },
        {
          "name": "马加斯",
          "code": "IN"
        },
        {
          "name": "伊万诺沃",
          "code": "IVO"
        },
        {
          "name": "雅库茨克",
          "code": "JAK"
        },
        {
          "name": "雅罗斯拉夫尔",
          "code": "JAR"
        },
        {
          "name": "叶卡捷林堡",
          "code": "JEK"
        },
        {
          "name": "南萨哈林斯克",
          "code": "JSA"
        },
        {
          "name": "克麦罗沃",
          "code": "KEM"
        },
        {
          "name": "加里宁格勒",
          "code": "KGD"
        },
        {
          "name": "汉特－曼西斯克",
          "code": "KHM"
        },
        {
          "name": "基洛夫",
          "code": "KIR"
        },
        {
          "name": "卡卢加",
          "code": "KLF"
        },
        {
          "name": "科斯特罗马",
          "code": "KOS"
        },
        {
          "name": "库尔干",
          "code": "KRO"
        },
        {
          "name": "克拉斯诺达尔",
          "code": "KRR"
        },
        {
          "name": "库德姆卡尔",
          "code": "KUD"
        },
        {
          "name": "克拉斯诺亚尔斯克",
          "code": "KYA"
        },
        {
          "name": "克孜勒",
          "code": "KYZ"
        },
        {
          "name": "喀山",
          "code": "KZN"
        },
        {
          "name": "利佩茨克",
          "code": "LIP"
        },
        {
          "name": "斯摩棱斯克",
          "code": "LNX"
        },
        {
          "name": "马加丹",
          "code": "MAG"
        },
        {
          "name": "迈科普",
          "code": "MAY"
        },
        {
          "name": "马哈奇卡拉",
          "code": "MCX"
        },
        {
          "name": "摩尔曼斯克",
          "code": "MMK"
        },
        {
          "name": "莫斯科",
          "code": "MOW"
        },
        {
          "name": "纳尔奇克",
          "code": "NAL"
        },
        {
          "name": "纳里扬马尔",
          "code": "NNM"
        },
        {
          "name": "新西伯利亚",
          "code": "NVS"
        },
        {
          "name": "鄂木斯克",
          "code": "OMS"
        },
        {
          "name": "奥伦堡",
          "code": "ORE"
        },
        {
          "name": "奥廖尔",
          "code": "ORL"
        },
        {
          "name": "帕拉纳",
          "code": "PAL"
        },
        {
          "name": "彼尔姆",
          "code": "PER"
        },
        {
          "name": "彼得罗扎沃茨克",
          "code": "PES"
        },
        {
          "name": "彼得罗巴甫洛夫斯克",
          "code": "PKC"
        },
        {
          "name": "奔萨",
          "code": "PNZ"
        },
        {
          "name": "普斯科夫",
          "code": "PSK"
        },
        {
          "name": "顿河畔罗斯托夫",
          "code": "ROS"
        },
        {
          "name": "梁赞",
          "code": "RYA"
        },
        {
          "name": "萨马拉",
          "code": "SAM"
        },
        {
          "name": "萨拉托夫",
          "code": "SAR"
        },
        {
          "name": "瑟克特夫卡尔",
          "code": "SCW"
        },
        {
          "name": "萨兰斯克",
          "code": "SKX"
        },
        {
          "name": "萨列哈尔德",
          "code": "SLY"
        },
        {
          "name": "圣彼得堡",
          "code": "SPE"
        },
        {
          "name": "斯塔夫罗波尔",
          "code": "STA"
        },
        {
          "name": "坦波夫",
          "code": "TAM"
        },
        {
          "name": "托木斯克",
          "code": "TOM"
        },
        {
          "name": "图拉",
          "code": "TUL"
        },
        {
          "name": "特维尔",
          "code": "TVE"
        },
        {
          "name": "秋明",
          "code": "TYU"
        },
        {
          "name": "乌法",
          "code": "UFA"
        },
        {
          "name": "乌里扬诺夫斯克",
          "code": "ULY"
        },
        {
          "name": "乌斯季奥尔登斯基",
          "code": "UOB"
        },
        {
          "name": "库尔斯克",
          "code": "URS"
        },
        {
          "name": "乌兰乌德",
          "code": "UUD"
        },
        {
          "name": "弗拉季高加索",
          "code": "VLA"
        },
        {
          "name": "沃洛格达",
          "code": "VLG"
        },
        {
          "name": "弗拉基米尔",
          "code": "VMR"
        },
        {
          "name": "伏尔加格勒",
          "code": "VOG"
        },
        {
          "name": "沃罗涅什",
          "code": "VOR"
        },
        {
          "name": "诺夫哥罗德",
          "code": "VUS"
        },
        {
          "name": "海参崴",
          "code": "VVO"
        },
        {
          "name": "约什卡尔奥拉",
          "code": "YOL"
        }
      ]
    }
  },
  {
    "name": "卢旺达",
    "code": "RWA",
    "children": {
      "children": [
        {
          "name": "布塔雷",
          "code": "BU"
        },
        {
          "name": "比温巴",
          "code": "BY"
        },
        {
          "name": "尚古古",
          "code": "CY"
        },
        {
          "name": "吉孔戈罗",
          "code": "GK"
        },
        {
          "name": "吉塞尼",
          "code": "GS"
        },
        {
          "name": "吉塔拉马",
          "code": "GT"
        },
        {
          "name": "卡布加",
          "code": "KA"
        },
        {
          "name": "基本古",
          "code": "KG"
        },
        {
          "name": "基加利-恩加利",
          "code": "KR"
        },
        {
          "name": "基加利市",
          "code": "KV"
        },
        {
          "name": "基布耶",
          "code": "KY"
        },
        {
          "name": "恩延扎",
          "code": "NY"
        },
        {
          "name": "鲁汉戈",
          "code": "RH"
        },
        {
          "name": "鲁亨盖里",
          "code": "RU"
        },
        {
          "name": "卢瓦马加纳",
          "code": "RW"
        },
        {
          "name": "乌姆塔拉",
          "code": "UM"
        }
      ]
    }
  },
  {
    "name": "沙特阿拉伯",
    "code": "SAU",
    "children": {
      "children": [
        {
          "name": "艾卜哈",
          "code": "AHB"
        },
        {
          "name": "海耶",
          "code": "AKH"
        },
        {
          "name": "阿尔阿尔",
          "code": "ARA"
        },
        {
          "name": "巴哈",
          "code": "BH"
        },
        {
          "name": "布赖代",
          "code": "BUR"
        },
        {
          "name": "达曼",
          "code": "DAM"
        },
        {
          "name": "哈费尔巴廷",
          "code": "HBT"
        },
        {
          "name": "胡富夫",
          "code": "HFF"
        },
        {
          "name": "哈伊勒",
          "code": "HL"
        },
        {
          "name": "朱拜勒",
          "code": "JBI"
        },
        {
          "name": "吉达",
          "code": "JED"
        },
        {
          "name": "吉赞",
          "code": "JZ"
        },
        {
          "name": "海米斯穆谢特",
          "code": "KMX"
        },
        {
          "name": "姆巴拉兹",
          "code": "MBR"
        },
        {
          "name": "麦地那",
          "code": "MED"
        },
        {
          "name": "麦加",
          "code": "ML"
        },
        {
          "name": "纳季兰",
          "code": "NR"
        },
        {
          "name": "利雅得",
          "code": "RD"
        },
        {
          "name": "塞卡卡",
          "code": "SAK"
        },
        {
          "name": "塔伊夫",
          "code": "TAR"
        },
        {
          "name": "塔布克",
          "code": "TB"
        },
        {
          "name": "延布",
          "code": "YNB"
        }
      ]
    }
  },
  {
    "name": "塞尔维亚,黑山",
    "code": "SCG",
    "children": {
      "children": [
        {
          "name": "贝尔格莱德",
          "code": "BEG"
        },
        {
          "name": "尼什",
          "code": "INI"
        },
        {
          "name": "克拉古涅瓦茨",
          "code": "KGV"
        },
        {
          "name": "诺维萨德",
          "code": "NVS"
        },
        {
          "name": "波德戈里察",
          "code": "POD"
        },
        {
          "name": "普里什蒂纳",
          "code": "PRN"
        },
        {
          "name": "苏博蒂察",
          "code": "SUB"
        },
        {
          "name": "泽蒙",
          "code": "ZEM"
        }
      ]
    }
  },
  {
    "name": "苏丹",
    "code": "SDN",
    "children": {
      "children": [
        {
          "name": "上尼罗",
          "code": "ANB"
        },
        {
          "name": "北部",
          "code": "ASH"
        },
        {
          "name": "科尔多凡",
          "code": "GKU"
        },
        {
          "name": "喀土穆",
          "code": "KRT"
        },
        {
          "name": "加扎勒河",
          "code": "SBG"
        },
        {
          "name": "达尔富尔",
          "code": "SDA"
        },
        {
          "name": "东部",
          "code": "SHA"
        },
        {
          "name": "赤道",
          "code": "SIS"
        },
        {
          "name": "中部",
          "code": "WDH"
        }
      ]
    }
  },
  {
    "name": "塞内加尔",
    "code": "SEN",
    "children": {
      "children": [
        {
          "name": "达喀尔",
          "code": "DA"
        },
        {
          "name": "久尔贝勒",
          "code": "DI"
        },
        {
          "name": "法蒂克",
          "code": "FA"
        },
        {
          "name": "考拉克",
          "code": "KA"
        },
        {
          "name": "科尔达",
          "code": "KO"
        },
        {
          "name": "卢加",
          "code": "LO"
        },
        {
          "name": "马塔姆",
          "code": "MA"
        },
        {
          "name": "圣路易",
          "code": "SL"
        },
        {
          "name": "坦巴昆达",
          "code": "TA"
        },
        {
          "name": "捷斯",
          "code": "TH"
        },
        {
          "name": "济金绍尔",
          "code": "ZI"
        }
      ]
    }
  },
  {
    "name": "新加坡",
    "code": "SGP"
  },
  {
    "name": "南乔治亚和南桑德威奇群岛",
    "code": "SGS"
  },
  {
    "name": "圣赫勒拿",
    "code": "SHN"
  },
  {
    "name": "斯瓦尔巴和扬马廷",
    "code": "SJM"
  },
  {
    "name": "所罗门群岛",
    "code": "SLB",
    "children": {
      "children": [
        {
          "name": "中部群岛",
          "code": "CE"
        },
        {
          "name": "乔伊索",
          "code": "CH"
        },
        {
          "name": "瓜达尔卡纳尔",
          "code": "GC"
        },
        {
          "name": "霍尼亚拉",
          "code": "HO"
        },
        {
          "name": "伊萨贝尔",
          "code": "IS"
        },
        {
          "name": "马基拉",
          "code": "MK"
        },
        {
          "name": "马莱塔",
          "code": "ML"
        },
        {
          "name": "拉纳尔和贝罗纳",
          "code": "RB"
        },
        {
          "name": "泰莫图",
          "code": "TM"
        },
        {
          "name": "西部",
          "code": "WE"
        }
      ]
    }
  },
  {
    "name": "塞拉利昂",
    "code": "SLE",
    "children": {
      "children": [
        {
          "name": "东部",
          "code": "E"
        },
        {
          "name": "北部",
          "code": "N"
        },
        {
          "name": "南部",
          "code": "S"
        },
        {
          "name": "西部区",
          "code": "W"
        }
      ]
    }
  },
  {
    "name": "萨尔瓦多",
    "code": "SLV",
    "children": {
      "children": [
        {
          "name": "阿瓦查潘",
          "code": "AH"
        },
        {
          "name": "阿波帕",
          "code": "APO"
        },
        {
          "name": "卡瓦尼亚斯",
          "code": "CA"
        },
        {
          "name": "查拉特南戈",
          "code": "CH"
        },
        {
          "name": "中南",
          "code": "CS"
        },
        {
          "name": "库斯卡特兰",
          "code": "CU"
        },
        {
          "name": "德尔加多",
          "code": "DE"
        },
        {
          "name": "伊洛潘戈",
          "code": "IL"
        },
        {
          "name": "基埃-恩特姆",
          "code": "KN"
        },
        {
          "name": "拉利伯塔德",
          "code": "LB"
        },
        {
          "name": "滨海",
          "code": "LI"
        },
        {
          "name": "梅基卡诺斯",
          "code": "MEJ"
        },
        {
          "name": "莫拉桑",
          "code": "MO"
        },
        {
          "name": "拉巴斯",
          "code": "PZ"
        },
        {
          "name": "圣安娜",
          "code": "SA"
        },
        {
          "name": "圣米格尔",
          "code": "SM"
        },
        {
          "name": "松索纳特",
          "code": "SO"
        },
        {
          "name": "索亚潘戈",
          "code": "SOY"
        },
        {
          "name": "圣萨尔瓦多",
          "code": "SS"
        },
        {
          "name": "圣维森特",
          "code": "SV"
        },
        {
          "name": "拉乌尼翁",
          "code": "UN"
        },
        {
          "name": "乌苏卢坦",
          "code": "US"
        },
        {
          "name": "韦莱-恩萨斯",
          "code": "WN"
        }
      ]
    }
  },
  {
    "name": "圣马力诺",
    "code": "SMR"
  },
  {
    "name": "索马里",
    "code": "SOM"
  },
  {
    "name": "圣皮埃尔和米克隆群岛",
    "code": "SPM"
  },
  {
    "name": "圣多美和普林西比",
    "code": "STP"
  },
  {
    "name": "苏里南",
    "code": "SUR",
    "children": {
      "children": [
        {
          "name": "布罗科蓬多",
          "code": "BR"
        },
        {
          "name": "科默韦讷",
          "code": "CM"
        },
        {
          "name": "科罗尼",
          "code": "CR"
        },
        {
          "name": "马罗韦讷",
          "code": "MA"
        },
        {
          "name": "尼克里",
          "code": "NI"
        },
        {
          "name": "帕拉",
          "code": "PA"
        },
        {
          "name": "帕拉马里博",
          "code": "PM"
        },
        {
          "name": "萨拉马卡",
          "code": "SA"
        },
        {
          "name": "西帕里韦尼",
          "code": "SI"
        },
        {
          "name": "瓦尼卡",
          "code": "WA"
        }
      ]
    }
  },
  {
    "name": "斯洛伐克",
    "code": "SVK",
    "children": {
      "children": [
        {
          "name": "班斯卡-比斯特里察",
          "code": "BBY"
        },
        {
          "name": "布拉迪斯拉发",
          "code": "BTS"
        },
        {
          "name": "科希策",
          "code": "KOR"
        },
        {
          "name": "尼特拉",
          "code": "NRA"
        },
        {
          "name": "普雷绍夫",
          "code": "POV"
        },
        {
          "name": "日利纳",
          "code": "RIL"
        },
        {
          "name": "特尔纳瓦",
          "code": "TNA"
        },
        {
          "name": "特伦钦",
          "code": "TRE"
        }
      ]
    }
  },
  {
    "name": "斯洛文尼亚",
    "code": "SVN",
    "children": {
      "children": [
        {
          "name": "多雷尼",
          "code": "DLJ"
        },
        {
          "name": "戈里",
          "code": "GSK"
        },
        {
          "name": "戈雷尼",
          "code": "GSZ"
        },
        {
          "name": "科洛",
          "code": "KOR"
        },
        {
          "name": "诺特拉尼",
          "code": "NKR"
        },
        {
          "name": "奥巴尔诺-克拉",
          "code": "OKR"
        },
        {
          "name": "奥斯雷德涅斯洛文",
          "code": "OSR"
        },
        {
          "name": "波德拉夫",
          "code": "POD"
        },
        {
          "name": "波穆尔",
          "code": "POM"
        },
        {
          "name": "萨维尼",
          "code": "SAV"
        },
        {
          "name": "斯波德涅波萨夫",
          "code": "SPO"
        },
        {
          "name": "扎萨夫",
          "code": "ZAS"
        }
      ]
    }
  },
  {
    "name": "瑞典",
    "code": "SWE",
    "children": {
      "children": [
        {
          "name": "斯德哥尔摩",
          "code": "AB"
        },
        {
          "name": "西博滕",
          "code": "AC"
        },
        {
          "name": "北博滕",
          "code": "BD"
        },
        {
          "name": "乌普萨拉",
          "code": "C"
        },
        {
          "name": "南曼兰",
          "code": "D"
        },
        {
          "name": "达拉纳",
          "code": "DLN"
        },
        {
          "name": "延雪平",
          "code": "F"
        },
        {
          "name": "克鲁努贝里",
          "code": "G"
        },
        {
          "name": "卡尔马",
          "code": "H"
        },
        {
          "name": "耶夫勒堡",
          "code": "X"
        },
        {
          "name": "哥得兰",
          "code": "I"
        },
        {
          "name": "布莱金厄",
          "code": "K"
        },
        {
          "name": "斯科耐",
          "code": "M"
        },
        {
          "name": "哈兰",
          "code": "N"
        },
        {
          "name": "西约特兰",
          "code": "O"
        },
        {
          "name": "韦姆兰",
          "code": "S"
        },
        {
          "name": "厄勒布鲁",
          "code": "T"
        },
        {
          "name": "西曼兰",
          "code": "U"
        },
        {
          "name": "东约特兰",
          "code": "UGL"
        },
        {
          "name": "西诺尔兰",
          "code": "Y"
        },
        {
          "name": "耶姆特兰",
          "code": "Z"
        }
      ]
    }
  },
  {
    "name": "斯威士兰",
    "code": "SWZ"
  },
  {
    "name": "塞舌尔",
    "code": "SYC"
  },
  {
    "name": "叙利亚",
    "code": "SYR",
    "children": {
      "children": [
        {
          "name": "德拉",
          "code": "DA"
        },
        {
          "name": "大马士革市",
          "code": "DI"
        },
        {
          "name": "代尔祖尔",
          "code": "DZ"
        },
        {
          "name": "加布",
          "code": "GH"
        },
        {
          "name": "哈塞克",
          "code": "HA"
        },
        {
          "name": "霍姆斯",
          "code": "HI"
        },
        {
          "name": "阿勒颇",
          "code": "HL"
        },
        {
          "name": "哈马",
          "code": "HM"
        },
        {
          "name": "伊德利卜",
          "code": "ID"
        },
        {
          "name": "卡米什利",
          "code": "QA"
        },
        {
          "name": "库奈特拉",
          "code": "QU"
        },
        {
          "name": "拉塔基亚",
          "code": "LA"
        },
        {
          "name": "大马士革",
          "code": "RD"
        },
        {
          "name": "拉卡",
          "code": "RQ"
        },
        {
          "name": "苏韦达",
          "code": "SU"
        },
        {
          "name": "塔尔图斯",
          "code": "TA"
        }
      ]
    }
  },
  {
    "name": "特里斯坦达昆哈",
    "code": "TAA"
  },
  {
    "name": "特克斯和凯克特斯群岛",
    "code": "TCA"
  },
  {
    "name": "乍得",
    "code": "TCD"
  },
  {
    "name": "多哥",
    "code": "TGO",
    "children": {
      "children": [
        {
          "name": "中部区",
          "code": "C"
        },
        {
          "name": "卡拉区",
          "code": "K"
        },
        {
          "name": "滨海区",
          "code": "M"
        },
        {
          "name": "高原区",
          "code": "P"
        },
        {
          "name": "草原区",
          "code": "S"
        }
      ]
    }
  },
  {
    "name": "泰国",
    "code": "THA",
    "children": {
      "children": [
        {
          "name": "曼谷",
          "code": "10"
        },
        {
          "name": "北揽",
          "code": "11"
        },
        {
          "name": "暖武里",
          "code": "12"
        },
        {
          "name": "巴吞他尼",
          "code": "13"
        },
        {
          "name": "大城",
          "code": "14"
        },
        {
          "name": "红统",
          "code": "15"
        },
        {
          "name": "华富里",
          "code": "16"
        },
        {
          "name": "信武里",
          "code": "17"
        },
        {
          "name": "猜那",
          "code": "18"
        },
        {
          "name": "北标",
          "code": "19"
        },
        {
          "name": "春武里",
          "code": "20"
        },
        {
          "name": "拉农",
          "code": "21"
        },
        {
          "name": "尖竹汶",
          "code": "22"
        },
        {
          "name": "达叻",
          "code": "23"
        },
        {
          "name": "北柳",
          "code": "24"
        },
        {
          "name": "巴真",
          "code": "25"
        },
        {
          "name": "那空那育",
          "code": "26"
        },
        {
          "name": "沙缴",
          "code": "27"
        },
        {
          "name": "武里南",
          "code": "31"
        },
        {
          "name": "素林",
          "code": "32"
        },
        {
          "name": "四色菊",
          "code": "33"
        },
        {
          "name": "乌汶",
          "code": "34"
        },
        {
          "name": "耶梭通",
          "code": "35"
        },
        {
          "name": "猜也奔",
          "code": "36"
        },
        {
          "name": "安纳乍能",
          "code": "37"
        },
        {
          "name": "廊莫那浦",
          "code": "39"
        },
        {
          "name": "孔敬",
          "code": "40"
        },
        {
          "name": "乌隆",
          "code": "41"
        },
        {
          "name": "黎",
          "code": "42"
        },
        {
          "name": "廊开",
          "code": "43"
        },
        {
          "name": "玛哈沙拉堪",
          "code": "44"
        },
        {
          "name": "黎逸",
          "code": "45"
        },
        {
          "name": "加拉信",
          "code": "46"
        },
        {
          "name": "色军",
          "code": "47"
        },
        {
          "name": "那空帕农",
          "code": "48"
        },
        {
          "name": "莫达汉",
          "code": "49"
        },
        {
          "name": "清迈",
          "code": "50"
        },
        {
          "name": "南奔",
          "code": "51"
        },
        {
          "name": "程逸",
          "code": "53"
        },
        {
          "name": "帕",
          "code": "54"
        },
        {
          "name": "难",
          "code": "55"
        },
        {
          "name": "帕尧",
          "code": "56"
        },
        {
          "name": "清莱",
          "code": "57"
        },
        {
          "name": "夜丰颂",
          "code": "58"
        },
        {
          "name": "北榄坡",
          "code": "60"
        },
        {
          "name": "乌泰他尼",
          "code": "61"
        },
        {
          "name": "甘烹碧",
          "code": "62"
        },
        {
          "name": "达",
          "code": "63"
        },
        {
          "name": "素可泰",
          "code": "64"
        },
        {
          "name": "彭世洛",
          "code": "65"
        },
        {
          "name": "披集",
          "code": "66"
        },
        {
          "name": "叻丕",
          "code": "70"
        },
        {
          "name": "北碧",
          "code": "71"
        },
        {
          "name": "素攀武里",
          "code": "72"
        },
        {
          "name": "佛统",
          "code": "73"
        },
        {
          "name": "龙仔厝",
          "code": "74"
        },
        {
          "name": "夜功",
          "code": "75"
        },
        {
          "name": "碧差汶",
          "code": "76"
        },
        {
          "name": "巴蜀",
          "code": "77"
        },
        {
          "name": "佛丕",
          "code": "78"
        },
        {
          "name": "洛坤",
          "code": "80"
        },
        {
          "name": "甲米",
          "code": "81"
        },
        {
          "name": "攀牙",
          "code": "82"
        },
        {
          "name": "普吉",
          "code": "83"
        },
        {
          "name": "素叻",
          "code": "84"
        },
        {
          "name": "罗勇",
          "code": "85"
        },
        {
          "name": "春蓬",
          "code": "86"
        },
        {
          "name": "宋卡",
          "code": "90"
        },
        {
          "name": "沙敦",
          "code": "91"
        },
        {
          "name": "董里",
          "code": "92"
        },
        {
          "name": "博达伦",
          "code": "93"
        },
        {
          "name": "北大年",
          "code": "94"
        },
        {
          "name": "也拉",
          "code": "95"
        },
        {
          "name": "陶公",
          "code": "96"
        }
      ]
    }
  },
  {
    "name": "塔吉克斯坦",
    "code": "TJK",
    "children": {
      "children": [
        {
          "name": "杜尚别",
          "code": "DYU"
        },
        {
          "name": "伊斯法拉",
          "code": "ISF"
        },
        {
          "name": "卡尼巴达姆",
          "code": "KAN"
        },
        {
          "name": "霍罗格",
          "code": "KHO"
        },
        {
          "name": "苦盏",
          "code": "KHU"
        },
        {
          "name": "库洛布",
          "code": "KLB"
        },
        {
          "name": "科法尔尼洪",
          "code": "KOF"
        },
        {
          "name": "库尔干-秋别",
          "code": "KTJ"
        },
        {
          "name": "努雷克",
          "code": "NUR"
        },
        {
          "name": "彭吉肯特",
          "code": "PJK"
        },
        {
          "name": "洛贡",
          "code": "RGU"
        },
        {
          "name": "萨班特",
          "code": "SBA"
        },
        {
          "name": "塔博沙尔",
          "code": "TBS"
        },
        {
          "name": "图尔孙扎德",
          "code": "TSZ"
        },
        {
          "name": "乌拉秋别",
          "code": "UTJ"
        }
      ]
    }
  },
  {
    "name": "托克劳",
    "code": "TKL"
  },
  {
    "name": "土库曼斯坦",
    "code": "TKM",
    "children": {
      "children": [
        {
          "name": "阿哈尔",
          "code": "A"
        },
        {
          "name": "阿什哈巴德市",
          "code": "ASB"
        },
        {
          "name": "巴尔坎",
          "code": "B"
        },
        {
          "name": "达沙古兹",
          "code": "D"
        },
        {
          "name": "列巴普",
          "code": "L"
        },
        {
          "name": "马雷",
          "code": "M"
        },
        {
          "name": "涅比特达格",
          "code": "NEB"
        }
      ]
    }
  },
  {
    "name": "东帝汶",
    "code": "TLS",
    "children": {
      "children": [
        {
          "name": "阿伊莱乌",
          "code": "AL"
        },
        {
          "name": "安贝诺",
          "code": "AM"
        },
        {
          "name": "阿伊纳罗",
          "code": "AN"
        },
        {
          "name": "包考",
          "code": "BA"
        },
        {
          "name": "博博纳罗",
          "code": "BO"
        },
        {
          "name": "帝力",
          "code": "DI"
        },
        {
          "name": "埃尔梅拉",
          "code": "ER"
        },
        {
          "name": "科瓦利马",
          "code": "KO"
        },
        {
          "name": "劳滕",
          "code": "LA"
        },
        {
          "name": "利基卡",
          "code": "LI"
        },
        {
          "name": "马努法伊",
          "code": "MF"
        },
        {
          "name": "马纳图托",
          "code": "MT"
        },
        {
          "name": "维克克",
          "code": "VI"
        }
      ]
    }
  },
  {
    "name": "汤加",
    "code": "TON",
    "children": {
      "children": [
        {
          "name": "埃瓦",
          "code": "E"
        },
        {
          "name": "哈派",
          "code": "H"
        },
        {
          "name": "纽阿斯",
          "code": "N"
        },
        {
          "name": "汤加塔布",
          "code": "T"
        },
        {
          "name": "瓦瓦乌",
          "code": "V"
        }
      ]
    }
  },
  {
    "name": "特立尼达和多巴哥",
    "code": "TTO"
  },
  {
    "name": "突尼斯",
    "code": "TUN",
    "children": {
      "children": [
        {
          "name": "艾尔亚奈",
          "code": "AR"
        },
        {
          "name": "本阿鲁斯",
          "code": "BA"
        },
        {
          "name": "比塞大",
          "code": "BI"
        },
        {
          "name": "巴杰",
          "code": "BJ"
        },
        {
          "name": "加贝斯",
          "code": "GB"
        },
        {
          "name": "加夫萨",
          "code": "GF"
        },
        {
          "name": "坚杜拜",
          "code": "JE"
        },
        {
          "name": "吉比利",
          "code": "KB"
        },
        {
          "name": "凯鲁万",
          "code": "KR"
        },
        {
          "name": "卡塞林",
          "code": "KS"
        },
        {
          "name": "卡夫",
          "code": "LK"
        },
        {
          "name": "梅德宁",
          "code": "ME"
        },
        {
          "name": "马赫迪耶",
          "code": "MH"
        },
        {
          "name": "马努巴",
          "code": "MN"
        },
        {
          "name": "莫纳斯提尔",
          "code": "MO"
        },
        {
          "name": "纳布勒",
          "code": "NA"
        },
        {
          "name": "西迪布济德",
          "code": "SD"
        },
        {
          "name": "斯法克斯",
          "code": "SF"
        },
        {
          "name": "锡勒亚奈",
          "code": "SL"
        },
        {
          "name": "苏塞",
          "code": "SO"
        },
        {
          "name": "泰塔温",
          "code": "TA"
        },
        {
          "name": "托泽尔",
          "code": "TO"
        },
        {
          "name": "突尼斯",
          "code": "TU"
        },
        {
          "name": "宰格万",
          "code": "ZA"
        }
      ]
    }
  },
  {
    "name": "土耳其",
    "code": "TUR",
    "children": {
      "children": [
        {
          "name": "阿达纳",
          "code": "ADA"
        },
        {
          "name": "阿德亚曼",
          "code": "ADI"
        },
        {
          "name": "阿菲永",
          "code": "AFY"
        },
        {
          "name": "阿勒",
          "code": "AGR"
        },
        {
          "name": "阿克萨赖",
          "code": "AKS"
        },
        {
          "name": "阿马西亚",
          "code": "AMA"
        },
        {
          "name": "安卡拉",
          "code": "ANK"
        },
        {
          "name": "安塔利亚",
          "code": "ANT"
        },
        {
          "name": "阿尔达罕",
          "code": "ARD"
        },
        {
          "name": "阿尔特温",
          "code": "ART"
        },
        {
          "name": "艾登",
          "code": "AYI"
        },
        {
          "name": "巴勒克埃西尔",
          "code": "BAL"
        },
        {
          "name": "巴尔腾",
          "code": "BAR"
        },
        {
          "name": "巴特曼",
          "code": "BAT"
        },
        {
          "name": "巴伊布尔特",
          "code": "BAY"
        },
        {
          "name": "比莱吉克",
          "code": "BIL"
        },
        {
          "name": "宾格尔",
          "code": "BIN"
        },
        {
          "name": "比特利斯",
          "code": "BIT"
        },
        {
          "name": "博卢",
          "code": "BOL"
        },
        {
          "name": "布尔杜尔",
          "code": "BRD"
        },
        {
          "name": "布尔萨",
          "code": "BRS"
        },
        {
          "name": "恰纳卡莱",
          "code": "CKL"
        },
        {
          "name": "昌克勒",
          "code": "CKR"
        },
        {
          "name": "乔鲁姆",
          "code": "COR"
        },
        {
          "name": "代尼兹利",
          "code": "DEN"
        },
        {
          "name": "迪亚巴克尔",
          "code": "DIY"
        },
        {
          "name": "埃迪尔内",
          "code": "EDI"
        },
        {
          "name": "埃拉泽",
          "code": "ELA"
        },
        {
          "name": "埃斯基谢希尔",
          "code": "ESK"
        },
        {
          "name": "埃尔津詹",
          "code": "EZC"
        },
        {
          "name": "埃尔祖鲁姆",
          "code": "EZR"
        },
        {
          "name": "加济安泰普",
          "code": "GAZ"
        },
        {
          "name": "吉雷松",
          "code": "GIR"
        },
        {
          "name": "居米什哈内",
          "code": "GMS"
        },
        {
          "name": "哈卡里",
          "code": "HKR"
        },
        {
          "name": "哈塔伊",
          "code": "HTY"
        },
        {
          "name": "伊切尔",
          "code": "ICE"
        },
        {
          "name": "伊迪尔",
          "code": "IGD"
        },
        {
          "name": "伊斯帕尔塔",
          "code": "ISP"
        },
        {
          "name": "伊斯坦布尔",
          "code": "IST"
        },
        {
          "name": "伊兹密尔",
          "code": "IZM"
        },
        {
          "name": "卡赫拉曼马拉什",
          "code": "KAH"
        },
        {
          "name": "卡斯塔莫努",
          "code": "KAS"
        },
        {
          "name": "开塞利",
          "code": "KAY"
        },
        {
          "name": "柯克拉雷利",
          "code": "KLR"
        },
        {
          "name": "基利斯",
          "code": "KLS"
        },
        {
          "name": "科贾埃利",
          "code": "KOC"
        },
        {
          "name": "科尼亚",
          "code": "KON"
        },
        {
          "name": "卡拉比克",
          "code": "KRB"
        },
        {
          "name": "克尔谢希尔",
          "code": "KRH"
        },
        {
          "name": "克勒克卡莱",
          "code": "KRK"
        },
        {
          "name": "卡拉曼",
          "code": "KRM"
        },
        {
          "name": "卡尔斯",
          "code": "KRS"
        },
        {
          "name": "屈塔希亚",
          "code": "KUT"
        },
        {
          "name": "马拉蒂亚",
          "code": "MAL"
        },
        {
          "name": "马尼萨",
          "code": "MAN"
        },
        {
          "name": "马尔丁",
          "code": "MAR"
        },
        {
          "name": "穆拉",
          "code": "MUG"
        },
        {
          "name": "穆什",
          "code": "MUS"
        },
        {
          "name": "内夫谢希尔",
          "code": "NEV"
        },
        {
          "name": "尼代",
          "code": "NIG"
        },
        {
          "name": "奥尔杜",
          "code": "ORD"
        },
        {
          "name": "里泽",
          "code": "RIZ"
        },
        {
          "name": "萨卡里亚",
          "code": "SAK"
        },
        {
          "name": "萨姆松",
          "code": "SAM"
        },
        {
          "name": "锡尔特",
          "code": "SII"
        },
        {
          "name": "锡诺普",
          "code": "SIN"
        },
        {
          "name": "锡尔纳克",
          "code": "SIR"
        },
        {
          "name": "锡瓦斯",
          "code": "SIV"
        },
        {
          "name": "泰基尔达",
          "code": "TEL"
        },
        {
          "name": "托卡特",
          "code": "TOK"
        },
        {
          "name": "特拉布宗",
          "code": "TRA"
        },
        {
          "name": "通杰利",
          "code": "TUN"
        },
        {
          "name": "拉飞",
          "code": "URF"
        },
        {
          "name": "乌萨克",
          "code": "USK"
        },
        {
          "name": "凡",
          "code": "VAN"
        },
        {
          "name": "约兹加特",
          "code": "YOZ"
        },
        {
          "name": "宗古尔达克",
          "code": "ZON"
        }
      ]
    }
  },
  {
    "name": "图瓦卢",
    "code": "TUV"
  },
  {
    "name": "坦桑尼亚",
    "code": "TZA",
    "children": {
      "children": [
        {
          "name": "阿鲁沙",
          "code": "AR"
        },
        {
          "name": "多多马",
          "code": "DO"
        },
        {
          "name": "达累斯萨拉姆",
          "code": "DS"
        },
        {
          "name": "伊林加",
          "code": "IR"
        },
        {
          "name": "卡盖拉",
          "code": "KA"
        },
        {
          "name": "基戈马",
          "code": "KI"
        },
        {
          "name": "乞力马扎罗",
          "code": "KJ"
        },
        {
          "name": "林迪",
          "code": "LN"
        },
        {
          "name": "姆贝亚",
          "code": "MB"
        },
        {
          "name": "桑给巴尔市和西",
          "code": "MM"
        },
        {
          "name": "莫洛戈罗",
          "code": "MO"
        },
        {
          "name": "马腊",
          "code": "MR"
        },
        {
          "name": "姆特瓦拉",
          "code": "MT"
        },
        {
          "name": "姆万扎",
          "code": "MW"
        },
        {
          "name": "曼亚拉",
          "code": "MY"
        },
        {
          "name": "奔巴北",
          "code": "PN"
        },
        {
          "name": "奔巴南",
          "code": "PS"
        },
        {
          "name": "滨海",
          "code": "PW"
        },
        {
          "name": "鲁夸",
          "code": "RK"
        },
        {
          "name": "鲁伍马",
          "code": "RV"
        },
        {
          "name": "欣延加",
          "code": "SH"
        },
        {
          "name": "辛吉达",
          "code": "SI"
        },
        {
          "name": "塔波拉",
          "code": "TB"
        },
        {
          "name": "坦噶",
          "code": "TN"
        },
        {
          "name": "桑给巴尔北",
          "code": "UN"
        },
        {
          "name": "桑给巴尔南",
          "code": "US"
        },
        {
          "name": "桑给巴尔",
          "code": "ZN"
        }
      ]
    }
  },
  {
    "name": "乌干达",
    "code": "UGA",
    "children": {
      "children": [
        {
          "name": "阿朱马尼",
          "code": "ADJ"
        },
        {
          "name": "阿帕克",
          "code": "APC"
        },
        {
          "name": "阿鲁阿",
          "code": "ARU"
        },
        {
          "name": "布谢尼",
          "code": "BSH"
        },
        {
          "name": "布吉里",
          "code": "BUG"
        },
        {
          "name": "本迪布焦",
          "code": "BUN"
        },
        {
          "name": "布西亚",
          "code": "BUS"
        },
        {
          "name": "古卢",
          "code": "GUL"
        },
        {
          "name": "霍伊马",
          "code": "HOI"
        },
        {
          "name": "伊甘加",
          "code": "IGA"
        },
        {
          "name": "金贾",
          "code": "JIN"
        },
        {
          "name": "卡贝拉马伊多",
          "code": "KAB"
        },
        {
          "name": "卡兰加拉",
          "code": "KAL"
        },
        {
          "name": "卡姆文盖",
          "code": "KAM"
        },
        {
          "name": "卡农古",
          "code": "KAN"
        },
        {
          "name": "卡巴罗莱",
          "code": "KAR"
        },
        {
          "name": "卡塞塞",
          "code": "KAS"
        },
        {
          "name": "卡永加",
          "code": "KAY"
        },
        {
          "name": "基巴莱",
          "code": "KBA"
        },
        {
          "name": "卡巴莱",
          "code": "KBL"
        },
        {
          "name": "基博加",
          "code": "KIB"
        },
        {
          "name": "基索罗",
          "code": "KIS"
        },
        {
          "name": "基特古姆",
          "code": "KIT"
        },
        {
          "name": "卡穆利",
          "code": "KML"
        },
        {
          "name": "坎帕拉",
          "code": "KMP"
        },
        {
          "name": "科蒂多",
          "code": "KOT"
        },
        {
          "name": "卡普乔鲁瓦",
          "code": "KPC"
        },
        {
          "name": "卡塔奎",
          "code": "KTK"
        },
        {
          "name": "库米",
          "code": "KUM"
        },
        {
          "name": "基恩乔乔",
          "code": "KYE"
        },
        {
          "name": "利拉",
          "code": "LIR"
        },
        {
          "name": "卢韦罗",
          "code": "LUW"
        },
        {
          "name": "马萨卡",
          "code": "MAS"
        },
        {
          "name": "马尤盖",
          "code": "MAY"
        },
        {
          "name": "姆巴莱",
          "code": "MBA"
        },
        {
          "name": "姆巴拉拉",
          "code": "MBR"
        },
        {
          "name": "莫约",
          "code": "MOY"
        },
        {
          "name": "姆皮吉",
          "code": "MPI"
        },
        {
          "name": "莫罗托",
          "code": "MRT"
        },
        {
          "name": "马辛迪",
          "code": "MSN"
        },
        {
          "name": "穆本德",
          "code": "MUB"
        },
        {
          "name": "穆科诺",
          "code": "MUK"
        },
        {
          "name": "纳卡皮里皮里特",
          "code": "NAK"
        },
        {
          "name": "内比",
          "code": "NEB"
        },
        {
          "name": "纳卡松戈拉",
          "code": "NKS"
        },
        {
          "name": "恩通加莫",
          "code": "NTU"
        },
        {
          "name": "帕德尔",
          "code": "PAD"
        },
        {
          "name": "帕利萨",
          "code": "PAL"
        },
        {
          "name": "拉卡伊",
          "code": "RAK"
        },
        {
          "name": "鲁昆吉里",
          "code": "RUK"
        },
        {
          "name": "森巴布莱",
          "code": "SEM"
        },
        {
          "name": "锡龙科",
          "code": "SIR"
        },
        {
          "name": "索罗提",
          "code": "SOR"
        },
        {
          "name": "托罗罗",
          "code": "TOR"
        },
        {
          "name": "瓦基索",
          "code": "WAK"
        },
        {
          "name": "永贝",
          "code": "YUM"
        }
      ]
    }
  },
  {
    "name": "乌克兰",
    "code": "UKR",
    "children": {
      "children": [
        {
          "name": "第聂伯罗波得罗夫斯克",
          "code": "12"
        },
        {
          "name": "顿涅茨克",
          "code": "14"
        },
        {
          "name": "日托米尔",
          "code": "18"
        },
        {
          "name": "外喀尔巴阡",
          "code": "21"
        },
        {
          "name": "扎波罗热",
          "code": "23"
        },
        {
          "name": "伊万－弗兰科夫州",
          "code": "26"
        },
        {
          "name": "基辅",
          "code": "30"
        },
        {
          "name": "基洛夫格勒",
          "code": "35"
        },
        {
          "name": "克里米亚自治共和国",
          "code": "43"
        },
        {
          "name": "利沃夫",
          "code": "46"
        },
        {
          "name": "尼古拉耶夫",
          "code": "48"
        },
        {
          "name": "文尼察",
          "code": "5"
        },
        {
          "name": "敖德萨",
          "code": "51"
        },
        {
          "name": "波尔塔瓦",
          "code": "53"
        },
        {
          "name": "罗夫诺",
          "code": "56"
        },
        {
          "name": "苏梅",
          "code": "59"
        },
        {
          "name": "捷尔诺波尔",
          "code": "61"
        },
        {
          "name": "哈尔科夫",
          "code": "63"
        },
        {
          "name": "赫尔松州",
          "code": "65"
        },
        {
          "name": "赫梅利尼茨基",
          "code": "68"
        },
        {
          "name": "沃伦",
          "code": "7"
        },
        {
          "name": "切尔卡瑟",
          "code": "71"
        },
        {
          "name": "切尔尼戈夫",
          "code": "74"
        },
        {
          "name": "切尔诺夫策",
          "code": "77"
        },
        {
          "name": "卢甘斯克",
          "code": "9"
        }
      ]
    }
  },
  {
    "name": "美属外岛",
    "code": "UMI"
  },
  {
    "name": "乌拉圭",
    "code": "URY",
    "children": {
      "children": [
        {
          "name": "阿蒂加斯",
          "code": "AR"
        },
        {
          "name": "卡内洛内斯",
          "code": "CA"
        },
        {
          "name": "塞罗拉尔戈",
          "code": "CL"
        },
        {
          "name": "科洛尼亚",
          "code": "CO"
        },
        {
          "name": "杜拉斯诺",
          "code": "DU"
        },
        {
          "name": "佛罗里达",
          "code": "FA"
        },
        {
          "name": "弗洛雷斯",
          "code": "FS"
        },
        {
          "name": "拉瓦耶哈",
          "code": "LA"
        },
        {
          "name": "马尔多纳多",
          "code": "MA"
        },
        {
          "name": "蒙得维的亚",
          "code": "MO"
        },
        {
          "name": "派桑杜",
          "code": "PA"
        },
        {
          "name": "内格罗河",
          "code": "RN"
        },
        {
          "name": "罗恰",
          "code": "RO"
        },
        {
          "name": "里韦拉",
          "code": "RV"
        },
        {
          "name": "圣何塞",
          "code": "SJ"
        },
        {
          "name": "萨尔托",
          "code": "SL"
        },
        {
          "name": "索里亚诺",
          "code": "SO"
        },
        {
          "name": "塔夸伦博",
          "code": "TAW"
        },
        {
          "name": "三十三人",
          "code": "TT"
        }
      ]
    }
  },
  {
    "name": "美国",
    "code": "USA",
    "children": [
      {
        "name": "阿拉斯加",
        "code": "AK",
        "children": [
          {
            "name": "安克雷奇",
            "code": "ANC"
          },
          {
            "name": "费尔班克斯",
            "code": "FAI"
          },
          {
            "name": "朱诺",
            "code": "JNU"
          }
        ]
      },
      {
        "name": "阿拉巴马",
        "code": "AL",
        "children": [
          {
            "name": "伯明罕",
            "code": "BHM"
          },
          {
            "name": "蒙哥马利",
            "code": "MGM"
          },
          {
            "name": "莫比尔",
            "code": "MOB"
          }
        ]
      },
      {
        "name": "阿肯色",
        "code": "AR",
        "children": [
          {
            "name": "史密斯堡",
            "code": "FSM"
          },
          {
            "name": "费耶特维尔",
            "code": "FYV"
          },
          {
            "name": "小石城",
            "code": "LIT"
          }
        ]
      },
      {
        "name": "亚利桑那",
        "code": "AZ",
        "children": [
          {
            "name": "格兰代尔",
            "code": "GDA"
          },
          {
            "name": "梅萨",
            "code": "MQA"
          },
          {
            "name": "凤凰城",
            "code": "PHX"
          },
          {
            "name": "史卡兹代尔",
            "code": "STZ"
          },
          {
            "name": "坦普",
            "code": "TPE"
          },
          {
            "name": "图森",
            "code": "TUC"
          },
          {
            "name": "优玛",
            "code": "YUM"
          }
        ]
      },
      {
        "name": "加利福尼亚",
        "code": "CA",
        "children": [
          {
            "name": "洛杉矶",
            "code": "LAX"
          },
          {
            "name": "圣迭戈",
            "code": "SAN"
          },
          {
            "name": "旧金山",
            "code": "SFO"
          },
          {
            "name": "圣何塞",
            "code": "SJC"
          }
        ]
      },
      {
        "name": "科罗拉多",
        "code": "CO",
        "children": [
          {
            "name": "阿斯彭",
            "code": "ASE"
          },
          {
            "name": "奥罗拉",
            "code": "AUX"
          },
          {
            "name": "科罗拉多斯普林斯",
            "code": "COS"
          },
          {
            "name": "丹佛",
            "code": "DEN"
          },
          {
            "name": "柯林斯堡",
            "code": "FNL"
          },
          {
            "name": "大章克申",
            "code": "GJT"
          },
          {
            "name": "韦尔",
            "code": "VAC"
          },
          {
            "name": "博尔德",
            "code": "WBU"
          }
        ]
      },
      {
        "name": "康涅狄格",
        "code": "CT",
        "children": [
          {
            "name": "布里奇波特",
            "code": "BDR"
          },
          {
            "name": "达里恩",
            "code": "DAQ"
          },
          {
            "name": "格林尼治",
            "code": "GRH"
          },
          {
            "name": "哈特福德",
            "code": "HFD"
          },
          {
            "name": "纽黑文",
            "code": "HVN"
          },
          {
            "name": "米德尔顿",
            "code": "XIN"
          },
          {
            "name": "新不列颠",
            "code": "NWT"
          },
          {
            "name": "沃特伯里",
            "code": "WAT"
          },
          {
            "name": "韦斯特波特",
            "code": "WPT"
          }
        ]
      },
      {
        "name": "哥伦比亚特区",
        "code": "DC",
        "children": {
          "name": "华盛顿哥伦比亚特区",
          "code": "WAS"
        }
      },
      {
        "name": "特拉华",
        "code": "DE",
        "children": [
          {
            "name": "多佛",
            "code": "DOR"
          },
          {
            "name": "威明顿",
            "code": "ILG"
          },
          {
            "name": "纽瓦克",
            "code": "NWK"
          }
        ]
      },
      {
        "name": "佛罗里达",
        "code": "FL",
        "children": [
          {
            "name": "卡纳维尔角",
            "code": "CPV"
          },
          {
            "name": "基韦斯特",
            "code": "EYW"
          },
          {
            "name": "罗德岱堡",
            "code": "FLL"
          },
          {
            "name": "杰克逊维尔",
            "code": "JAX"
          },
          {
            "name": "迈阿密",
            "code": "MIA"
          },
          {
            "name": "奥兰多",
            "code": "ORL"
          },
          {
            "name": "圣彼德斯堡市",
            "code": "PIE"
          },
          {
            "name": "塔拉哈西",
            "code": "TLH"
          },
          {
            "name": "坦帕",
            "code": "TPA"
          }
        ]
      },
      {
        "name": "佐治亚",
        "code": "GA",
        "children": [
          {
            "name": "奥古斯塔",
            "code": "AUT"
          },
          {
            "name": "哥伦布",
            "code": "CZX"
          },
          {
            "name": "梅肯",
            "code": "MCN"
          },
          {
            "name": "沙瓦纳",
            "code": "SAV"
          },
          {
            "name": "亚特兰大",
            "code": "TAT"
          }
        ]
      },
      {
        "name": "夏威夷",
        "code": "HI",
        "children": [
          {
            "name": "檀香山",
            "code": "HNL"
          },
          {
            "name": "希洛",
            "code": "ITO"
          },
          {
            "name": "凯卢阿",
            "code": "KHH"
          }
        ]
      },
      {
        "name": "爱荷华",
        "code": "IA",
        "children": [
          {
            "name": "锡达拉皮兹",
            "code": "CID"
          },
          {
            "name": "得梅因",
            "code": "DSM"
          },
          {
            "name": "达文波特",
            "code": "DVN"
          }
        ]
      },
      {
        "name": "爱达荷",
        "code": "ID",
        "children": [
          {
            "name": "布莱克富特",
            "code": "BLK"
          },
          {
            "name": "博伊西",
            "code": "BOI"
          },
          {
            "name": "科达伦",
            "code": "COE"
          },
          {
            "name": "爱达荷福尔斯",
            "code": "IDA"
          },
          {
            "name": "岂彻姆",
            "code": "QKM"
          },
          {
            "name": "刘易斯顿",
            "code": "LWS"
          },
          {
            "name": "莫斯科",
            "code": "MJL"
          },
          {
            "name": "楠帕",
            "code": "NPA"
          },
          {
            "name": "波卡特洛",
            "code": "PIH"
          },
          {
            "name": "森瓦利",
            "code": "SVY"
          },
          {
            "name": "亚美利加瀑布城",
            "code": "YAF"
          },
          {
            "name": "墨菲",
            "code": "ZMU"
          }
        ]
      },
      {
        "name": "伊利诺斯",
        "code": "IL",
        "children": [
          {
            "name": "奥尔顿",
            "code": "ALN"
          },
          {
            "name": "奥罗拉",
            "code": "AUZ"
          },
          {
            "name": "布卢明顿",
            "code": "BLO"
          },
          {
            "name": "芝加哥",
            "code": "CHI"
          },
          {
            "name": "厄巴纳-香槟",
            "code": "CMI"
          },
          {
            "name": "森特勒利亚",
            "code": "CRA"
          },
          {
            "name": "迪凯持",
            "code": "DEC"
          },
          {
            "name": "迪卡尔布",
            "code": "DEK"
          },
          {
            "name": "丹维尓",
            "code": "DVI"
          },
          {
            "name": "东圣路易斯",
            "code": "ESL"
          },
          {
            "name": "盖尔斯堡",
            "code": "GSU"
          },
          {
            "name": "卡本代尔",
            "code": "MDH"
          },
          {
            "name": "诺黙尔",
            "code": "NOM"
          },
          {
            "name": "皮奥里亚",
            "code": "PLA"
          },
          {
            "name": "罗克福德",
            "code": "RFD"
          },
          {
            "name": "罗克艾兰",
            "code": "RKI"
          },
          {
            "name": "斯普林菲尔德",
            "code": "SPI"
          },
          {
            "name": "沃其根",
            "code": "UGN"
          }
        ]
      },
      {
        "name": "印第安那",
        "code": "IN",
        "children": [
          {
            "name": "埃文斯维尔",
            "code": "EVV"
          },
          {
            "name": "韦恩堡",
            "code": "FWA"
          },
          {
            "name": "印第安纳波利斯",
            "code": "IND"
          }
        ]
      },
      {
        "name": "堪萨斯",
        "code": "KS",
        "children": [
          {
            "name": "阿比林",
            "code": "ABZ"
          },
          {
            "name": "哈钦森",
            "code": "HCH"
          },
          {
            "name": "莱文沃思",
            "code": "XIA"
          },
          {
            "name": "威奇托",
            "code": "ICT"
          },
          {
            "name": "堪萨斯城",
            "code": "KCK"
          },
          {
            "name": "劳伦斯",
            "code": "LWC"
          },
          {
            "name": "曼哈顿",
            "code": "MHK"
          },
          {
            "name": "奥弗兰公园",
            "code": "OVL"
          },
          {
            "name": "托皮卡",
            "code": "TOP"
          }
        ]
      },
      {
        "name": "肯塔基",
        "code": "KY",
        "children": [
          {
            "name": "列克星敦",
            "code": "LEX"
          },
          {
            "name": "路易斯维尔",
            "code": "LUI"
          },
          {
            "name": "欧文斯伯勒",
            "code": "OWB"
          }
        ]
      },
      {
        "name": "路易斯安那",
        "code": "LA",
        "children": [
          {
            "name": "巴吞鲁日",
            "code": "BTR"
          },
          {
            "name": "新奥尔良",
            "code": "MSY"
          },
          {
            "name": "什里夫波特",
            "code": "SHV"
          }
        ]
      },
      {
        "name": "马萨诸塞",
        "code": "MA",
        "children": [
          {
            "name": "波士顿",
            "code": "BZD"
          },
          {
            "name": "伍斯特",
            "code": "ORH"
          },
          {
            "name": "斯普林菲尔德",
            "code": "SFY"
          }
        ]
      },
      {
        "name": "马里兰",
        "code": "MD",
        "children": [
          {
            "name": "巴尔的摩",
            "code": "BAL"
          },
          {
            "name": "盖瑟斯堡",
            "code": "GAI"
          },
          {
            "name": "罗克维尔",
            "code": "RKV"
          }
        ]
      },
      {
        "name": "缅因",
        "code": "ME",
        "children": [
          {
            "name": "班戈",
            "code": "BNQ"
          },
          {
            "name": "刘易斯顿",
            "code": "QLW"
          },
          {
            "name": "波特兰",
            "code": "POL"
          }
        ]
      },
      {
        "name": "密歇根",
        "code": "MI",
        "children": [
          {
            "name": "安娜堡",
            "code": "ARB"
          },
          {
            "name": "卡拉马袓",
            "code": "AZO"
          },
          {
            "name": "贝城",
            "code": "BCY"
          },
          {
            "name": "巴特尔克里克",
            "code": "BTL"
          },
          {
            "name": "迪尔伯恩",
            "code": "DEO"
          },
          {
            "name": "底特律",
            "code": "DET"
          },
          {
            "name": "弗林特",
            "code": "FNT"
          },
          {
            "name": "大急流城",
            "code": "GRR"
          },
          {
            "name": "兰辛",
            "code": "LAN"
          },
          {
            "name": "马斯基根",
            "code": "MKG"
          },
          {
            "name": "休伦港",
            "code": "PHN"
          },
          {
            "name": "庞菷亚克",
            "code": "PTK"
          },
          {
            "name": "萨吉诺",
            "code": "SGM"
          },
          {
            "name": "苏圣玛丽",
            "code": "SSM"
          },
          {
            "name": "沃伦",
            "code": "WAM"
          },
          {
            "name": "怀恩多特",
            "code": "WYD"
          }
        ]
      },
      {
        "name": "明尼苏达",
        "code": "MN",
        "children": [
          {
            "name": "明尼阿波利斯",
            "code": "MES"
          },
          {
            "name": "罗切斯特",
            "code": "RST"
          },
          {
            "name": "圣保罗",
            "code": "STP"
          }
        ]
      },
      {
        "name": "密苏里",
        "code": "MO",
        "children": [
          {
            "name": "哥伦比亚",
            "code": "COV"
          },
          {
            "name": "杰佛逊市",
            "code": "JEF"
          },
          {
            "name": "堪萨斯城",
            "code": "MKC"
          },
          {
            "name": "斯普林菲尔德",
            "code": "SGF"
          },
          {
            "name": "圣路易斯",
            "code": "STL"
          }
        ]
      },
      {
        "name": "密西西比",
        "code": "MS",
        "children": [
          {
            "name": "比洛克西",
            "code": "BIX"
          },
          {
            "name": "格林维尔",
            "code": "GLH"
          },
          {
            "name": "格尔夫波特",
            "code": "GPT"
          },
          {
            "name": "哈蒂斯堡",
            "code": "HBG"
          },
          {
            "name": "杰克逊",
            "code": "JAN"
          },
          {
            "name": "默里迪恩",
            "code": "MEI"
          },
          {
            "name": "维克斯堡",
            "code": "VKS"
          }
        ]
      },
      {
        "name": "蒙大拿",
        "code": "MT",
        "children": [
          {
            "name": "比灵斯",
            "code": "BGS"
          },
          {
            "name": "大瀑布村",
            "code": "GTF"
          },
          {
            "name": "米苏拉",
            "code": "MSO"
          }
        ]
      },
      {
        "name": "北卡罗来纳",
        "code": "NC",
        "children": [
          {
            "name": "艾许维尔",
            "code": "AEV"
          },
          {
            "name": "教堂山",
            "code": "CHE"
          },
          {
            "name": "夏洛特",
            "code": "CRQ"
          },
          {
            "name": "杜罕",
            "code": "DHH"
          },
          {
            "name": "格林斯伯勒",
            "code": "GBO"
          },
          {
            "name": "罗利",
            "code": "RAG"
          },
          {
            "name": "洛利杜罕都会区",
            "code": "RDU"
          }
        ]
      },
      {
        "name": "北达科他",
        "code": "ND",
        "children": [
          {
            "name": "俾斯麦",
            "code": "BIS"
          },
          {
            "name": "法戈",
            "code": "FAR"
          },
          {
            "name": "大福克斯",
            "code": "GFK"
          },
          {
            "name": "迈诺特",
            "code": "MOT"
          }
        ]
      },
      {
        "name": "内布拉斯加",
        "code": "NE",
        "children": [
          {
            "name": "贝尔维尤",
            "code": "XDE"
          },
          {
            "name": "林肯",
            "code": "LNK"
          },
          {
            "name": "奥马哈",
            "code": "OMA"
          }
        ]
      },
      {
        "name": "新罕布什尔",
        "code": "NH",
        "children": [
          {
            "name": "纳舒厄",
            "code": "ASH"
          },
          {
            "name": "康科德",
            "code": "CON"
          },
          {
            "name": "曼彻斯特",
            "code": "MHT"
          }
        ]
      },
      {
        "name": "新泽西",
        "code": "NJ",
        "children": [
          {
            "name": "泽西城",
            "code": "JEC"
          },
          {
            "name": "纽瓦克",
            "code": "NRK"
          },
          {
            "name": "帕特森",
            "code": "PAT"
          }
        ]
      },
      {
        "name": "新墨西哥",
        "code": "NM",
        "children": [
          {
            "name": "阿尔伯克基",
            "code": "ABQ"
          },
          {
            "name": "拉斯克鲁塞斯",
            "code": "LRU"
          },
          {
            "name": "罗斯韦尔",
            "code": "ROW"
          },
          {
            "name": "圣菲",
            "code": "SAF"
          }
        ]
      },
      {
        "name": "内华达",
        "code": "NV",
        "children": [
          {
            "name": "卡森城",
            "code": "CSN"
          },
          {
            "name": "埃尔科",
            "code": "EKO"
          },
          {
            "name": "亨德森",
            "code": "HNZ"
          },
          {
            "name": "拉斯维加斯",
            "code": "LAS"
          },
          {
            "name": "北拉斯维加斯",
            "code": "NVS"
          },
          {
            "name": "里诺",
            "code": "RNO"
          },
          {
            "name": "斯帕克斯",
            "code": "SPK"
          },
          {
            "name": "弗吉尼亚城",
            "code": "VGI"
          }
        ]
      },
      {
        "name": "纽约",
        "code": "NY",
        "children": [
          {
            "name": "布法罗",
            "code": "FFO"
          },
          {
            "name": "纽约市",
            "code": "QEE"
          },
          {
            "name": "罗切斯特",
            "code": "ROC"
          }
        ]
      },
      {
        "name": "俄亥俄",
        "code": "OH",
        "children": [
          {
            "name": "克利夫兰",
            "code": "CLE"
          },
          {
            "name": "辛辛那提",
            "code": "CVG"
          },
          {
            "name": "哥伦布",
            "code": "CZX"
          },
          {
            "name": "代顿",
            "code": "DYT"
          },
          {
            "name": "托莱多",
            "code": "TOL"
          }
        ]
      },
      {
        "name": "俄克拉荷马",
        "code": "OK",
        "children": [
          {
            "name": "俄克拉荷马城",
            "code": "OKC"
          },
          {
            "name": "诺曼",
            "code": "OUN"
          },
          {
            "name": "塔尔萨",
            "code": "TUL"
          }
        ]
      },
      {
        "name": "俄勒冈",
        "code": "OR",
        "children": [
          {
            "name": "本德",
            "code": "BZO"
          },
          {
            "name": "库斯贝",
            "code": "COB"
          },
          {
            "name": "火山口湖",
            "code": "CTR"
          },
          {
            "name": "达拉斯",
            "code": "DAC"
          },
          {
            "name": "达尔斯",
            "code": "DLS"
          },
          {
            "name": "尤金",
            "code": "EUG"
          },
          {
            "name": "胡德里弗",
            "code": "HDX"
          },
          {
            "name": "格兰茨帕斯",
            "code": "XFX"
          },
          {
            "name": "梅德福",
            "code": "MFR"
          },
          {
            "name": "波特兰",
            "code": "PDX"
          },
          {
            "name": "塞勒姆",
            "code": "SLE"
          },
          {
            "name": "斯普林菲尔德",
            "code": "SPY"
          },
          {
            "name": "圣海伦斯",
            "code": "STH"
          },
          {
            "name": "蒂拉穆克",
            "code": "TLM"
          },
          {
            "name": "科瓦利斯",
            "code": "YCV"
          }
        ]
      },
      {
        "name": "宾夕法尼亚",
        "code": "PA",
        "children": [
          {
            "name": "阿伦敦",
            "code": "AEW"
          },
          {
            "name": "费城",
            "code": "PHL"
          },
          {
            "name": "匹兹堡",
            "code": "PIT"
          }
        ]
      },
      {
        "name": "罗德岛",
        "code": "RI",
        "children": [
          {
            "name": "克兰斯顿",
            "code": "CQH"
          },
          {
            "name": "纽波特",
            "code": "NPO"
          },
          {
            "name": "波塔基特",
            "code": "PAW"
          },
          {
            "name": "普罗维登斯",
            "code": "PVD"
          },
          {
            "name": "文索基特",
            "code": "SFN"
          },
          {
            "name": "沃威克",
            "code": "UZO"
          },
          {
            "name": "韦斯特利",
            "code": "WST"
          }
        ]
      },
      {
        "name": "南卡罗来纳",
        "code": "SC",
        "children": [
          {
            "name": "查尔斯顿",
            "code": "CHS"
          },
          {
            "name": "哥伦比亚",
            "code": "COV"
          },
          {
            "name": "北查尔斯顿",
            "code": "NTS"
          }
        ]
      },
      {
        "name": "南达科他",
        "code": "SD",
        "children": [
          {
            "name": "阿伯丁",
            "code": "ABK"
          },
          {
            "name": "苏福尔斯",
            "code": "FSD"
          },
          {
            "name": "拉皮德城",
            "code": "RAP"
          }
        ]
      },
      {
        "name": "德克萨斯",
        "code": "TX",
        "children": [
          {
            "name": "奥斯汀",
            "code": "AUS"
          },
          {
            "name": "哥帕斯基斯蒂",
            "code": "CRP"
          },
          {
            "name": "达拉斯",
            "code": "DAL"
          },
          {
            "name": "埃尔帕索",
            "code": "ELP"
          },
          {
            "name": "交维斯顿",
            "code": "GLS"
          },
          {
            "name": "休斯敦",
            "code": "HOU"
          },
          {
            "name": "拉雷多",
            "code": "LRD"
          },
          {
            "name": "圣安东尼奥",
            "code": "SAT"
          },
          {
            "name": "麦亚伦",
            "code": "TXC"
          }
        ]
      },
      {
        "name": "田纳西",
        "code": "TN",
        "children": [
          {
            "name": "纳什维尔",
            "code": "BNA"
          },
          {
            "name": "布利斯托",
            "code": "BSJ"
          },
          {
            "name": "查塔努加",
            "code": "CHA"
          },
          {
            "name": "约翰逊城",
            "code": "JCY"
          },
          {
            "name": "孟菲斯",
            "code": "MEM"
          },
          {
            "name": "士麦那",
            "code": "MQY"
          },
          {
            "name": "斯普林希尔",
            "code": "RGI"
          },
          {
            "name": "金斯波特",
            "code": "TRI"
          },
          {
            "name": "诺克斯维尔",
            "code": "TYS"
          },
          {
            "name": "三城区",
            "code": "YTC"
          }
        ]
      },
      {
        "name": "犹他",
        "code": "UT",
        "children": [
          {
            "name": "雷登",
            "code": "LTJ"
          },
          {
            "name": "欧仁",
            "code": "OEU"
          },
          {
            "name": "奥格登",
            "code": "OGD"
          },
          {
            "name": "帕克城",
            "code": "PAC"
          },
          {
            "name": "普罗沃",
            "code": "PVU"
          },
          {
            "name": "圣乔治",
            "code": "SGU"
          },
          {
            "name": "盐湖城",
            "code": "SLC"
          },
          {
            "name": "西瓦利城",
            "code": "WVC"
          }
        ]
      },
      {
        "name": "维吉尼亚",
        "code": "VA",
        "children": [
          {
            "name": "切萨皮克",
            "code": "HTW"
          },
          {
            "name": "诺福克",
            "code": "ORF"
          },
          {
            "name": "弗吉尼亚比奇",
            "code": "VAB"
          }
        ]
      },
      {
        "name": "佛蒙特",
        "code": "VT",
        "children": [
          {
            "name": "伯灵顿",
            "code": "BTV"
          },
          {
            "name": "拉特兰",
            "code": "RUT"
          },
          {
            "name": "南伯灵顿",
            "code": "ZBR"
          }
        ]
      },
      {
        "name": "华盛顿",
        "code": "WA",
        "children": [
          {
            "name": "斯波坎",
            "code": "GEG"
          },
          {
            "name": "西雅图",
            "code": "SEA"
          },
          {
            "name": "塔科马",
            "code": "TTW"
          }
        ]
      },
      {
        "name": "威斯康星",
        "code": "WI",
        "children": [
          {
            "name": "阿普尓顿",
            "code": "ATW"
          },
          {
            "name": "沃索",
            "code": "AUW"
          },
          {
            "name": "欧克莱尓",
            "code": "EAU"
          },
          {
            "name": "基诺沙",
            "code": "ENW"
          },
          {
            "name": "格林贝",
            "code": "GBK"
          },
          {
            "name": "迈迪逊",
            "code": "QMD"
          },
          {
            "name": "拉克罗斯",
            "code": "LSE"
          },
          {
            "name": "密尔沃基",
            "code": "MKE"
          },
          {
            "name": "马尼托沃克",
            "code": "MTW"
          },
          {
            "name": "奥什科什",
            "code": "OSH"
          },
          {
            "name": "拉辛",
            "code": "RAC"
          },
          {
            "name": "希博伊根",
            "code": "SBM"
          }
        ]
      },
      {
        "name": "西佛吉尼亚",
        "code": "WV",
        "children": [
          {
            "name": "查尔斯顿",
            "code": "CRW"
          },
          {
            "name": "亨廷顿",
            "code": "HNU"
          },
          {
            "name": "帕克斯堡",
            "code": "PKB"
          }
        ]
      },
      {
        "name": "怀俄明",
        "code": "WY",
        "children": [
          {
            "name": "卡斯珀",
            "code": "CPR"
          },
          {
            "name": "夏延",
            "code": "CYS"
          },
          {
            "name": "埃文斯顿",
            "code": "EVD"
          },
          {
            "name": "拉勒米",
            "code": "LAR"
          },
          {
            "name": "罗克斯普林斯",
            "code": "RKS"
          },
          {
            "name": "谢里登",
            "code": "SHR"
          }
        ]
      }
    ]
  },
  {
    "name": "乌兹别克斯坦",
    "code": "UZB",
    "children": {
      "children": [
        {
          "name": "安集延",
          "code": "AN"
        },
        {
          "name": "布哈拉",
          "code": "BU"
        },
        {
          "name": "费尔干纳",
          "code": "FA"
        },
        {
          "name": "花拉子模",
          "code": "XO"
        },
        {
          "name": "吉扎克",
          "code": "JI"
        },
        {
          "name": "卡什卡达里亚",
          "code": "QA"
        },
        {
          "name": "卡拉卡尔帕克斯坦共和国",
          "code": "QR"
        },
        {
          "name": "纳曼干",
          "code": "NG"
        },
        {
          "name": "纳沃伊",
          "code": "NW"
        },
        {
          "name": "撒马尔罕",
          "code": "SA"
        },
        {
          "name": "锡尔河",
          "code": "SI"
        },
        {
          "name": "苏尔汉河",
          "code": "SU"
        },
        {
          "name": "塔什干",
          "code": "TK"
        },
        {
          "name": "塔什干市",
          "code": "TO"
        }
      ]
    }
  },
  {
    "name": "梵蒂冈",
    "code": "VAT"
  },
  {
    "name": "圣文森特和格林纳丁斯",
    "code": "VCT"
  },
  {
    "name": "委内瑞拉",
    "code": "VEN",
    "children": {
      "children": [
        {
          "name": "加拉加斯",
          "code": "A"
        },
        {
          "name": "安索阿特吉",
          "code": "B"
        },
        {
          "name": "阿普雷",
          "code": "C"
        },
        {
          "name": "阿拉瓜",
          "code": "D"
        },
        {
          "name": "巴里纳斯",
          "code": "E"
        },
        {
          "name": "玻利瓦尔",
          "code": "F"
        },
        {
          "name": "卡拉沃沃",
          "code": "G"
        },
        {
          "name": "科赫德斯",
          "code": "H"
        },
        {
          "name": "法尔孔",
          "code": "I"
        },
        {
          "name": "瓜里科",
          "code": "J"
        },
        {
          "name": "拉腊",
          "code": "K"
        },
        {
          "name": "梅里达",
          "code": "L"
        },
        {
          "name": "米兰达",
          "code": "M"
        },
        {
          "name": "莫纳加斯",
          "code": "N"
        },
        {
          "name": "新埃斯帕塔",
          "code": "O"
        },
        {
          "name": "波图格萨",
          "code": "P"
        },
        {
          "name": "苏克雷",
          "code": "R"
        },
        {
          "name": "塔奇拉",
          "code": "S"
        },
        {
          "name": "特鲁希略",
          "code": "T"
        },
        {
          "name": "亚拉奎",
          "code": "U"
        },
        {
          "name": "苏利亚",
          "code": "V"
        },
        {
          "name": "联邦属地",
          "code": "W"
        },
        {
          "name": "阿马库罗三角洲",
          "code": "Y"
        },
        {
          "name": "亚马孙",
          "code": "Z"
        }
      ]
    }
  },
  {
    "name": "维尔京群岛，英属",
    "code": "VGB"
  },
  {
    "name": "维尔京群岛，美属",
    "code": "VIR"
  },
  {
    "name": "越南",
    "code": "VNM",
    "children": {
      "children": [
        {
          "name": "胡志明市",
          "code": "HC"
        },
        {
          "name": "河内",
          "code": "HI"
        },
        {
          "name": "海防",
          "code": "HP"
        }
      ]
    }
  },
  {
    "name": "瓦努阿图",
    "code": "VUT",
    "children": {
      "children": [
        {
          "name": "马朗帕",
          "code": "MA"
        },
        {
          "name": "彭纳马",
          "code": "PE"
        },
        {
          "name": "桑马",
          "code": "SA"
        },
        {
          "name": "谢法",
          "code": "SH"
        },
        {
          "name": "塔菲阿",
          "code": "TA"
        },
        {
          "name": "托尔巴",
          "code": "TO"
        }
      ]
    }
  },
  {
    "name": "瓦利斯和福图纳",
    "code": "WLF"
  },
  {
    "name": "萨摩亚",
    "code": "WSM"
  },
  {
    "name": "也门",
    "code": "YEM",
    "children": {
      "children": [
        {
          "name": "阿比扬",
          "code": "AB"
        },
        {
          "name": "亚丁",
          "code": "AD"
        },
        {
          "name": "阿姆兰",
          "code": "AM"
        },
        {
          "name": "希赫尔",
          "code": "ASR"
        },
        {
          "name": "贝达",
          "code": "BA"
        },
        {
          "name": "达利",
          "code": "DA"
        },
        {
          "name": "扎玛尔",
          "code": "DH"
        },
        {
          "name": "赛文",
          "code": "GXF"
        },
        {
          "name": "哈德拉毛",
          "code": "HD"
        },
        {
          "name": "哈杰",
          "code": "HJ"
        },
        {
          "name": "荷台达",
          "code": "HU"
        },
        {
          "name": "伊卜",
          "code": "IB"
        },
        {
          "name": "焦夫",
          "code": "JA"
        },
        {
          "name": "拉赫季",
          "code": "LA"
        },
        {
          "name": "马里卜",
          "code": "MA"
        },
        {
          "name": "迈赫拉",
          "code": "MR"
        },
        {
          "name": "迈赫维特",
          "code": "MW"
        },
        {
          "name": "萨达",
          "code": "SD"
        },
        {
          "name": "舍卜沃",
          "code": "SH"
        },
        {
          "name": "萨那",
          "code": "SN"
        },
        {
          "name": "塔伊兹",
          "code": "TA"
        }
      ]
    }
  },
  {
    "name": "南非",
    "code": "ZAF",
    "children": {
      "children": [
        {
          "name": "东巴克利",
          "code": "BAE"
        },
        {
          "name": "布雷达斯多普",
          "code": "BDD"
        },
        {
          "name": "西博福特",
          "code": "BEW"
        },
        {
          "name": "布隆方丹",
          "code": "BFN"
        },
        {
          "name": "布隆克斯特斯普利特",
          "code": "BHT"
        },
        {
          "name": "比索",
          "code": "BIY"
        },
        {
          "name": "开普敦",
          "code": "CPT"
        },
        {
          "name": "德阿尔",
          "code": "DAA"
        },
        {
          "name": "邓迪",
          "code": "DUN"
        },
        {
          "name": "德班",
          "code": "DUR"
        },
        {
          "name": "东伦敦",
          "code": "ELS"
        },
        {
          "name": "格罗布莱斯达尔",
          "code": "GBD"
        },
        {
          "name": "基雅尼",
          "code": "GIY"
        },
        {
          "name": "乔治",
          "code": "GRJ"
        },
        {
          "name": "特克索波",
          "code": "IXO"
        },
        {
          "name": "约翰内斯堡",
          "code": "JNB"
        },
        {
          "name": "克莱克斯多普",
          "code": "KXE"
        },
        {
          "name": "金伯利",
          "code": "KIM"
        },
        {
          "name": "库鲁曼",
          "code": "KMH"
        },
        {
          "name": "莱迪史密斯",
          "code": "LAY"
        },
        {
          "name": "艾利弗山",
          "code": "MAY"
        },
        {
          "name": "米德尔堡",
          "code": "MDB"
        },
        {
          "name": "穆里斯堡",
          "code": "MOO"
        },
        {
          "name": "姆库泽",
          "code": "MZQ"
        },
        {
          "name": "纽卡斯尔",
          "code": "NCS"
        },
        {
          "name": "内尔斯普雷特",
          "code": "NLP"
        },
        {
          "name": "尼尔斯特隆",
          "code": "NYL"
        },
        {
          "name": "伊丽莎白港",
          "code": "PLZ"
        },
        {
          "name": "比勒陀利亚",
          "code": "PRY"
        },
        {
          "name": "谢普斯通港",
          "code": "PSS"
        },
        {
          "name": "彼德斯堡",
          "code": "PTG"
        },
        {
          "name": "彼德马里茨堡",
          "code": "PZB"
        },
        {
          "name": "理查兹湾",
          "code": "RCB"
        },
        {
          "name": "兰德方丹",
          "code": "RFT"
        },
        {
          "name": "利斯滕堡",
          "code": "RSB"
        },
        {
          "name": "萨索尔堡",
          "code": "SAS"
        },
        {
          "name": "跳羚",
          "code": "SBU"
        },
        {
          "name": "托霍延杜",
          "code": "THY"
        },
        {
          "name": "图拉马哈谢",
          "code": "TLH"
        },
        {
          "name": "特隆普斯堡",
          "code": "TPB"
        },
        {
          "name": "乌伦迪",
          "code": "ULD"
        },
        {
          "name": "阿平顿",
          "code": "UTN"
        },
        {
          "name": "乌姆塔塔",
          "code": "UTT"
        },
        {
          "name": "昆士敦",
          "code": "UTW"
        },
        {
          "name": "弗里尼欣",
          "code": "VGG"
        },
        {
          "name": "弗雷堡",
          "code": "VRU"
        },
        {
          "name": "韦尔科姆",
          "code": "WEL"
        },
        {
          "name": "伍斯特",
          "code": "WOR"
        },
        {
          "name": "韦茨肖克",
          "code": "WSH"
        },
        {
          "name": "瑟孔达",
          "code": "ZEC"
        }
      ]
    }
  },
  {
    "name": "赞比亚",
    "code": "ZMB",
    "children": {
      "children": [
        {
          "name": "铜带",
          "code": "CB"
        },
        {
          "name": "中央",
          "code": "CE"
        },
        {
          "name": "东方",
          "code": "EA"
        },
        {
          "name": "卢萨卡",
          "code": "LK"
        },
        {
          "name": "卢阿普拉",
          "code": "LP"
        },
        {
          "name": "北方",
          "code": "NO"
        },
        {
          "name": "西北",
          "code": "NW"
        },
        {
          "name": "南方",
          "code": "SO"
        },
        {
          "name": "西方",
          "code": "WE"
        }
      ]
    }
  },
  {
    "name": "津巴布韦",
    "code": "ZWE",
    "children": {
      "children": [
        {
          "name": "布拉瓦约",
          "code": "BU"
        },
        {
          "name": "哈拉雷",
          "code": "HA"
        },
        {
          "name": "中马绍纳兰",
          "code": "MC"
        },
        {
          "name": "中部",
          "code": "MD"
        },
        {
          "name": "东马绍纳兰",
          "code": "ME"
        },
        {
          "name": "马尼卡兰",
          "code": "ML"
        },
        {
          "name": "北马塔贝莱兰",
          "code": "MN"
        },
        {
          "name": "南马塔贝莱兰",
          "code": "MS"
        },
        {
          "name": "马斯温戈",
          "code": "MV"
        },
        {
          "name": "西马绍纳兰",
          "code": "MW"
        }
      ]
    }
  }
]